/*
-- insert into dbo.tFVEventMaster(eventstatemaster) values(0)
-- update dbo.tFVEventMaster set eventstatemaster = case when eventstatemaster = 0 then 1 else 0 end where idx = 1
-- select eventstatemaster from dbo.tFVEventMaster where idx = 1

-- select 'exec spu_FVFarmD 30, 52,  1, -1,' + str(eventitemcode) + ', 1, '+str(eventcnt)+', -1, -1, -1, '''','''', ''sangsang'', '+ str(eventday) + ', 12, 23, '''', '''', ''' + eventpushtitle + ''', ''' + eventpushmsg + ''''
-- from dbo.tFVEventSub


exec spu_FVFarmD 30, 52,  1, -1,      3000, 1,        300, -1, -1, -1, '','', 'sangsang',          1, 12, 23, '', '', '2015년 새해가 밝았습니다.', '새해 복 많이 받으세요'
exec spu_FVFarmD 30, 52,  1, -1,      3002, 1,        100, -1, -1, -1, '','', 'sangsang',          2, 12, 23, '', '', '즐거운 양띠의 해 2015년 새해에도', '재미있는 짜요 외전과 함께 즐겨요'
exec spu_FVFarmD 30, 52,  1, -1,      3001, 1,        100, -1, -1, -1, '','', 'sangsang',          3, 12, 23, '', '', '행복한 주말! 재미있는 짜요 외전', '모두 같이 즐겨보아요!'
exec spu_FVFarmD 30, 52,  1, -1,      3002, 1,         80, -1, -1, -1, '','', 'sangsang',          4, 12, 23, '', '', '행복한 주말! 즐거운 목장LIFE를', '짜요목장이야기 외전에서 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3003, 1,         80, -1, -1, -1, '','', 'sangsang',          5, 12, 23, '', '', '피곤한 월요일에는', '재밌는 외전과 함께하면 즐거워져요'
exec spu_FVFarmD 30, 52,  1, -1,      3004, 1,        100, -1, -1, -1, '','', 'sangsang',          6, 12, 23, '', '', '즐겁고 다양한 이벤트', '외전과 함께 즐겨보아요!'
exec spu_FVFarmD 30, 52,  1, -1,      3005, 1,        100, -1, -1, -1, '','', 'sangsang',          7, 12, 23, '', '', '주인님을 애타게 기다리고 있어요~', '지금 접속해서 빨리 관리해주세요~ 터질것 같아요 ㅠ_ㅠ'
exec spu_FVFarmD 30, 52,  1, -1,      3006, 1,        100, -1, -1, -1, '','', 'sangsang',          8, 12, 23, '', '', '즐겁고 다양한 이벤트', '불쌍한 가축들에게 관리해주고 유제품도 판매해제주세요~'
exec spu_FVFarmD 30, 52,  1, -1,      3007, 1,        100, -1, -1, -1, '','', 'sangsang',          9, 12, 23, '', '', '짜요외전과 함께하면 ', '절대 심심하지 않은 하루! 지금 접속하세요~!'
exec spu_FVFarmD 30, 52,  1, -1,      3008, 1,        100, -1, -1, -1, '','', 'sangsang',         10, 12, 23, '', '', '따뜻한 카페라떼와 함께', '짜요 외전을 즐겨보세요~'
exec spu_FVFarmD 30, 52,  1, -1,      3015, 1,        100, -1, -1, -1, '','', 'sangsang',         11, 12, 23, '', '', '지금바로 접속해보세요.', '결정을 모아뒀습니다. 받아가세요~'
exec spu_FVFarmD 30, 52,  1, -1,      3003, 1,        100, -1, -1, -1, '','', 'sangsang',         12, 12, 23, '', '', '불금엔 신나게 놀고 집에 올때', '짜요 외전을 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3001, 1,        100, -1, -1, -1, '','', 'sangsang',         13, 12, 23, '', '', '서프라이즈 1+1 추가 지급 이벤트 진행 중', '구매하시면 선물함에 우유결정이 우왕'
exec spu_FVFarmD 30, 52,  1, -1,      3002, 1,        100, -1, -1, -1, '','', 'sangsang',         14, 12, 23, '', '', '서프라이즈 1+1 추가 지급 이벤트 진행 중', '구매하시면 선물함에 우유결정이 우왕 굿'
exec spu_FVFarmD 30, 52,  1, -1,      3003, 1,        100, -1, -1, -1, '','', 'sangsang',         15, 12, 23, '', '', '새로운 한주의 시작을', '짜요 외전과 같이 시작해보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3004, 1,        100, -1, -1, -1, '','', 'sangsang',         16, 12, 23, '', '', '추운 겨울 집에서만 빈둥빈둥할 때', '재미있는 짜요 외전을 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3005, 1,        100, -1, -1, -1, '','', 'sangsang',         17, 12, 23, '', '', '점심시간 이후에 피곤할 때는', '여유로운 짜요 외전으로 피로를 풀어보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3006, 1,        100, -1, -1, -1, '','', 'sangsang',         18, 12, 23, '', '', '신나고 다양한 이벤트를', '짜요 외전과 함께 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3007, 1,        100, -1, -1, -1, '','', 'sangsang',         19, 12, 23, '', '', '불금을 즐기는 또다른 방법', '짜요 외전을 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3000, 1,        100, -1, -1, -1, '','', 'sangsang',         20, 12, 23, '', '', '맛있는 우유 먹고 여유롭게', '짜요 외전을 즐기실 준비 되셨나요'
exec spu_FVFarmD 30, 52,  1, -1,      3015, 1,        100, -1, -1, -1, '','', 'sangsang',         21, 12, 23, '', '', '절호의 찬스!!! 이번기회 놓치지 마세요', '우유 결정 100개를 선물함으로 드려요'
exec spu_FVFarmD 30, 52,  1, -1,      3002, 1,        100, -1, -1, -1, '','', 'sangsang',         22, 12, 23, '', '', '동물들이 추워서 떨고 있어요', '불쌍한 동물들을 관리해주고, 우유제품도 팔아보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3003, 1,        100, -1, -1, -1, '','', 'sangsang',         23, 12, 23, '', '', '사랑스러운 동물들과 함께 ', '즐거운 짜요 외전을 신나게 즐겨보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3004, 1,        100, -1, -1, -1, '','', 'sangsang',         24, 12, 23, '', '', '신나는 크리스마스 이브에도 ', '짜요 외전과 함께 이벤트를 참여해보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3005, 1,        100, -1, -1, -1, '','', 'sangsang',         25, 12, 23, '', '', '짜요 외전 크리스마스 기념 이벤트!!', '이벤트에서 다양한 혜택과 재미를 찾아보세요'
exec spu_FVFarmD 30, 52,  1, -1,      3006, 1,        100, -1, -1, -1, '','', 'sangsang',         26, 12, 23, '', '', '여유롭게 즐길 수 있는', '짜요 외전을 친구들과 함께해요'
exec spu_FVFarmD 30, 52,  1, -1,      3007, 1,        100, -1, -1, -1, '','', 'sangsang',         27, 12, 23, '', '', '훈훈한 분위기의 짜요 외전과 함꼐', '더욱 재미있고 즐거운 하루 보내세요'
exec spu_FVFarmD 30, 52,  1, -1,      3000, 1,        100, -1, -1, -1, '','', 'sangsang',         28, 12, 23, '', '', '짜요 외전에서 다양한 이벤트가', '진행중입니다 참여해서 혜택을 받아가세요'
exec spu_FVFarmD 30, 52,  1, -1,      3001, 1,        100, -1, -1, -1, '','', 'sangsang',         29, 12, 23, '', '', '동물들이 여러분을 보고싶어해요', '짜요 외전에 들어오셔서 동물을 보살펴주세요'
exec spu_FVFarmD 30, 52,  1, -1,      3015, 1,        100, -1, -1, -1, '','', 'sangsang',         30, 12, 23, '', '', '절호의 찬스!!! 이번기회 놓치지 마세요', '우유 결정 100개를 선물함으로 드려요'
exec spu_FVFarmD 30, 52,  1, -1,      3003, 1,        100, -1, -1, -1, '','', 'sangsang',         31, 12, 23, '', '', '1월달이 끝나가네요 곧 봄이오겠죠', '앞으로 더 재밌어지는 짜요 외전과 함께해요'
*/