/*
exec spu_KakaoFriendAdd 'xxxx2',  '049000s1i0n7t8445289', '0:kakaouseridxxxx;1:kakaouseridxxxx3;', -1
exec spu_KakaoFriendAdd 'farm475',  '5835637x1w8u9f873297', '0:88470968441492992;1:91188455545412240;2:88287440312089585;3:88258263875124913;4:91408079342706913;5:88103356826892544;6:88141973561720689;7:88072204762769425;8:88812599272546640;9:91226849457314705;', -1


exec spu_KakaoFriendAdd 'farm1503',  '5191190h4e5c1q577156', '0:88227566776204833;1:88248034712699921;2:88282071099937857;', -1
exec spu_KakaoFriendAdd 'farm1503',  '5191190h4e5c1q577156', '0:88227566776204833;1:88248034712699921;2:88282071099937857;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:88080325305958257;1:88199763797310464;2:88425153556119328;3:88176674401172689;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:88905078488191361;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:91676178443041985;1:88064195453681152;2:88073048800170049;3:88101340977472337;4:88258686720888753;5:88163781489988577;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:88570694202471856;1:88174217481002816;2:88865488504955489;3:88201090686879521;4:88063913919202000;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:90886943562517328;1:88190546682335761;2:88303559368467329;3:88072352734944560;4:88191457958216448;5:88101212375584657;6:88097084909395104;7:90248510871257809;8:88261540499608081;9:88181820431437473;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88201090686879521;1:88101340977472337;2:88330341487944081;3:88199763797310464;4:88075274010382529;5:88069190525611041;6:91526882431102017;7:88865488504955489;8:88176674401172689;9:88064195453681152;10:88073048800170049;11:88063913919202000;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1503',  '5191190h4e5c1q577156', '0:91000939733102337;1:88067947545228816;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:89100139693190337;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1249',  '3881694o6u4x3b294214', '0:88061870631252112;1:88812499508371520;2:88454673481189408;3:88793154725011153;4:88140631092800705;5:88307559325377889;6:88238457592539889;7:88061471345929184;8:88090963864119568;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm1336',  '9215656n0w0u3l437434', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm2140',  '6384038f4n5l2p846344', '0:88101340977472337;1:88072352734944560;2:88339069468243088;3:88307559325377889;4:88080325305958257;5:88330341487944081;6:88199763797310464;7:88238457592539889;8:88140631092800705;9:88265580799059952;10:88454673481189408;11:90248510871257809;12:88163781489988577;13:88793154725011153;14:88097084909395104;15:88194113529253616;16:88090963864119568;17:88075274010382529;18:88351391174765153;19:91676178443041985;20:88061870631252112;21:88204946045983905;22:88117784876132689;23:91526882431102017;24:88812499508371520;25:88572629263219377;26:88252880585803392;27:90405355752801377;28:88176674401172689;29:88064195453681152;30:90886943562517328;31:88181820431437473;32:88197527910821921;33:88101212375584657;34:88073048800170049;35:88096235276690720;36:88425153556119328;37:88061471345929184;38:88069190525611041;39:91610705374558129;40:88201090686879521;41:88063913919202000;42:88570694202471856;', -1
exec spu_KakaoFriendAdd 'farm2140',  '6384038f4n5l2p846344', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm2140',  '6384038f4n5l2p846344', '0:88069190525611041;', -1
exec spu_KakaoFriendAdd 'farm2140',  '6384038f4n5l2p846344', '0:88293738841848528;1:88069190525611041;2:88106204730209152;3:88067354040525536;', -1
*/
use Game4Farmvill5
GO

IF OBJECT_ID ( 'dbo.spu_KakaoFriendAdd', 'P' ) IS NOT NULL
    DROP PROCEDURE dbo.spu_KakaoFriendAdd;
GO

create procedure dbo.spu_KakaoFriendAdd
	@gameid_				varchar(20),
	@password_				varchar(20),
	@kakaouseridlist_		varchar(8000),
	@nResult_				int				OUTPUT
	--WITH ENCRYPTION -- 프로시져를 암호화함.
as
	------------------------------------------------
	--	2-1. 에러코드값
	------------------------------------------------
	-- 일반값
	declare @RESULT_SUCCESS						int				set @RESULT_SUCCESS						=  1
	declare @RESULT_ERROR						int				set @RESULT_ERROR						= -1

	-- 로그인 오류.
	declare @RESULT_ERROR_NOT_FOUND_GAMEID		int				set @RESULT_ERROR_NOT_FOUND_GAMEID		= -13			--해당유저를 찾지 못함

	------------------------------------------------
	--	2-1. 내부사용 변수
	------------------------------------------------
	declare @comment		varchar(128)
	declare @gameid			varchar(20)		set @gameid			= ''
Begin
	------------------------------------------------
	--	3-1. 초기화
	------------------------------------------------
	set nocount on
	set @nResult_ = @RESULT_ERROR
	set @comment = '알수 없는 오류가 발생했습니다.'
	--select 'DEBUG 1', @gameid_ gameid_, @password_ password_, @kakaouseridlist_ kakaouseridlist_

	------------------------------------------------
	--	3-2. 정보획득
	------------------------------------------------
	select
		@gameid = gameid
	from dbo.tUserMaster
	where gameid = @gameid_ and password = @password_
	--select 'DEBUG 2', @gameid gameid

	------------------------------------------------
	--	3-3. 유저생성.
	------------------------------------------------
	if (@gameid = '')
		begin
			set @nResult_ 	= @RESULT_ERROR_NOT_FOUND_GAMEID
			set @comment 	= 'ERROR 아이디가 존재하지 않는다.'
			--select 'DEBUG 3' + @comment
		end
	else
		begin
			set @nResult_ = @RESULT_SUCCESS
			set @comment = '친구를 추가했습니다.'
			--select 'DEBUG 4', @comment

			if(LEN(@kakaouseridlist_) >= 3)
				begin
					-- DEBUG 친구추가 서브 프로세서 호출	farm1503	0:88227566776204833;1:88248034712699921;2:88282071099937857;
					--select 'DEBUG 친구추가 서브 프로세서 호출', @gameid_ gameid_, @kakaouseridlist_ kakaouseridlist_
					exec sup_subAddKakaoFriend @gameid_, @kakaouseridlist_
				end
		end

	------------------------------------------------
	--	3-3. 결과리턴
	------------------------------------------------
	select @nResult_ rtn, @comment comment
	if(@nResult_ = @RESULT_SUCCESS)
		begin
			--------------------------------------------------------------
			-- 유저 친구정보
			-- 카피 & 사라지면 대처동물로.(없으면 기초동물로 교체)
			--------------------------------------------------------------
			--select 'DEBUG 유저 친구정보 출력'
			exec spu_subFriendList @gameid_
		end

	--최종 결과를 리턴한다.
	set nocount off
End



