--[홈런리그 배트걸~]
--모든 플레이어를 위한 무료 선물!!!(뽑기코인)
-- 여러분들의 관심과 사랑으로 뽑기 코인 3개를 지급했습니다.
-- 오늘도 여러분들의 관심과 사랑으로 뽑기 코인 3개를 지급했습니다.
--2013-01-22
--2013-01-23
--2013-01-24
--2013-01-25
-- [홈런리그 뽑기코인지급]
-- 게임횟수 60만회돌파 오늘도 여러분들의 관심과 사랑으로 뽑기 코인 3개를 지급했습니다.
--2013-01-25 오후
-- [홈런리그 뽑기코인지급]
-- 즐거운 주말에 행운이 있기를 바라면 추가 뽑기 코인 6개를 지급했습니다.
-- update dbo.tUserMaster set coin = case when coin < 6 then 6 else coin end
-- [홈런리그 뽑기코인자동지급(2일간)]
-- 여러분들의 성원으로 추천되어서 로그인시 코인지급을 2일간 3개로 상향 지급하도록 하였습니다.
--2013-01-29
--[홈런리그 1.0.7신규업데이트]
--신규버젼 업데이트 기념으로 완료~~(뽑기 코인 3개지급)
--update dbo.tUserMaster set coin = case when coin < 3 then 3 else coin end
--[홈런리그 뽑기코인 추가5개]
--여러분의 관심으로 3사 모두패치 기념으로 뽑기코인 추가5개 더 드립니다.
--update dbo.tUserMaster set coin = coin + 5
--2013-01-30
--[홈런리그 80만기념 뽑기템 8개]
--단기가 게임횟수 80만회돌파 오늘도 여러분들의 관심과 사랑으로 뽑기 코인 8개를 지급했습니다.
--update dbo.tUserMaster set coin = case when coin < 8 then 8 else coin end
--2013-01-30
--[홈런리그 스테미너 할인 이벤트!]
--게임내 모든 스테미너를 최대 50% 할인된 가격으로 제공합니다!!!서두르세요~
--2013-01-31
--[홈런리그 뽑기템 3개]
--뽑기코인 3개지급, 나로호 발사 축~~~~~
--update dbo.tUserMaster set coin = case when coin < 3 then 3 else coin end
--[홈런리그 뽑기템3개, 배트템 추가지급]
--뽑기템 3개와 배트템을 나로호 성공적 발사 기념으로 지급했습니다.
--
--update dbo.tUserMaster set coin = coin + 5
--[홈런리그 뽑기템5개 지급]
--고렙 일부 유저 정보가 오동작 했습니다. 운영에 미숙해서 사과드립니다.
--update dbo.tUserMaster set coin = coin + 3
--[홈런리그 뽑기템3개 주말이벤트]
--뽑기템 3개를 지급해드립니다. 즐거운 주말을 홈런리그와 함께 즐겨주세요.
--2013-02-16
--update dbo.tUserMaster set coin = coin + 3
--[홈런리그 뽑기템3개 설연휴]
--[뽑기 코인 3개 지급]즐거운 명절이 코앞! 홈런리그와 함께하세요~
--[홈런리그 뽑기템3개 설연휴]
--[뽑기 코인 3개 지급]즐거운 명절이! 홈런리그와 함께하세요~
--update dbo.tUserMaster set coin = coin + 10
--[홈런리그 뽑기템10개]
--[뽑기 코인 10개 지급]강화실패시 하락방지 및 강화 확률대폭 상승
--update dbo.tUserMaster set coin = coin + 3
--[홈런리그 뽑기템3개]
--[뽑기 코인 3개 지급]여러분의 밸런타인데이를 응원합니다. 한판 어떤가요?
--update dbo.tUserMaster set coin = coin + 5
--[홈런리그 뽑기템5개]
--여러분의 성원으로 100만회 도달!!!!
--[홈런리그 뽑기템5개(무료)]
--잠시 서버 오동작으로 인해 보상차원에서 5개지급(무료)!!!!
--update dbo.tUserMaster set coin = coin + 3
--[홈런리그 뽑기템3개(무료)]
--점심 시간에 시원하게 한판 어떤가요?(무료)!!!!
--[홈런리그 야구한판]
--점심 시간에 시원하게 한판 어떤가요?!!!!
--update dbo.tUserMaster set coin = coin + 3
--[야구한판 어떤가요?]
--(뽑기코인3개지급)퇴근후 시원하게 한판 어떤가요?!!!!
--[홈런리그 배트걸~]
--모든 플레이어를 위한 무료 선물!!!(뽑기코인)
--[홈런리그 배트걸~]
--(뽑기코인)모든 플레이어를 위한 무료 선물!!!

----------------------------------------------------------------------------------------
[SKT, KT, LGT]
★친추하면 아이템 팡팡!!★
 > 추천유저 : 5골드(500원), 뽑기코인10개, 오토히트 20개 즉시 지급
 > 가입유저 : SMS추천 받고 가입하면 뽑기코인10개, 오토히트 20개 즉시 지급
(추천유저가 10명 가입시키면 10명 x 5골드 해서 50골드로 중복 지급 받습니다.)


[Naver, 유료 무료]
★친추하면 아이템 팡팡!!★
 > 추천유저 : 10골드(1000원), 뽑기코인10개, 오토히트 20개 즉시 지급
 > 가입유저 : SMS추천 받고 Naver를 통해서 가입하면 5골드코인(500원), 뽑기코인10개, 오토히트 20개 즉시 지급
(추천유저가 10명 가입시키면 10명 x 10골드 해서 100골드로 중복 지급 받습니다.)


★T스토어 추천게임 선정!!★
내일 오전 10시 까지 특수 강화 스페셜 아이템을 획득할 수 있는 뽑기코인 3개 100% 지급!
*상점 우측의 뽑기 기계를 확인하세요.

★친추하면 아이템 팡팡!!★
스테미너 문자 추천후 받은 사람이 가입을 하면 추천자와 가입자에게 뽑기코인10개, 오토히트 20개를 각각 지급합니다.
(여러명 추천시 중복 지급)

★GM? 발라버려~~!!★
게임중 '홈런GM'이 수시로 대결신청을 합니다.
대결에 응해 이길 시 "뽑기코인 10개"를 바로 지급합니다. 

[1.0.7 패치S]
- 하단 지역(국가로 변경예정)은 랭킹 순위를 말합니다.
- 퀘스트 버그 수정
- 트레이스 조절 난이도 하향조절
- 1일 무한 스테미너 이용권
- 문자추천하고 추천받은 사람과 추천인 룰렛코인지급 예정
- 게임중 역전 아이템 추가
- 기타 UI 추가 및 변경
- 더블광고 로그인 할때만 1회만 나오게 수정
- 아이템 강화비용 가변적 조절
- 추천문자 스테미너 지급 하향조절, 1일 1회만 지급
- 볼트레이스 아이템 가격 상향조절

[1.0.8 패치예정S]
- 스테미너 가격 할인 또는 하향 조절예정
- 역전아이템 위치 조정, 설명시간 자세한 설명
- 신규 아이템 추가
- 지역을 국가로 일괄 변경
- 기타 기능 수정예정
- 트레이스 가격 300 -> 90으로 하향조절(서버적용된상태)
----------------------
- 스테미너 가격하향조절



----------------------------------------------------------------------------------------------
[1.0.8 패치L]
- 매주 랭킹 초기화시 스테미너 충전(패치완료)
- 문자추천후 스테미너 1지급(표기오류)
- 트레이스 가격 300 -> 90으로 하향조절(패치완료)
- 역전아이템 위치 조정, 설명시간 자세한 설명
- 지역을 국가로 일괄 변경
- 기타 기능 수정
- 고렙유저 정보 정상출력
- 아이템의 영구 소유 강화 레벨이 20 단계에서 40 단계로 상승
 > 기존 영구 전환된것은 해당사항 없음
- 아이템의 강화 성공확률이 실패할 확률을 가지게 됩니다.
- 스테미너 가격 할인 이벤트 종료
 > 스테미너 절반 충전과 전체 충전은 이전과 같은 가격(절반 : 5 골드 코인 / 완전 충전 : 7 골드 코인)으로 계속 서비스 됩니다.
 > 스테미너 자유 이용권은 이전 5일 제공에서 1일로 조정되었습니다.
 > 스테미너 구매창에서는 이전 가격으로 표기되는 문제는 다음 패치에서 수정될 예정이며, 과금은 상기가격으로 처리됩니다.

[1.0.7 패치예정]
- 하단 지역(국가로 변경예정)은 랭킹 순위를 말합니다.
- 퀘스트 버그 수정
- 트레이스 조절 난이도 하향조절
- 1일 무한 스테미너 이용권
- 문자추천하고 추천받은 사람과 추천인 룰렛코인지급 예정
- 게임중 역전 아이템 추가
- 기타 UI 추가 및 변경
- 더블광고 로그인 할때만 1회만 나오게 수정
- 아이템 강화비용 가변적 조절
- 추천문자 스테미너 지급 하향조절, 1일 1회만 지급
- 볼트레이스 아이템 가격 상향조절

[1.0.6 패치]
- 스프린트 보상 강화템 나오도록 변경(레어급 강화템)
- 뽑기, 황금뽑기 강화템 나오도록 변경 
- 더블 모드(더블파워모드)로 기능 보강
- 난이도 조절 연패시 매칭 상대 하향 조절
- SMS 추천인 보상제 보강


★랭킹 이벤트★
 >매주 진행되는 랭킹 이벤트 (배틀, 머신, 기억력)
 >배틀, 머신, 기억력 모드 랭킹 중 상위 5명에게 배틀 아이템 5종 각 9개씩 지급.(중복 가능)
 > 2월 4일부터 2월 10일까지 각 모드 상위 랭킹 5명에게 배틀 아이템 지급 완료. 
 
 
★T스토어 추천게임 선정!!★
특수 강화 스페셜 아이템을 획득할 수 있는 뽑기코인 3개 100% 지급!
*상점 우측의 뽑기 기계를 확인하세요.

---------------------------------------------------------------
/*
-- 나로호 발사 기념
-- 16이하는 광선검(425)
-- 16이상은 로켓티어(430)
-- 기간 15일 선물함으로 지급
-- 30 > 0 ~ 25231
-- 31 > 25231 ~ 25610

declare @gameid_			varchar(20)				
declare @lv_				int
declare @itemcode_			int		
declare @period2_			int				set @period2_	= 15		
declare @idx_				int				set @idx_		= 25231
select max(idx) idxmax from dbo.tUserMaster
	
declare curNarohoGift Cursor for
select gameid, lv from dbo.tUserMaster where idx >= @idx_

-- 2. 커서오픈
open curNarohoGift

-- 3. 커서 사용
Fetch next from curNarohoGift into @gameid_, @lv_
while @@Fetch_status = 0
	Begin
		if(@lv_ < 16)
			begin	
				set @itemcode_ = 425
			end
		else
			begin
				set @itemcode_ = 430
			end
		
		insert into dbo.tGiftList(gameid, itemcode, giftid, period2, upgradestate2) 
		values(@gameid_ , @itemcode_, '관리자(나로호기념)', @period2_, 0);
		
		insert into tMessage(gameid, comment) 
		values(@gameid_, '나로호 발사 기념으로 선물을 드립니다.')
		
		Fetch next from curNarohoGift into @gameid_, @lv_
	end

-- 4. 커서닫기
close curNarohoGift
Deallocate curNarohoGift
*/