use GameMTBaseball
GO

delete from dbo.tItemInfo where subcategory = 500 and itemcode >= 50021
GO

select '패키지 테이블 다시 생성했나요?'
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '15', '1680', '50', '1', '-1', '-1', '초보자 목장 패키지', '초보자 목장 패키지', '1:4;2:103;3:203;4:2104;5:904;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '9', '25', '2500', '50', '1', '-1', '-1', '능숙한 목장 패키지', '능숙한 목장 패키지', '1:6;2:106;3:206;4:2105;5:1009;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '1780', '50', '1', '-1', '-1', '거래의 왕', '거래의 왕', '1:3003;2:1918;3:903;4:1008;5:1107;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '3400', '50', '1', '-1', '-1', '세포 획득 패키지', '세포 획득 패키지', '1:3103;2:2302;3:2006;4:-1;5:-1;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '2440', '50', '1', '-1', '-1', '동물 교배 패키지', '동물 교배 패키지', '1:2302;2:2203;3:1008;4:1205;5:904;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '1950', '50', '1', '-1', '-1', '보물 패키지', '보물 패키지', '1:2602;2:2503;3:2001;4:904;5:-1;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '1580', '50', '1', '-1', '-1', '목장 지킴이 패키지', '목장 지킴이 패키지', '1:1206;2:708;3:808;4:2002;5:904;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '1850', '50', '1', '-1', '-1', '풍요의 목장 패키지', '풍요의 목장 패키지', '1:1010;2:904;3:1108;4:3004;5:-1;', '', '', '', '', '', '', ''
GO

exec spu_GameMTBaseballD 30, 12, -1    , '1', '70', '2500', '50', '1', '-1', '-1', '보물 뽑기 패키지 ', '보물 뽑기 패키지 ', '1:2602;2:2503;3:2002;4:904;5:-1;', '', '', '', '', '', '', ''
GO

