--개발용아이템정보(5)
--exec spu_FVFarmD 5, 1, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''	--전체
--exec spu_FVFarmD 5, 1,  1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''	--특정아이템
--exec spu_FVFarmD 5, 1, -1,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''	--카테고리
--exec spu_FVFarmD 5, 1, -1, -1,  1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''	--서브카테고리

--유저검색(7)
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 유저 리스트
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1,  2, '', '', '', '', '', '', '', '', '', ''
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 유저 검색
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, 'superman', '', '', '', '', '', '', '', '', ''
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, '', '01022223333', '', '', '', '', '', '', '', ''		-- 유저 폰검색
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, '', '01045943736', '', '', '', '', '', '', '', ''
--exec spu_FVFarmD 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '0000000000000000000', '', '', '', '', '', '', ''-- 카톡 유저검색

--캐쉬로그삭제
--exec spu_FVFarmD 17, 1,  6, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 검색(단일) > 로그삭제, 차감
--exec spu_FVFarmD 17, 2, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx3', '', '', '', '', '', '', '', '', ''				-- 검색(일괄) > 로그삭제, 차감

--유저삭제(18)
--exec spu_FVFarmD 18, 1, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 유저삭제
--exec spu_FVFarmD 18, 2, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 유저 > 폰번검색 일괄삭제

--유저세팅(19)
--exec spu_FVFarmD 19, 1, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '', '', '', '', '', '', '', ''				-- 블럭처리/해제, 기록남김
--exec spu_FVFarmD 19, 2, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '', '', '', '', '', '', '', ''				-- 블럭처리(일괄핸드폰 > 관련계정모두)
--exec spu_FVFarmD 19, 3, 12, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '192.168.0.1', '', '', '', '', '', '', ''	-- 블럭해제
--exec spu_FVFarmD 19, 4, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '192.168.0.1', '', '', '', '', '', '', ''	-- 푸쉬발송/해제
--exec spu_FVFarmD 19, 1001, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 블럭리스트
--exec spu_FVFarmD 19, 1001, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 1003, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 이상행동정보.
--exec spu_FVFarmD 19, 1003, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--		   검색.
--exec spu_FVFarmD 19, 1005,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--         삭제.
--exec spu_FVFarmD 19, 1006, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 이상행동2정보.
--exec spu_FVFarmD 19, 1006, -1, -1, -1, -1,  2, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 이상행동2정보.
--exec spu_FVFarmD 19, 1006, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--		    검색.
--exec spu_FVFarmD 19, 1007,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--          삭제.
--exec spu_FVFarmD 19, 1008, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 경쟁모드(퀘스트정보).
--exec spu_FVFarmD 19, 1004,  1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 쿠폰리스트.
--exec spu_FVFarmD 19, 1004,  2, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', '25026F896F274D9A'	-- 쿠폰리스트.
--exec spu_FVFarmD 19, 1004,  3, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', '25026F896F274D9A'-- 사용하기.
--exec spu_FVFarmD 19, 1009, -1, -1, -1, -1,  1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 마켓 이동정보.
--exec spu_FVFarmD 19, 1009, -1, -1, -1, -1,  1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 10, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '', '', '', '', '', '', '', ''			-- 삭제처리, 기록남김
--exec spu_FVFarmD 19, 1002, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''					-- 삭제리스트
--exec spu_FVFarmD 19, 1002, -1, -1, -1, -1, -1, -1, -1, -1, 'dd23', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 13,6, -1, -1, -1, -1, -1, -1, -1, 'dd23', 'admin', '192.168.0.1', '', '', '', '', '', '', ''	-- 삭제해제
--exec spu_FVFarmD 19, 21, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 블럭폰리스트
--exec spu_FVFarmD 19, 22, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '01022223333', '', '', '', '', '', '', 'msg'		-- 블럭폰등록
--exec spu_FVFarmD 19, 23, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '01022223333', '', '', '', '', '', '', ''			-- 블럭폰삭제
--exec spu_FVFarmD 19, 31, 12, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					-- 유저보유템 삭제
--exec spu_FVFarmD 19, 41, -11, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 캐쉬 +/-
--exec spu_FVFarmD 19, 42, 12, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 코인 +/-
--exec spu_FVFarmD 19, 43, 13, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 건초 +/-
--exec spu_FVFarmD 19, 44, 10, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 하트 +/-
--exec spu_FVFarmD 19, 45,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 동물인벤Max Step
--exec spu_FVFarmD 19, 46,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 소비인벤Max Step
--exec spu_FVFarmD 19, 47,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 악세인벤Max Step
--exec spu_FVFarmD 19, 48,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 하트Max +/-
--exec spu_FVFarmD 19, 50, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(집)
--exec spu_FVFarmD 19, 51,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 52, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(탱크)
--exec spu_FVFarmD 19, 53,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 54, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(양동이)
--exec spu_FVFarmD 19, 54,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 56, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(착유기)
--exec spu_FVFarmD 19, 57,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 58, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(주입기)
--exec spu_FVFarmD 19, 59,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 60, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(정화)
--exec spu_FVFarmD 19, 61,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 62, -1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 업글(저온보관)
--exec spu_FVFarmD 19, 63,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 64,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 일일출석 날짜 -1 일전으로 이동
--exec spu_FVFarmD 19, 64,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 일일출석 카운터 +=1
--exec spu_FVFarmD 19, 64,  3, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			-- 친구하트 날짜 -1 일전으로 이동
--exec spu_FVFarmD 19, 64,  4, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			-- 튜토리얼초기화.
--exec spu_FVFarmD 19, 64,  5, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			-- 펫처헴초기화.
--exec spu_FVFarmD 19, 64,  6, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			-- 최근접속일 -30.
--exec spu_FVFarmD 19, 64, 11, 27, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 동물부활을 하루전으로 돌리기.
--exec spu_FVFarmD 19, 64, 21, 6900, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 농장수익 -1 hour전으로 돌리기.
--exec spu_FVFarmD 19, 64, 22, 6900, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 농장구매, 미구매로 상태전이.
--exec spu_FVFarmD 19, 64, 31, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 광고리스트 번호 클리어.
--exec spu_FVFarmD 19, 64, 41,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 카톡 재가입 시간 클리어.
--exec spu_FVFarmD 19, 64, 42,  1, -1, -1, -1, -1, -1, -1, 'farm1078959', 'admin', '91188455545412241', '', '', '', '', '', '', ''	-- 카톡 계정 재연결.
--exec spu_FVFarmD 19, 64, 43,  1, -1, -1, -1, -1, -1, -1, 'farm1078959', 'admin', '91188455545412241', '', '', '', '', '', '', ''	-- 카톡 계정 연결끊어주기.
--exec spu_FVFarmD 19, 64, 44, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 합성시간 초기화.
--exec spu_FVFarmD 19, 64, 45, 90372 , -1, -1, -1, -1, -1, -1, 'farm1078959', '', '', '', '', '', '', '', '', ''						-- 합성시간 초기화.
--exec spu_FVFarmD 19, 64, 51, 0, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''					-- 상인변경
--exec spu_FVFarmD 19, 64, 52, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 행운의 주사위 변경.
--exec spu_FVFarmD 19, 64, 53,  0, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--               시도횟수.
--exec spu_FVFarmD 19, 65,  1, 2014, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 게임 년 변경
--exec spu_FVFarmD 19, 65,  2,  8, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      월 변경
--exec spu_FVFarmD 19, 65,  3, 10, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      일 변경
--exec spu_FVFarmD 19, 65,  4, 10, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      명성도
--exec spu_FVFarmD 19, 65,  5,  1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      레벨
--exec spu_FVFarmD 19, 65,  6, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      거래성공
--exec spu_FVFarmD 19, 65,  7, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      상장횟수
--exec spu_FVFarmD 19, 65,  8, 10, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      상장횟수
--exec spu_FVFarmD 19, 65,  9, 10, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			--      연속거래실패.
--exec spu_FVFarmD 19, 66,  1,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 상인거래로그 삭제.
--exec spu_FVFarmD 19, 66,  2, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 			   리스트.
--exec spu_FVFarmD 19, 66,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 				검색.
--exec spu_FVFarmD 19, 66, 11,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 저장로그     삭제.
--exec spu_FVFarmD 19, 67,  9,  1, -1, -1, -1, -1, -1, -1, 'xxxx3', 'admin', '', '', '', '', '', '', '', ''				-- 인벤토리 펫업글.
--exec spu_FVFarmD 19, 71,  7,  6, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 소모템 개수변경(공포탄 5 -> 6)
--exec spu_FVFarmD 19, 81, 31, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 양동이 리터
--exec spu_FVFarmD 19, 82, 32, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 양동이 신선도
--exec spu_FVFarmD 19, 83, 33, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 탱크 리터
--exec spu_FVFarmD 19, 84, 34, -1, -1, -1, -1, -1, -1, -1, 'xxxx', 'admin', '', '', '', '', '', '', '', ''			-- 탱크 신선도
--exec spu_FVFarmD 19, 85,  1,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 경작지 비구매.
--exec spu_FVFarmD 19, 85,  2,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 	      시간리셑.
--exec spu_FVFarmD 19, 86,  1, 20, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 유저정보 건초맥스.
--exec spu_FVFarmD 19, 86,  2, 10, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 	        하트맥스.
--exec spu_FVFarmD 19, 86, 13, 10, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 유저우정포인트수정
--exec spu_FVFarmD 19, 87,  1, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 누적 늑대잡은횟수(1).
--exec spu_FVFarmD 19, 87, 11,11, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      판매총금액(11).
--exec spu_FVFarmD 19, 87, 12,12, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      획득한하트(12).
--exec spu_FVFarmD 19, 87, 13,13, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      획득한건초(13).
--exec spu_FVFarmD 19, 87, 14,14, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      거래성공횟수(14).
--exec spu_FVFarmD 19, 87, 15,15, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      최고신선도(15).
--exec spu_FVFarmD 19, 87, 16,16, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      최고배럴(16).
--exec spu_FVFarmD 19, 87, 17,17, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      최고판매금액(17).
--exec spu_FVFarmD 19, 87, 18,18, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      누적배럴(18).
--exec spu_FVFarmD 19, 87, 21,21, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      일반교배(21).
--exec spu_FVFarmD 19, 87, 22,22, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--      프리미엄교배(22).
--exec spu_FVFarmD 19, 87, 31,22, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 친구랭킹포인트.
--exec spu_FVFarmD 19, 87, 32,22, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 에피소드포인트.
--exec spu_FVFarmD 19, 87, 41, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 영구누적 일반교배.
--exec spu_FVFarmD 19, 87, 42, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 영구누적 프리미엄교배.
--exec spu_FVFarmD 19, 87, 43, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 영구누적 합성횟수.
--exec spu_FVFarmD 19, 87, 44, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 영구누적 거래성공횟수.
--exec spu_FVFarmD 19, 87, 45, 1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 프리미엄 게이지.
--exec spu_FVFarmD 19, 88,  1, 10, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 카카오톡 초대인원변경.
--exec spu_FVFarmD 19, 88,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          초대날자 31일뒤로 변경.
--exec spu_FVFarmD 19, 88,  3,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          해당 정보 삭제.
--exec spu_FVFarmD 19, 88,  4,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          [요청]초대날자 10일뒤로 변경
--exec spu_FVFarmD 19, 88, 11,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          [친구동물빌리기]
--exec spu_FVFarmD 19, 88,  6,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          [대기]초대날자 10일뒤로 변경
--exec spu_FVFarmD 19, 88,  7,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          [대기]해당 정보 삭제.
--exec spu_FVFarmD 19, 88,  8,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          1일 초대인원수변경.
--exec spu_FVFarmD 19, 88,  9, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          1일 초대인원날자변경.
--exec spu_FVFarmD 19, 88, 10, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          블럭 해제, 설정.
--exec spu_FVFarmD 19, 88, 11, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 88, 12, -1, -1, -1, -1, -1, -1, -1, 'iuest116025', 'admin', '', '', '', '', '', '', '', ''		--   		탈퇴처리.
--exec spu_FVFarmD 19, 88, 13, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          캐쉬카피초기화.
--exec spu_FVFarmD 19, 88, 14, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          결과카피초기화.
--exec spu_FVFarmD 19, 88, 15, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			--          카톡 부활팝업.
--exec spu_FVFarmD 19, 89,  1,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 복귀 단계.
--exec spu_FVFarmD 19, 89,  2,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'admin', '', '', '', '', '', '', '', ''			-- 복귀 진행달.
--exec spu_FVFarmD 19, 90,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					-- 도감 : 리스트
--exec spu_FVFarmD 19, 91,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					--        보상
--exec spu_FVFarmD 19, 92,100000, -1, -1, -1, -1, -1, -1, -1, 'xxxx3', '', '', '', '', '', '', '', '', ''				-- 펫도감삭제.
--exec spu_FVFarmD 19, 94,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 학교대항삭제
--exec spu_FVFarmD 19, 94,  2, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 학교대항 마스터 리스트(랭킹) 실시간
--exec spu_FVFarmD 19, 94,  3, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 학교대항 서브 리스트(유저)
--exec spu_FVFarmD 19, 94,  4,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 학교대항 서브 리스트(학교)
--exec spu_FVFarmD 19, 94,  5, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 학교대항 지난리스트.
--exec spu_FVFarmD 19, 94,  6, -1, -1, -1, -1, -1, -1, -1, '', '', '20131227', '', '', '', '', '', '', ''				-- 학교대항 20131227일 학교 랭킹
--exec spu_FVFarmD 19, 94,  7,  1, -1, -1, -1, -1, -1, -1, '', '', '20131227', '', '', '', '', '', '', ''				-- 학교대항 20131227일 학교 랭킹 > 유저 랭킹
--exec spu_FVFarmD 19, 94,  8, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				-- 학교대항 지난결과 다시보기
--exec spu_FVFarmD 19, 95,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					-- 경쟁모드      보상 삭제
--exec spu_FVFarmD 19, 96,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					-- 튜토리얼(new) 보상 삭제
--exec spu_FVFarmD 19, 97,  1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			-- 상호친구 삭제.
--exec spu_FVFarmD 19, 97,  2, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'xxxx3', '', '', '', '', '', '', '', ''			--          승인.
--exec spu_FVFarmD 19, 98,  1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저통계마스터.
--exec spu_FVFarmD 19, 98,  2, -1, -1, -1, -1, -1, -1, -1, '', '', '20140404', '', '', '', '', '', '', ''				--         레벨분포, 레벨통신사.
--exec spu_FVFarmD 19, 98,  3, -1, -1, -1, -1, -1, -1, -1, '', '', '201404', '', '', '', '', '', '', ''				--         레벨분포.
--exec spu_FVFarmD 19, 98,  4, -1, -1, -1, -1, -1, -1, -1, '', '', '201404', '', '', '', '', '', '', ''				--         레벨통신사.
--exec spu_FVFarmD 19, 200,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 관리자 액션정보리스트
--exec spu_FVFarmD 19, 200,-1, -1, -1, -1, -1, -1, -1, -1, '', 'admin', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 300,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유니크 가입폰리스트
--exec spu_FVFarmD 19, 300,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '01011112223', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 19, 400,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 구매리스트
--exec spu_FVFarmD 19, 400,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					--
--exec spu_FVFarmD 19, 401,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 월토탈 통계
--exec spu_FVFarmD 19, 401,-1, -1, -1, -1, -1, -1, -1, -1, '', '20130909', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 402,-1, -1, -1, -1, -1, -1, -1, -1, '', '20130909', '', '', '', '', '', '', '', ''				-- 유저 월서브 통계
--exec spu_FVFarmD 19, 403,-1, -1, -1, -1, -1, -1, -1, -1, '', '201309', '', '', '', '', '', '', '', ''				-- 유저 월아이템 통계
--exec spu_FVFarmD 19, 404,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 뽑기 광고리스트
--exec spu_FVFarmD 19, 405,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 동물죽은 로그
--exec spu_FVFarmD 19, 405,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 406,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 동물부활 로그
--exec spu_FVFarmD 19, 406,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 410,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 뽑기리스트
--exec spu_FVFarmD 19, 410,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 411,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 뽑기월토탈 통계
--exec spu_FVFarmD 19, 411,-1, -1, -1, -1, -1, -1, -1, -1, '', '20131111', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 412,-1, -1, -1, -1, -1, -1, -1, -1, '', '20131111', '', '', '', '', '', '', '', ''				-- 유저 뽑기월서브 통계
--exec spu_FVFarmD 19, 413,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 친구초대 리스트.
--exec spu_FVFarmD 19, 413,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 414,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저 악세뽑기리스트
--exec spu_FVFarmD 19, 414,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 415,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 합성
--exec spu_FVFarmD 19, 415,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 19, 416,-1, -1, -1, -1, -1, -1, -1, -1, '', '20140724', '', '', '', '', '', '', '', ''				-- 야바위 일통계
--exec spu_FVFarmD 19, 417,-1, -1, -1, -1, -1, -1, -1, -1, '', '201407', '', '', '', '', '', '', '', ''				--        월통계
--exec spu_FVFarmD 19, 418,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						--        개인로그
--exec spu_FVFarmD 19, 418,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''				--


--공지사항작성(20)
-- 다른데로 이동 --exec spu_FVFarmD 20, 0, -1, 1, 0, 101, 0, -1, -1, -1, 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image01.png', 'http://m.naver.com', 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image02.png', 'http://m.daum.com', 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image03.png', 'http://m.hungryapp.co.kr',	'http://www.ubx.co.kr', 'http://clien.career.co.kr', '', '공지내용'		-- 작성
-- 다른데로 이동 --exec spu_FVFarmD 20, 1,  6, 1, 0, 101, 0, -1, -1, -1, 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image01.png', 'http://m.naver.com', 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image02.png', 'http://m.daum.com', 'http://203.234.238.249:40009/Game4Farm/etc/_ad/top_ad_image03.png', 'http://m.hungryapp.co.kr',	'http://www.ubx.co.kr', 'http://clien.career.co.kr', '', '공지내용'		-- 수정
-- 다른데로 이동 --exec spu_FVFarmD 20, 2, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''			-- 리스트
--exec spu_FVFarmD 20, 11, 1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''			-- 게시판 읽기.
--exec spu_FVFarmD 20, 11, 2,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', '글쓰기'	--        글쓰기.
--exec spu_FVFarmD 20, 11, 3, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''			--        삭제.
--exec spu_FVFarmD 20, 21, 1,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''			-- 문의글 읽기.
--exec spu_FVFarmD 20, 21, 1,  1, -1, -1, -1, -1, -1, -1, 'xxxx2', '', '', '', '', '', '', '', '', ''		--        계정.
--exec spu_FVFarmD 20, 21, 1,  1,  1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''			--		  상태.
--exec spu_FVFarmD 20, 21, 2,  1, 20,  2,  1, -1, -1, -1, '', 'adminid', '', '', '', '', '', '', '', ''	--      상태변경, 코멘트추가(유저에게 쪽지발송가능).
--exec spu_FVFarmD 20, 21, 2,  1, 20,  2,  1, -1, -1, -1, '', 'adminid', '', '', '', '', '', '', '', ''	--      상태변경, 코멘트추가(유저에게 쪽지발송가능).
--exec spu_FVFarmD 20, 31, 1,  0, -1,  0, -1, -1, -1, -1, '', 'adminid', '2014-05-05 10:00', '2014-05-06 10:00', '', '', '', '', '제목', '내용'	-- 이벤트 글쓰기.
--exec spu_FVFarmD 20, 31, 2,  0,  1,  0, -1, -1, -1, -1, '', 'adminid', '2014-05-05 10:00', '2014-05-06 10:00', '', '', '', '', '제목2', '내용2'	--        수정.
--exec spu_FVFarmD 20, 31, 3,  0, -1, -1,  1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''													--        리스트(0번상태).
--exec spu_FVFarmD 20, 31, 3, -1, -1, -1,  1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''													--        리스트(전체).


-- 통계자료(21)
--exec spu_FVFarmD 21, 1, -1,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 일별통계
--exec spu_FVFarmD 21, 11,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 캐쉬판매로그
--exec spu_FVFarmD 21, 11, 1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						--
--exec spu_FVFarmD 21, 11,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						--
--exec spu_FVFarmD 21, 11, 1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						--
--exec spu_FVFarmD 21, 11, 1, -1, -1, -1, -1, -1, -1, -1, 'farm58', '', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 11, 1, -1, -1, -1, -1, -1, -1, -1, '', '', 'TX_00000000150356', '', '', '', '', '', '', ''		--
--exec spu_FVFarmD 21, 12,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 캐쉬판매통계
--exec spu_FVFarmD 21, 12,-1, -1, -1, -1, -1, -1, -1, -1, '', '20140409', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 13,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						--
--exec spu_FVFarmD 21, 13,-1, -1, -1, -1, -1, -1, -1, -1, '', '201404', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 14,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 캐쉬유니크통계
--exec spu_FVFarmD 21, 14,-1, -1, -1, -1, -1, -1, -1, -1, '', '20140408', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 14,-1, -1, -1, -1, -1, -1, -1, -1, '', '20140501', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 21,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저환전로그
--exec spu_FVFarmD 21, 21,-1, -1, -1, -1, -1, -1, -1, -1, 'xxxx', '', '', '', '', '', '', '', '', ''					--
--exec spu_FVFarmD 21, 22,-1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''						-- 유저환전통계
--exec spu_FVFarmD 21, 22,-1, -1, -1, -1, -1, -1, -1, -1, '', '20130910', '', '', '', '', '', '', '', ''				--
--exec spu_FVFarmD 21, 23,  1100, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566741', '', '', '', '', '', '', '' -- 캐쉬구매처리.
--exec spu_FVFarmD 21, 23,  5500, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566742', '', '', '', '', '', '', ''
--exec spu_FVFarmD 21, 23,  9900, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566743', '', '', '', '', '', '', ''
--exec spu_FVFarmD 21, 23, 33000, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566744', '', '', '', '', '', '', ''
--exec spu_FVFarmD 21, 23, 55000, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566745', '', '', '', '', '', '', ''
--exec spu_FVFarmD 21, 23, 99000, -1, -1, -1, -1, -1, -1, -1, 'xxxx2', 'adminid', '12999763169054705758.1313833651566746', '', '', '', '', '', '', ''

--관리자 로그인(25)
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'ssMgr', '1234', '', '', '', '', '', '', '', ''				-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'blalba', 'asdf1234', '', '', '', '', '', '', '', ''			-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'global', 'global', '', '', '', '', '', '', '', ''			-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'bbbbbb', 'bbbbbb', '', '', '', '', '', '', '', ''			-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'a1s2d3f4', '', '', '', '', '', '', '', ''			-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'pictosoft', 'a1s2d3f4', '', '', '', '', '', '', '', ''		-- 관리자 생성
--exec spu_FVFarmD 25, 1, 1000, -1, -1, -1, -1, -1, -1, -1, 'ssMgr1', 'l3442', '', '', '', '', '', '', '', ''				-- 관리자 생성
--exec spu_FVFarmD 25, 2, -1, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'a1s2d3f4', '', '', '', '', '', '', '', ''			-- 관리자 로그인
--exec spu_FVFarmD 25, 3, 1000, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'a1s2d3f4', '', '', '', '', '', '', '', ''			-- 관리자 등급수정
--exec spu_FVFarmD 25, 4, -1, -1, -1, -1, -1, -1, -1, -1, 'aaaaaa', 'bbbbbb', '', '', '', '', '', '', '', ''				-- 관리자 삭제

-- 선물(27)
--exec spu_FVFarmD 27, 1,  -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 선물 가능한 리스트(선물하기위해서)
--exec spu_FVFarmD 27, 2,  -1, -1, -1, -1, -1, -1, -1, -1, '', 'xxxx', '', '', '', '', '', '', '', ''						-- 선물 받은 리스트( 전체, 개인)
--exec spu_FVFarmD 27, 2,  -1, -1, -1, -1, -1, -1, -1, -1, '', 'xxxx2', '액세서리뽑기', '', '', '', '', '', '', ''			--
--exec spu_FVFarmD 27, 11,  1, -1, -1, -1, -1, -1, -1, -1, 'adminid', 'xxxx', '', '', '', '', '', '', '', ''				-- 선물하기
--exec spu_FVFarmD 27, 12, -1, -1, -1, -1, -1, -1, -1, -1, 'adminid', 'xxxx', '메세지내용', '', '', '', '', '', '', ''		-- 메세지보내기
--exec spu_FVFarmD 27, 21, -1,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 선물, 메세지 삭제
--exec spu_FVFarmD 27, 22, -1,  1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '',''							-- 선물, 메세지 원복
--exec spu_FVFarmD 27, 23, -1, 81, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							--              삭제
--exec spu_FVFarmD 27, 31, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 룰렛 리스트

-- 게임정보 자동세팅(30)
--exec spu_FVFarmD 30, 1, 10, 20, 900, 5111, 5112, 5113, 5007, -1, '', '', '', '', '', '', '', '', '', '반영내용'			-- 시스템 정보 업그레이드(업글, 할인, 출석)
--exec spu_FVFarmD 30, 2, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 시스템 정보 리스트
--exec spu_FVFarmD 30, 3,  3, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', '수정내용'					-- 시스템 멘트만수정
--exec spu_FVFarmD 30, 4,  1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 복귀세팅
--exec spu_FVFarmD 30, 5, -1, -1, -1, -1, -1, -1, -1, -1, '1,2,3,4,5,6,7', '2013-01-01', '2024-01-01', '산양', '양', '젖소', '', '', '1:1;2:213;3:112;4:14;5:5017;6:5010;7:5009;10:1;11:12;12:18;13:23;20:1;21:10;22:100;', '' -- 뽑기동물기능 입력
--exec spu_FVFarmD 30, 6,  1, -1, -1, -1, -1, -1, -1, -1, '8,2,3,4,5,6,7', '2013-01-08', '2024-01-08', '산양2', '양2', '젖소2', '', '', '1:-1;2:213;3:112;4:14;5:5017;6:5010;7:5009;10:1;11:12;12:18;13:23;20:1;21:10;22:100;', '코멘트수정' -- 수정
--exec spu_FVFarmD 30, 7, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''

--exec spu_FVFarmD 30, 1, 10, 20, 900, 5111, 5112, 5113, 5007, -1, '', '', '', '', '', '', '', '', '', '반영내용'			-- 시스템 정보 업그레이드(업글, 할인, 출석)
--exec spu_FVFarmD 30, 2, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 시스템 정보 리스트
--exec spu_FVFarmD 30, 3,  3, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', '수정내용'					-- 시스템 멘트만수정

--exec spu_FVFarmD 30, 11, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 패키지상품(아이템리스트, 템리스트).
--exec spu_FVFarmD 30, 12, -1,  1, 50, 69, 10,  1, -1, -1, '소A등급 패키지','내용', '1:1;2:2;3:3;4:904;5:1200;', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 13,  1,  1, 50, 69, 10,  1, -1, -1, '소A등급 패키지','내용', '1:1;2:2;3:3;4:904;5:1200;', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 21,  1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 교배뽑기상품(아이템리스트, 템리스트) 활성.
--exec spu_FVFarmD 30, 21, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							--                                    비활성.
--exec spu_FVFarmD 30, 22, -1,  1, 50, 69, 10,  1, 1000, 300, '소A등급 교배뽑기','내용', '1:2;2:2;3:3;4:4;5:5;6:6;7:7;8:8;9:9;10:10;11:11;12:12;13:13;14:14;15:15;16:101;17:102;18:103;19:104;20:105', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 23,  1,  1, 50, 69, 10,  1, 1000, 300, '소A등급 교배뽑기','내용', '1:1;2:2;3:3;4:4;5:5;6:6;7:7;8:8;9:9;10:10;11:11;12:12;13:13;14:14;15:15;16:1;17:2;18:3;19:4;20:5', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 24, -1, -1, -1, -1, 20, -1, -1, -1, '','', '', '', '', '', '', '', '', ''							-- 일괄할인수정.

--exec spu_FVFarmD 30, 41, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''							-- 교배뽑기상품Fresh(아이템리스트, 템리스트).
--exec spu_FVFarmD 30, 42, -1,  1, 50, 69, 10,  1, 1000, 300, '소A등급 교배뽑기','내용', '1:10;2:12;3:11;4:13;5:15;6:20;7:20;8:30;', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 43,  1,  1, 50, 69, 10,  1, 1000, 300, '소A2등급 교배뽑기','내용', '1:11;2:12;3:11;4:13;5:15;6:20;7:20;8:30;', '', '', '', '', '', '', ''

--exec spu_FVFarmD 30, 45, -1,  1, 10, -1, 10,  1, -1, -1, '행운의 상자 1', '1', '1:1026:4:1:500;2:813:5:2:1000;3:1004:7:4:1500;4:2000:9:6:3500;5:2103:10:10:7000;6:1205:11:15:20000;', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 46, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''
--exec spu_FVFarmD 30, 47,  1,  1, 60, -1, 10,  1, -1, -1, '행운의 상자 1', '1', '1:1026:4:1:500;2:813:5:2:1000;3:1004:7:4:1500;4:2000:9:6:3500;5:2103:10:10:7000;6:1205:11:15:20000;', '1,2,3,4,5,6,7', '', '', '', '', '', ''

--exec spu_FVFarmD 30, 31, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''																				-- Push 카운터(안드로이드와 아이폰은 내부에서 판단함).
--exec spu_FVFarmD 30, 32,  1, -1, -1, -1, -1, -1, -1, -1, 'guest90579', 'blackm', '[푸쉬제목]', '[푸쉬내용]', 'LANUCH', '2013-01-10', '', '', '', ''							-- Push 개별.
--exec spu_FVFarmD 30, 32,  3, -1, -1, -1, -1, -1, -1, -1, 'guest90579', 'blackm', '[푸쉬제목URL]', '[푸쉬내용URL]', 'http://m.tstore.co.kr', '2013-01-10', '', '', '', ''
--exec spu_FVFarmD 30, 32000, 1, -1, -1, -1, -1, -1, -1, -1, 'guest90579', 'blackm', '[푸쉬제목]', '[푸쉬내용]', 'LANUCH', '2013-01-10', '', '', '', ''							-- Push 리턴값이 없음.
--exec spu_FVFarmD 30, 32000, 3, -1, -1, -1, -1, -1, -1, -1, 'guest90579', 'blackm', '[푸쉬제목URL]', '[푸쉬내용URL]', 'http://m.tstore.co.kr', '2013-01-10', '', '', '', ''
--exec spu_FVFarmD 30, 33,  1,  5, -1, -1, -1, -1, -1, -1, 'blackm', 'blackm', '[푸쉬제목]', '[푸쉬내용]', 'LANUCH', '2013-01-10', '', '', '', ''								-- Push 전체.
--exec spu_FVFarmD 30, 33,  3,  5, -1, -1, -1, -1, -1, -1, 'blackm', 'blackm', '[푸쉬제목URL]', '[푸쉬내용URL]', 'http://m.tstore.co.kr', '2013-01-10', '', '', '', ''
--exec spu_FVFarmD 30, 34,  1, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'blackm', '', '', '', '', '', '', '', ''																	-- Push 삭제.
--exec spu_FVFarmD 30, 35,  1, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'blackm', '', '', '', '', '', '', '', ''																	-- Push 삭제.
--exec spu_FVFarmD 30, 36, -1, -1, -1, -1, -1, -1, -1, -1, 'blackm', 'blackm', '', '', '', '', '', '', '', ''																	-- Push 삭제.

--exec spu_FVFarmD 30, 50, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''		--0 시간제 이벤트 정보.
--exec spu_FVFarmD 30, 51, -1, -1, -1, -1, -1, -1, -1, -1, '', '', '', '', '', '', '', '', '', ''		--0 마스터 활성화.
--exec spu_FVFarmD 30, 52,  1, -1,2013, 0, -1, -1, -1, -1, '','', '보낸이름', '2014-05-26 18:00', '2014-05-26 23:59', '', '', '', '사랑의 선물이 도착했어요~', '선물이 곧 사라져요~ 빨리 접속해서 선물 받으세요!'	-- 입력.
--exec spu_FVFarmD 30, 52,  2,  7,2013, 1, -1, -1, -1, -1, '','', '보낸이름', '2014-05-26 18:00', '2014-05-26 23:59', '', '', '', '사랑의 선물이 도착했어요~', '선물이 곧 사라져요~ 빨리 접속해서 선물 받으세요!' -- 수정
--exec spu_FVFarmD 30, 52,  3,  7, -1,-1, -1, -1, -1, -1, '','', '', '', '', '', '', '', '', ''		-- 상태수정
--exec spu_FVFarmD 30, 52,  4,  7, -1,-1, -1, -1, -1, -1, '','', '', '', '', '', '', '', '', ''		-- 푸쉬수정
--exec spu_FVFarmD 30, 52,  5,  7, -1,-1, -1, -1, -1, -1, '','', '', '', '', '', '', '', '', ''		-- 삭제
--exec spu_FVFarmD 30, 53, -1, -1, -1,-1, -1, -1, -1, -1, '','', '', '', '', '', '', '', '', ''		-- 상품받아가는 사람
--exec spu_FVFarmD 30, 53, -1, -1, -1,-1, -1, -1, -1, -1, 'xxxx2','', '', '', '', '', '', '', '', ''		--

use Farm
GO

IF OBJECT_ID ( 'dbo.spu_FVFarmD', 'P' ) IS NOT NULL
    DROP PROCEDURE dbo.spu_FVFarmD;
GO

------------------------------------------------
--	1. 개발일반 프로세서
------------------------------------------------
create procedure dbo.spu_FVFarmD
	@p1_			int,
	@p2_			int,
	@p3_			int,
	@p4_			int,
	@p5_			int,
	@p6_			int,
	@p7_			int,
	@p8_			int,
	@p9_			int,
	@p10_			bigint,
	@ps1_			varchar(1024),
	@ps2_			varchar(1024),
	@ps3_			varchar(1024),
	@ps4_			varchar(1024),
	@ps5_			varchar(1024),
	@ps6_			varchar(1024),
	@ps7_			varchar(1024),
	@ps8_			varchar(1024),
	@ps9_			varchar(1024),
	@ps10_			varchar(4096)
	--WITH ENCRYPTION -- 프로시져를 암호화함.
as
	------------------------------------------------
	-- 일반값
	declare @RESULT_SUCCESS						int				set @RESULT_SUCCESS						=  1
	declare @RESULT_ERROR						int				set @RESULT_ERROR						= -1
	declare @RESULT_ERROR_NOT_FOUND_GAMEID		int				set @RESULT_ERROR_NOT_FOUND_GAMEID		= -13	--해당유저를 찾지 못함
	declare @RESULT_ERROR_NOT_FOUND_ITEMCODE	int				set @RESULT_ERROR_NOT_FOUND_ITEMCODE	= -50	-- 아이템코드못찾음

	------------------------------------------------
	--	프로시져 종류
	------------------------------------------------
	declare @KIND_NOTICE_SETTING				int				set @KIND_NOTICE_SETTING				= 20
	declare @KIND_USER_SEARCH					int				set @KIND_USER_SEARCH					= 7
	declare @KIND_USER_DELETEID					int				set @KIND_USER_DELETEID					= 18
	declare @KIND_USER_SETTING					int				set @KIND_USER_SETTING					= 19
	declare @KIND_STATISTICS_INFO				int				set @KIND_STATISTICS_INFO				= 21
	declare @KIND_USER_GIFT						int				set @KIND_USER_GIFT						= 27
	declare @KIND_ADMIN_LOGIN					int				set @KIND_ADMIN_LOGIN					= 25
	declare @KIND_SEARCH_ITEMINFO				int				set @KIND_SEARCH_ITEMINFO				= 5
	declare @KIND_SYSTEMINFO_SETTING			int				set @KIND_SYSTEMINFO_SETTING			= 30
	declare @KIND_USER_CASH_LOG_DELETE			int				set @KIND_USER_CASH_LOG_DELETE			= 17

	declare @KIND_USER_BLOCK_LOG				int				set @KIND_USER_BLOCK_LOG				= 2
	declare @KIND_USER_BLOCK_RELEASE			int				set @KIND_USER_BLOCK_RELEASE			= 8
	declare @KIND_USER_DELETE_LOG				int				set @KIND_USER_DELETE_LOG				= 10
	declare @KIND_USER_DELETE_RELEASE			int				set @KIND_USER_DELETE_RELEASE			= 11
	declare @KIND_USER_UNUSUAL_LOG				int				set @KIND_USER_UNUSUAL_LOG				= 4
	declare @KIND_ITEM_BUY_LOG					int				set @KIND_ITEM_BUY_LOG					= 6
	declare @KIND_USER_ITEM_UPGRADE				int				set @KIND_USER_ITEM_UPGRADE 			= 9
	declare @KIND_USER_CASH_CHANGE				int				set @KIND_USER_CASH_CHANGE				= 12
	declare @KIND_USER_CASH_BUY					int				set @KIND_USER_CASH_BUY					= 13
	declare @KIND_USER_CASH_PLUS				int				set @KIND_USER_CASH_PLUS				= 16
	declare @KIND_USER_CASH_MINUS				int				set @KIND_USER_CASH_MINUS				= 23
	declare @KIND_OPEN_TEST						int				set @KIND_OPEN_TEST						= 22
	declare @KIND_NEWINFO_LIST					int				set @KIND_NEWINFO_LIST					= 26

	-- 상태값.
	declare @BLOCK_STATE_NO						int				set	@BLOCK_STATE_NO						= 0				-- 블럭상태아님
	declare @BLOCK_STATE_YES					int				set	@BLOCK_STATE_YES					= 1				-- 블럭상태
	declare @DELETE_STATE_NO					int				set	@DELETE_STATE_NO					= 0				-- 삭제상태아님
	declare @DELETE_STATE_YES					int				set	@DELETE_STATE_YES					= 1				-- 삭제상태

	-- 체킹
	declare @INFOMATION_NO						int					set @INFOMATION_NO					= -1
	declare @INFOMATION_YES						int					set @INFOMATION_YES					=  1

	-- 통신사 구분값
	declare @SKT 							int					set @SKT						= 1
	declare @KT 							int					set @KT							= 2
	declare @LGT 							int					set @LGT						= 3
	declare @GOOGLE 						int					set @GOOGLE						= 5
	declare @NHN	 						int					set @NHN						= 6
	declare @IPHONE							int					set @IPHONE						= 7

	-- 아이템
	declare @ITEM_SUBCATEGORY_COW				int					set @ITEM_SUBCATEGORY_COW 					= 1  -- 소		(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_GOAT				int					set @ITEM_SUBCATEGORY_GOAT 					= 2  -- 양		(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_SHEEP				int					set @ITEM_SUBCATEGORY_SHEEP 				= 3  -- 산양	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_SEED				int					set @ITEM_SUBCATEGORY_SEED 					= 7  -- 씨앗	(판매[X], 선물[X], 직접[O])
	declare @ITEM_SUBCATEGORY_BULLET			int					set @ITEM_SUBCATEGORY_BULLET 				= 8  -- 총알	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_VACCINE			int					set @ITEM_SUBCATEGORY_VACCINE 				= 9  -- 치료제	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_FEED				int					set @ITEM_SUBCATEGORY_FEED 					= 44 -- 건초	(판매[X], 선물[O])
	declare @ITEM_SUBCATEGORY_ALBA				int					set @ITEM_SUBCATEGORY_ALBA 					= 11 -- 일꾼	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_BOOSTER			int					set @ITEM_SUBCATEGORY_BOOSTER 				= 12 -- 촉진제	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_REVIVAL			int					set @ITEM_SUBCATEGORY_REVIVAL 				= 13 -- 부활석	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_ACC				int					set @ITEM_SUBCATEGORY_ACC 					= 15 -- 악세	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_HEART				int					set @ITEM_SUBCATEGORY_HEART 				= 40 -- 하트	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_HELPER			int					set @ITEM_SUBCATEGORY_HELPER 				= 41 -- 긴급요청(판매[X], 선물[O])
	declare @ITEM_SUBCATEGORY_TRADESAFE			int					set @ITEM_SUBCATEGORY_TRADESAFE				= 42 -- 상인만족(판매[X], 선물[O])
	declare @ITEM_SUBCATEGORY_CASHCOST			int					set @ITEM_SUBCATEGORY_CASHCOST 				= 50 -- 캐쉬	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_GAMECOST			int					set @ITEM_SUBCATEGORY_GAMECOST 				= 51 -- 코인	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_ROULETTE_NOR		int					set @ITEM_SUBCATEGORY_ROULETTE_NOR			= 22 -- 일반교배뽑기티켓(판매[X], 선물[O])
	declare @ITEM_SUBCATEGORY_ROULETTE_PRE		int					set @ITEM_SUBCATEGORY_ROULETTE_PRE			= 23 -- 프리미엄교배뽑기티켓(판매[X], 선물[O])
	declare @ITEM_SUBCATEGORY_CONTEST			int					set @ITEM_SUBCATEGORY_CONTEST 				= 53 -- 대회	(판매[O], 선물[O])
	declare @ITEM_SUBCATEGORY_FIELDOPEN			int					set @ITEM_SUBCATEGORY_FIELDOPEN				= 56 -- 필드오픈(56)
	declare @ITEM_SUBCATEGORY_UPGRADE_HOUSE		int					set @ITEM_SUBCATEGORY_UPGRADE_HOUSE 		= 60 -- 집
	declare @ITEM_SUBCATEGORY_UPGRADE_TANK		int					set @ITEM_SUBCATEGORY_UPGRADE_TANK 			= 61 -- 탱크
	declare @ITEM_SUBCATEGORY_UPGRADE_FRESHCOOL	int					set @ITEM_SUBCATEGORY_UPGRADE_FRESHCOOL 	= 62 -- 저온보관
	declare @ITEM_SUBCATEGORY_UPGRADE_PURE		int					set @ITEM_SUBCATEGORY_UPGRADE_PURE 			= 63 -- 정화시설
	declare @ITEM_SUBCATEGORY_UPGRADE_BOTTLE	int					set @ITEM_SUBCATEGORY_UPGRADE_BOTTLE 		= 64 -- 양동이
	declare @ITEM_SUBCATEGORY_UPGRADE_PUMP		int					set @ITEM_SUBCATEGORY_UPGRADE_PUMP 			= 65 -- 착유기
	declare @ITEM_SUBCATEGORY_UPGRADE_TRANSFER	int					set @ITEM_SUBCATEGORY_UPGRADE_TRANSFER 		= 66 -- 주입기
	declare @ITEM_SUBCATEGORY_INVEN				int					set @ITEM_SUBCATEGORY_INVEN 				= 67 -- 인벤확장
	declare @ITEM_SUBCATEGORY_SEEDFIELD			int					set @ITEM_SUBCATEGORY_SEEDFIELD 			= 68 -- 경작지확장
	declare @ITEM_SUBCATEGORY_DOGAM				int					set @ITEM_SUBCATEGORY_DOGAM 				= 818 -- 도감
	declare @ITEM_SUBCATEGORY_SYSINFO			int					set @ITEM_SUBCATEGORY_SYSINFO 				= 500 -- 정보수집

	-- 선물 관련 정의값
	declare @GIFTLIST_GIFT_KIND_MESSAGE			int					set @GIFTLIST_GIFT_KIND_MESSAGE				= 1
	declare @GIFTLIST_GIFT_KIND_GIFT			int					set @GIFTLIST_GIFT_KIND_GIFT				= 2
	declare @GIFTLIST_GIFT_KIND_MESSAGE_DEL		int					set @GIFTLIST_GIFT_KIND_MESSAGE_DEL			= -1
	declare @GIFTLIST_GIFT_KIND_GIFT_DEL		int					set @GIFTLIST_GIFT_KIND_GIFT_DEL			= -2
	declare @GIFTLIST_GIFT_KIND_GIFT_GET		int					set @GIFTLIST_GIFT_KIND_GIFT_GET			= -3
	declare @GIFTLIST_GIFT_KIND_GIFT_SELL		int					set @GIFTLIST_GIFT_KIND_GIFT_SELL			= -4

	-- 기타 상수값
	declare @ID_MAX								int					set	@ID_MAX									= 10	-- 한폰당 생성할 수 있는 아이디개수.
	declare @USERMASTER_UPGRADE_STATE_NON		int					set @USERMASTER_UPGRADE_STATE_NON			= -1	--미진행, 완료중.
	declare @USERMASTER_UPGRADE_STATE_ING		int					set @USERMASTER_UPGRADE_STATE_ING			= 1		--다음단계진행중.

	declare @GAME_START_YEAR					int					set @GAME_START_YEAR						= 2013
	declare @GAME_START_MONTH					int					set @GAME_START_MONTH						= 3
	declare @GAME_INVEN_ANIMAL_BASE				int					set @GAME_INVEN_ANIMAL_BASE					= 10	-- 대표1 + 동물9
	declare @GAME_INVEN_CUSTOME_BASE			int					set @GAME_INVEN_CUSTOME_BASE				= 8
	declare @GAME_INVEN_ACC_BASE				int					set @GAME_INVEN_ACC_BASE					= 6

	declare @SYSTEM_FRIEND						varchar(40)			set @SYSTEM_FRIEND							= 'farmgirl'
	declare @KAKAO_STATUS_NEWSTART  			int					set @KAKAO_STATUS_NEWSTART				= -1			-- 새롭하기한상태

	declare @PAGE_CASH_LIST						int					set @PAGE_CASH_LIST							= 25
	declare @FAMELV_MAX							int					set @FAMELV_MAX								= 70
	------------------------------------------------
	--	일반변수선언
	------------------------------------------------
	declare @kind			int				set @kind			= @p1_
	declare @subkind		int				set @subkind		= @p2_
	declare @idx 			int				set @idx 			= @p3_
	declare @itemcode		int				set @itemcode		= @p4_
	declare @itemkind		int				set @itemcode		= @p5_
	declare @idx2 			int

	declare @gameid			varchar(60)		set @gameid			= @ps1_
	declare @adminid		varchar(1024)	set @adminid 		= @ps2_
	declare @adminip		varchar(1024)	set @adminip 		= @ps3_
	declare @message		varchar(2048)	set @message		= @ps10_
	declare @phone			varchar(20)
	declare @password		varchar(20)

	declare @comment		varchar(2048)
	declare @cashcost 		int
	declare @gamecost 		int
	declare @gameyear 		int
	declare @comment4		varchar(4096)

	declare @dateid 		varchar(8)
	declare @dateid6 		varchar(6)		set @dateid6 		= Convert(varchar(6),Getdate(),112)
	declare @dateid8 		varchar(8)
	declare @dateid10 		varchar(10) 	set @dateid10 		= Convert(varchar(8), Getdate(),112) + Convert(varchar(2), Getdate(), 108)
	declare @dateid16 		varchar(16) 	set @dateid16 		= Convert(varchar(16), Getdate(),120)
	declare @dateid19 		varchar(19) 	set @dateid19 		= Convert(varchar(19), Getdate(),120)

	declare @syscheck		int
	declare @market			int				set @market = 1
	declare @buytype		int
	declare @version		int
	declare @questkind		int
	declare @iteminfover	int
	declare @iteminfourl	varchar(512)

	declare @recepushid		varchar(1024)
	declare @maxPage		int				set @maxPage = 1
	declare @idxPage		int				set @idxPage = 1
	declare @cnt			int
	declare @fresh			int
	declare @cnt2			int
	declare @grade			int

	declare @category		int
	declare @subcategory	int

	declare @nResult		int				set @nResult = @RESULT_SUCCESS
	declare @str			varchar(40)
	declare @str2			varchar(40)
	declare @val			int
	declare @val2			int
	declare @cash			int

	declare @housestepmax		int,
			@tankstepmax		int,
			@bottlestepmax		int,
			@pumpstepmax		int,
			@transferstepmax	int,
			@purestepmax		int,
			@freshcoolstepmax	int,

			@invenstepmax		int,
			@invencountmax		int,
			@seedfieldmax		int,

			@field5lv			int,
			@field6lv			int,
			@field7lv			int,
			@field8lv			int

	declare @pack1			int		set @pack1 		= -1
	declare @pack2			int		set @pack2 		= -1
	declare @pack3			int		set @pack3 		= -1
	declare @pack4			int		set @pack4 		= -1
	declare @pack5			int		set @pack5 		= -1
	declare @pack6			int		set @pack6 		= -1
	declare @pack7			int		set @pack7 		= -1
	declare @pack8			int		set @pack8 		= -1
	declare @pack9			int		set @pack9 		= -1
	declare @pack10			int		set @pack10		= -1
	declare @pack11			int		set @pack11 	= -1
	declare @pack12			int		set @pack12 	= -1
	declare @pack13			int		set @pack13 	= -1
	declare @pack14			int		set @pack14 	= -1
	declare @pack15			int		set @pack15 	= -1
	declare @pack16			int		set @pack16 	= -1
	declare @pack17			int		set @pack17 	= -1
	declare @pack18			int		set @pack18 	= -1
	declare @pack19			int		set @pack19 	= -1
	declare @pack20			int		set @pack20		= -1
	declare @pack21			int		set @pack21 	= -1
	declare @pack22			int		set @pack22 	= -1
	declare @pack23			int		set @pack23 	= -1
	declare @pack24			int		set @pack24 	= -1
	declare @pack25			int		set @pack25 	= -1
	declare @pack26			int		set @pack26 	= -1
	declare @pack27			int		set @pack27 	= -1
	declare @pack28			int		set @pack28 	= -1
	declare @pack29			int		set @pack29 	= -1
	declare @pack30			int		set @pack30		= -1
	declare @pack31			int		set @pack31 	= -1
	declare @pack32			int		set @pack32 	= -1
	declare @pack33			int		set @pack33 	= -1
	declare @pack34			int		set @pack34 	= -1
	declare @pack35			int		set @pack35 	= -1
	declare @pack36			int		set @pack36 	= -1
	declare @pack37			int		set @pack37 	= -1
	declare @pack38			int		set @pack38 	= -1
	declare @pack39			int		set @pack39 	= -1
	declare @pack40			int		set @pack40		= -1

	declare @groupstep1	int		set @groupstep1 	= -1
	declare @groupstep2	int		set @groupstep2 	= -1
	declare @groupstep3	int		set @groupstep3 	= -1
	declare @groupstep4	int		set @groupstep4 	= -1
	declare @groupstep5	int		set @groupstep5 	= -1
	declare @groupstep6	int		set @groupstep6 	= -1
	declare @groupstep7	int		set @groupstep7 	= -1
	declare @groupstep8	int		set @groupstep8 	= -1

	declare @packkind 		int,
			@packvalue 		int
	declare @famelv			int,
			@fame			int
	declare @total			int	set @total 			= 0
	declare @schoolidx		int	set @schoolidx 		= -1
	declare @point			int	set @point 			= 0

	-- 유저문의.
	declare @PAGE_LINE10	int						set @PAGE_LINE10	= 10
	declare @PAGE_LINE20	int						set @PAGE_LINE20	= 20
	declare @PAGE_LINE50	int						set @PAGE_LINE50	= 50
	declare @PAGE_LINE		int						set @PAGE_LINE		= 100
	declare @page			int						set @page			= 1

	declare @kakaouserid	varchar(20)	set @kakaouserid 		= ''

	-- 쿠폰정보.
	declare @itemcode1		int						set @itemcode1		= -1
	declare @itemcode2		int						set @itemcode2		= -1
	declare @itemcode3		int						set @itemcode3		= -1
	declare @certno			varchar(16)				set @certno			= ''

	-- 관리자 과금입력.
	declare @acode			varchar(256)
	declare @ucode			varchar(256)
	declare @ikind			varchar(256)
	declare @cashkind		int

	-- 이벤트처리.
	declare @curdate		datetime				set @curdate		= getdate()
	declare @state			int
	declare @company		int
	declare @startdate		varchar(16)
	declare @enddate		varchar(16)
	declare @title			varchar(256)
	declare @eventspot06	int
	declare @eventsender	varchar(20)
	declare @eventpushtitle	varchar(256)
	declare @eventpushmsg	varchar(256)
	declare @eventstatedaily	int

	-- 카카오초대.
	declare @kakaoinvite01	int					set @kakaoinvite01 		= 2000
	declare @kakaoinvite02	int					set @kakaoinvite02 		= 1005
	declare @kakaoinvite03	int					set @kakaoinvite03 		= 6
	declare @kakaoinvite04	int					set @kakaoinvite04		= 100003

	-- 복귀플래그.
	declare @rtnflag		int

	declare @yabau			varchar(256)
	declare @pack41			int, @pack42			int, @pack43			int, @pack44			int,
			@pack51			int, @pack52			int, @pack53			int, @pack54			int,
			@pack61			int, @pack62			int, @pack63			int, @pack64			int

	declare @roulmarket			varchar(40)			set @roulmarket 	= '1,2,3,4,5,6,7'
	declare @roulflag			int					set @roulflag		= -1
	declare @roulstart			datetime			set @roulstart 		= '2014-01-01'
	declare @roulend			datetime			set @roulend 		= '2024-01-01'
	declare @roulani1			int					set @roulani1		= -1
	declare @roulani2			int					set @roulani2 		= -1
	declare @roulani3			int					set @roulani3 		= -1
	declare @roulreward1		int					set @roulreward1	= -1
	declare @roulreward2		int					set @roulreward2 	= -1
	declare @roulreward3		int					set @roulreward3 	= -1
	declare @roulname1			varchar(20)			set @roulname1 		= ''
	declare @roulname2			varchar(20)			set @roulname2 		= ''
	declare @roulname3			varchar(20)			set @roulname3 		= ''

	declare @roultimeflag		int					set @roultimeflag 	= -1
	declare @roultimetime1		int					set @roultimetime1 	= -1
	declare @roultimetime2		int					set @roultimetime2 	= -1
	declare @roultimetime3		int					set @roultimetime3 	= -1

	declare @pmgauageflag		int					set @pmgauageflag 	= -1
	declare @pmgauagepoint		int					set @pmgauagepoint	= 10
	declare @pmgauagemax		int					set @pmgauagemax 	= 100
Begin
	------------------------------------------------
	--	초기화
	------------------------------------------------
	set nocount on

	------------------------------------------------
	--	각상태분기
	------------------------------------------------
	if(@kind = @KIND_NOTICE_SETTING)
		begin
			set @subkind 	= @p2_
			set @idx		= @p3_
			set @market		= @p4_
			set @buytype	= @p5_
			set @version	= @p6_
			set @syscheck	= @p7_
			set @iteminfover= @p8_
			set @iteminfourl= @ps9_
			set @comment4	= @ps10_

			--if(@subkind = 0)
			--	begin
			--		insert into dbo.tFVNotice(market,  buytype,  comfile, comurl, comfile2, comurl2, comfile3, comurl3,  version, patchurl, recurl,   comment,  syscheck,  iteminfover,  iteminfourl)
			--		values(                @market, @buytype,  @ps1_,   @ps2_,  @ps3_,    @ps4_,   @ps5_,    @ps6_,   @version, @ps7_,    @ps8_,  @comment4, @syscheck, @iteminfover, @iteminfourl)
            --
            --
			--		-- 종류별 공지사항.
			--		select * from dbo.tFVNotice
			--		where idx in (select max(idx) from dbo.tFVNotice where market in (@SKT, @GOOGLE, @IPHONE) group by market, buytype)
			--		order by market, buytype asc
			--	end
			--else if(@subkind = 1)
			--	begin
			--		update dbo.tFVNotice
			--			set
			--				market		= @market,
			--				buytype		= @buytype,
            --
			--				comfile		= @ps1_,
			--				comurl 		= @ps2_,
			--				comfile2	= @ps3_,
			--				comurl2 	= @ps4_,
			--				comfile3	= @ps5_,
			--				comurl3		= @ps6_,
            --
			--				version		= @version,
            --
			--				patchurl	= @ps7_,
			--				recurl	 	= @ps8_,
			--				comment	 	= @comment4,
			--				iteminfover = @iteminfover,
			--				iteminfourl = @iteminfourl,
            --
			--				syscheck 	= @syscheck
			--		where idx = @idx
            --
            --
			--		-- 종류별 공지사항.
			--		select * from dbo.tFVNotice
			--		where idx in (select max(idx) from dbo.tFVNotice where market in (@SKT, @GOOGLE, @IPHONE) group by market, buytype)
			--		order by market, buytype asc
			--	end
			--else if(@subkind = 2)
			--	begin
			--		-- 종류별 공지사항.
			--		select * from dbo.tFVNotice
			--		where idx in (select max(idx) from dbo.tFVNotice where market in (@SKT, @GOOGLE, @IPHONE) group by market, buytype)
			--		order by market, buytype asc
			--	end
			--else
			if(@subkind = 11)
				begin
					if(@p3_ = 1)
						begin
							-- 게시판 읽기.
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVUserBoard

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVUserBoard
							where idx <= @idx order by idx desc

							--select top 10 * from dbo.tFVUserBoard
							--order by idx desc
						end
					else if(@p3_ = 2)
						begin
							-- 게시글 작성.
							select @idx2 = (isnull(max(idx2), 0) + 1)
							from dbo.tFVUserBoard where kind = @p4_

							insert into dbo.tFVUserBoard( kind,   idx2,  gameid,          message, schoolidx)
							values(                    @p4_,   @idx2,  @SYSTEM_FRIEND, @ps10_,   -1)

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@p3_ = 3)
						begin
							delete from dbo.tFVUserBoard where idx = @p5_

							select @RESULT_SUCCESS 'rtn'
						end
				end
			else if(@subkind = 21)
				begin
					if(@p3_ = 1)
						begin
							if(@p5_ != -1)
								begin
									set @maxPage	= 1
									set @page		= 1

									select top 100 @maxPage maxPage, @page page, * from dbo.tFVSysInquire
									where state = @p5_ order by idx desc
								end
							else if(@ps1_ != '')
								begin
									set @maxPage	= 1
									set @page		= 1

									select top 100 @maxPage maxPage, @page page, * from dbo.tFVSysInquire
									where gameid = @ps1_ order by idx desc
								end
							else
								begin
									-- 읽기.
									set @idxPage	= @p4_
									select @idx = (isnull(max(idx), 1)) from dbo.tFVSysInquire

									set @maxPage	= @idx / @PAGE_LINE
									set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
									set @page		= case
														when (@idxPage <= 0)			then 1
														when (@idxPage >  @maxPage)	then @maxPage
														else @idxPage
													end
									set @idx		= @idx - (@page - 1) * @PAGE_LINE

									select top 100 @maxPage maxPage, @page page, * from dbo.tFVSysInquire
									where idx <= @idx order by idx desc
								end
						end
					else if(@p3_ = 2)
						begin
							-- 처리.
							select @gameid = gameid from dbo.tFVSysInquire where idx = @p5_

							if(@ps3_ = '')
								begin
									-- 내용은 없고 상태만 변경할 경우.
									update dbo.tFVSysInquire
										set
											state 		= @p6_,
											adminid		= @ps2_,
											dealdate 	= getdate()
									where idx = @p5_
								end
							else
								begin
									update dbo.tFVSysInquire
										set
											state 		= @p6_,
											comment2 	= comment2
														  +
														  case
																when @ps3_ != '' then @ps3_
																else				  ''
														  end
														  +
														  + '(' + @ps2_ + ':' + @dateid16 + ')'
														  +
														  case
																when @p6_ = 0 then '(문의중)'
																when @p6_ = 1 then '(확인중)'
																when @p6_ = 2 then '(처리완료)'
																else               '(모름)'
														  end
														  ,
											adminid		= @ps2_,
											dealdate 	= getdate()
									where idx = @p5_

									-- 처리완료 > 쪽지로 발송
									if(@p7_ = 1)
										begin

											if(@ps3_ != '')
												begin
													Exec Spu_Subgiftsend 1, -1, @ps2_, @gameid, @ps3_
												end
											else if(@p6_ = 1)
												begin
													Exec Spu_Subgiftsend 1, -1, @ps2_, @gameid, '확인중에 있습니다.'
												end
											else if(@p6_ = 2)
												begin
													Exec Spu_Subgiftsend 1, -1, @ps2_, @gameid, '처리완료했습니다.'
												end
										end
								end


							select @RESULT_SUCCESS 'rtn'
						end
				end
			else if(@subkind = 31)
				begin
					set @state 		= @p4_
					set @idx 		= @p5_
					set @company	= @p6_
					set @adminid	= @ps2_
					set @startdate	= @ps3_
					set @enddate	= @ps4_
					set @title		= @ps9_
					set @comment4	= @ps10_
					if(@p3_ = 1)
						begin
							insert into dbo.tFVSysEventInfo(adminid,  state,  startdate,  enddate,  company,  title,  comment)
							values(						 @adminid, @state, @startdate, @enddate, @company, @title, @comment4)

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@p3_ = 2)
						begin
							update dbo.tFVSysEventInfo
								set
									state 		= @state,
									startdate 	= @startdate,
									enddate 	= @enddate,
									company 	= @company,
									title 		= @title,
									comment		= @comment4
							where idx = @idx

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@p3_ = 3)
						begin
							-- 읽기.
							if(@state != -1)
								begin
									set @maxPage	= 1
									set @page		= 1

									select top 100 @maxPage maxPage, @page page, * from dbo.tFVSysEventInfo
									where state = @state order by idx desc
								end
							else
								begin
									set @idxPage	= @p7_
									select @idx = (isnull(max(idx), 1)) from dbo.tFVSysEventInfo

									set @maxPage	= @idx / @PAGE_LINE
									set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
									set @page		= case
														when (@idxPage <= 0)			then 1
														when (@idxPage >  @maxPage)	then @maxPage
														else @idxPage
													end
									set @idx		= @idx - (@page - 1) * @PAGE_LINE

									select top 100 @maxPage maxPage, @page page, * from dbo.tFVSysEventInfo
									where idx <= @idx order by idx desc
								end
						end
				end
		end

	-----------------------------------------------------
	--	유저로그
	-----------------------------------------------------
	else if(@kind in (@KIND_USER_SEARCH))
		begin
			if(isnull(@ps2_, '') != '')
				begin
					select top 100 * from dbo.tFVUserMaster where phone = @ps2_ order by idx desc
				end
			else if(isnull(@ps3_, '') != '')
				begin
					select top 100 * from dbo.tFVUserMaster where kakaouserid = @ps3_ order by idx desc
				end
			else if(isnull(@gameid, '') = '')
				begin
					select @idx = max(idx) from dbo.tFVUserMaster
					set @maxPage = (@idx - 1) / 10
					set @idxPage = @p10_
					if(@idxPage > @maxPage)
						begin
							set @idxPage = @maxPage
						end
					set @idxPage = @idx - (@idxPage - 1) * 10

					if(@idxPage = -1)
						begin
							select top 10 *, @maxPage maxPage from dbo.tFVUserMaster                       order by idx desc
						end
					else
						begin
							select top 10 *, @maxPage maxPage from dbo.tFVUserMaster where idx <= @idxPage order by idx desc
						end
				end
			else
				begin
					-----------------------------------------
					-- 유저정보
					-----------------------------------------
					select * from dbo.tFVUserMaster where gameid = @gameid order by idx desc

					-----------------------------------------
					-- 카톡정보.
					-----------------------------------------
					select * from dbo.tFVKakaoMaster
					where kakaouserid = (select top 1 kakaouserid from dbo.tFVUserMaster where gameid = @gameid)

					-----------------------------------------
					-- 유저 마켓이동.
					-----------------------------------------
					select * from dbo.tFVUserBeforeInfo
					where gameid = @gameid
					order by idx desc

					-----------------------------------------
					-- 유저보유 아이템 > 보유템 리스트 출력, 순서가 바로 정렬이다. ㅎㅎㅎ
					--select * from dbo.tFVUserItem where gameid = 'SangSang'
					--declare @gameid varchar(60) set @gameid = 'SangSang'
					-----------------------------------------
					select top 100 u.idx idx2, *, case when (diedate < getdate() - 7) then 1 else 0 end as freerev from dbo.tFVUserItem u join
						(select * from dbo.tFVItemInfo) i
							on u.itemcode = i.itemcode
					where gameid = @gameid
					order by invenkind asc, diedate asc, u.fieldidx, u.itemcode


					-------------------------------------------
					---- 죽을때 정보 > 속도가 늦어서 뺌
					-------------------------------------------
					--select top 10 u.idx idx2, * from dbo.tFVUserItemDieLog u join
					--	(select * from dbo.tFVItemInfo where itemcode < 300) i
					--		on u.itemcode = i.itemcode
					--where gameid = @gameid
					--order by u.idx desc
                    --
					-------------------------------------------
					---- 살릴때 정보 > 속도가 늦어서 뺌
					-------------------------------------------
					--select top 10 u.idx idx2, *	from dbo.tFVUserItemAliveLog u join
					--	(select * from dbo.tFVItemInfo where itemcode < 300) i
					--		on u.itemcode = i.itemcode
					--where gameid = @gameid
					--order by u.idx desc


					-----------------------------------------
					-- 유저보유 삭제동물
					-----------------------------------------
					select top 100 u.idx idxt, * from dbo.tFVUserItemDel u join
						(select * from dbo.tFVItemInfo) i
							on u.itemcode = i.itemcode
					where gameid = @gameid
					order by idx2 desc

					-----------------------------------------
					-- 유저 경작지
					-----------------------------------------
					select a.*, b.itemname, b.param1, b.param2, b.param5, b.param6
						from dbo.tFVUserSeed a
						LEFT JOIN
						(select * from dbo.tFVItemInfo where subcategory = 7) b
						ON a.itemcode = b.itemcode
					where gameid = @gameid order by seedidx asc

					-----------------------------------------
					-- 유저 농장
					-----------------------------------------
					select @gameyear = gameyear from dbo.tFVUserMaster where gameid = @gameid
					select a.*, b.gamecost,
						DATEDIFF(hh, incomedate, getdate()) * param1 hourcoin2,
						(gamecost + gamecost * param4 * (case when (@gameyear - param3 <= 0) then 0 else (@gameyear - param3) end) / 100) as gamecost2,
						b.itemname, b.param1 hourcoin, b.param2 maxcoin, b.param3 raiseyear, b.param4 raisepercent
						from
							(select * from dbo.tFVUserFarm where gameid = @gameid) a
						LEFT JOIN
							(select * from dbo.tFVItemInfo where subcategory = 69) b
						ON a.itemcode = b.itemcode
						order by itemcode asc


					-----------------------------------------------
					--	에피소드 보상.
					-----------------------------------------------
					select a.*, b.itemname
						from
							(select * from dbo.tFVEpiReward where gameid = @gameid) a
						LEFT JOIN
							(select * from dbo.tFVItemInfo where subcategory = 910) b
						ON a.itemcode = b.itemcode
						order by itemcode asc

					-----------------------------------------------
					--	경쟁모드 보상
					-----------------------------------------------
					--select * from dbo.tFVItemInfo
					--where itemcode in (select itemcode from dbo.tFVComReward where gameid = @gameid)
					--order by itemcode desc
					select u.idx, i.*, u.gameyear, u.gamemonth, u.famelv, u.ispass, u.idx2, u.getdate from
						(select * from dbo.tFVItemInfo where itemcode in (select itemcode from dbo.tFVComReward where gameid = @gameid)) i
						JOIN
						(select itemcode, gameyear, gamemonth, famelv, ispass, idx, idx2, getdate from dbo.tFVComReward where gameid = @gameid) u
						ON i.itemcode = u.itemcode
					order by u.idx desc

					-----------------------------------------------
					--	튜토리얼 모드 진행
					-----------------------------------------------
					select i.*, u.gameyear, u.gamemonth, u.famelv, u.ispass from
						(select * from dbo.tFVItemInfo where itemcode in (select itemcode from dbo.tFVTutoStep where gameid = @gameid)) i
						JOIN
						(select itemcode, gameyear, gamemonth, famelv, ispass from dbo.tFVTutoStep where gameid = @gameid) u
						ON i.itemcode = u.itemcode
					order by itemcode desc

					---------------------------------------------
					-- 선물리스트
					---------------------------------------------
					select a.idx idxt, a.idx2 idx2, gameid, giftkind, message, gainstate, gaindate, giftid, giftdate, b.*
					from (select top 20 * from dbo.tFVGiftList where gameid = @gameid order by idx desc) a
						LEFT JOIN
						dbo.tFVItemInfo b
						ON a.itemcode = b.itemcode
					order by idxt desc

					-----------------------------------------
					--유저 구매로그
					-----------------------------------------
					select top 10 a.idx 'idx',
						gameid,
						a.idx2 idx2,
						a.buydate2 buydate2,
						a.cnt cnt,
						a.itemcode 'itemcode', b.itemname,
						a.gamecost 'gamecost', a.cashcost 'cashcost',
						a.buydate,
						b.gamecost 'gamecost2', b.cashcost 'cashcost2'
					from dbo.tFVUserItemBuyLog a join dbo.tFVItemInfo b on a.itemcode = b.itemcode
					where gameid = @gameid order by a.idx desc

					-----------------------------------------------
					---- 캐쉬로그, 환전
					-----------------------------------------------
					select top 10 * from dbo.tFVCashLog
					where gameid = @gameid
					order by idx desc

					select top 10 * from dbo.tFVCashChangeLog
					where gameid = @gameid
					order by idx desc

					---------------------------------------------
					-- 비정상행동
					---------------------------------------------
					select top 10 * from dbo.tFVUserUnusualLog
					where gameid = @gameid
					order by idx desc

					---------------------------------------------
					-- 비정상행동
					---------------------------------------------
					select top 10 * from dbo.tFVUserUnusualLog2
					where gameid = @gameid
					order by idx desc

					---------------------------------------------
					-- 유저블럭킹
					---------------------------------------------
					select top 10 * from dbo.tFVUserBlockLog
					where gameid = @gameid
					order by idx desc

					---------------------------------------------
					-- 유저삭제
					---------------------------------------------
					select top 10 * from dbo.tFVUserDeleteLog
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					---- 유저친구
					-----------------------------------------------
					select * from dbo.tFVUserFriend
					where gameid = @gameid
					order by state desc, familiar desc

					-----------------------------------------------
					---- 카톡초대친구
					-----------------------------------------------
					--select count(*) cnt from dbo.tFVKakaoInvite where gameid = @gameid
					select top 10 * from dbo.tFVKakaoInvite
					where gameid = @gameid
					order by idx desc


					-----------------------------------------------
					---- 카톡초대친구
					-----------------------------------------------
					select top 10 * from dbo.tFVKakaoHelpWait
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					---- 유저룰렛(동물)
					-----------------------------------------------
					select top 10 * from dbo.tFVRouletteLogPerson
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					---- 합성
					-----------------------------------------------
					select top 10 * from dbo.tFVComposeLogPerson
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					---- 유저룰렛(악세)
					-----------------------------------------------
					select top 10 * from dbo.tFVAccRoulLogPerson
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					---- 유저주사위
					-----------------------------------------------
					select top 10 * from dbo.tFVYabauLogPerson
					where gameid = @gameid
					order by idx desc

					-------------------------------------------------
					------ 문자 추천
					-------------------------------------------------
					--select top 10 * from dbo.tFVUserSMSLog
					--where gameid = @gameid
					--order by idx desc

					-----------------------------------------------
					--	펫도감 : 획득한 펫.
					-----------------------------------------------
					select * from
						(select itemcode, getdate from dbo.tFVDogamListPet where gameid = @gameid) d
					JOIN
						(select itemcode, itemname from dbo.tFVItemInfo where subcategory = 1000) i
					ON
					d.itemcode = i.itemcode
					order by i.itemcode asc

					-----------------------------------------------
					--	도감 : 획득한 동물.
					-----------------------------------------------
					select * from
						(select itemcode, getdate from dbo.tFVDogamList where gameid = @gameid) d
					JOIN
						(select itemcode, itemname from dbo.tFVItemInfo where category = 1) i
					ON
					d.itemcode = i.itemcode
					order by i.itemcode asc

					-----------------------------------------------
					--	도감 : 보상 받음 도감인덱스 번호.
					-----------------------------------------------
					select * from dbo.tFVItemInfo
					where subcategory = 818
						and param1 in (select dogamidx from dbo.tFVDogamReward where gameid = @gameid)

					-----------------------------------------------
					--	학교대항전 정보
					-----------------------------------------------
					select @schoolidx = schoolidx from dbo.tFVUserMaster where gameid = @gameid
					select top 10 b.*, m.cnt, m.totalpoint, u.gameid, u.point point2 from
						(select * from dbo.tFVSchoolBank where schoolidx = @schoolidx)	b
					JOIN
						(select * from dbo.tFVSchoolMaster where schoolidx = @schoolidx) m
					ON
						b.schoolidx = m.schoolidx
					JOIN
						(select * from dbo.tFVSchoolUser where schoolidx = @schoolidx) u
					ON
						b.schoolidx = u.schoolidx
					order by u.point desc

					-----------------------------------------------
					--	학교대항전 정보
					-----------------------------------------------
					select * from dbo.tFVSchoolUser where gameid = @gameid and schoolidx = @schoolidx and schoolidx != -1

					-----------------------------------------------
					--	거래정보(일정 기간만 저장함.
					-----------------------------------------------
					select top 50 * from dbo.tFVUserSaleLog
					where gameid = @gameid
					order by idx desc

					-----------------------------------------------
					--	저장정보
					-----------------------------------------------
					select top 10 * from dbo.tFVUserSaveLog
					where gameid = @gameid
					order by idx desc
				end
		end

	else if(@kind = @KIND_USER_SETTING)
		begin
			set @gameid		= @ps1_

			if(@p2_ = 1)
				begin
					-------------------------------------
					-- 아이디 > 블럭, 로그 기록
					-------------------------------------
					update dbo.tFVUserMaster
						set
							blockstate = case blockstate
											when @BLOCK_STATE_YES then @BLOCK_STATE_NO
											else @BLOCK_STATE_YES
										end
					where gameid = @gameid

					select @val = blockstate, @phone = phone from dbo.tFVUserMaster where gameid = @gameid
					if(@val = @BLOCK_STATE_YES)
						begin
							-- 블럭정보
							insert into dbo.tFVUserBlockLog(gameid, comment)
							values(@gameid, '관리자(' + @ps2_ + ')가 직접 블럭 처리했습니다.')
						end
					else if(@val = @BLOCK_STATE_NO)
						begin
							-- 블럭해제
							delete from dbo.tFVUserBlockPhone where phone = @phone
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  2)
				begin
					-------------------------------------
					-- 아이디 > 폰, 블럭, 로그
					-------------------------------------
					select @phone = phone from dbo.tFVUserMaster where gameid = @gameid

					if(LEN(@phone) > 5)
						begin
							-- 무조건 블럭처리
							update dbo.tFVUserMaster set blockstate = @BLOCK_STATE_YES where phone = @phone

							-- 블럭폰 등록, 로그.
							if(not exists(select top 1   * from dbo.tFVUserBlockPhone where phone = @phone))
								begin
									insert into dbo.tFVUserBlockPhone(phone, comment) values(@phone, '캐쉬치트해서 일괄블럭함(' + @ps2_ + ')')

									insert into dbo.tFVUserBlockLog(gameid, comment)
									values(@gameid, '관리자(' + @ps2_ + ')가 직접 블럭 처리했습니다.')
								end
						end
					else
						begin
							-- 무조건 블럭처리
							update dbo.tFVUserMaster set blockstate = @BLOCK_STATE_YES where gameid = @gameid

							-- 블럭폰 등록, 로그.
							insert into dbo.tFVUserBlockLog(gameid, comment)
							values(@gameid, '관리자(' + @ps2_ + ')가 직접 블럭 처리했습니다.')
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  3)
				begin
					-------------------------------------
					-- 블럭해제
					-------------------------------------
					update dbo.tFVUserMaster
						set
							blockstate = @BLOCK_STATE_NO
					where gameid = @gameid

					update dbo.tFVUserBlockLog
						set
							blockstate = @BLOCK_STATE_NO,
							adminid = @ps2_,
							adminip = @ps3_,
							comment2 = '해제',
							releasedate = getdate()
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  4)
				begin
					-------------------------------------
					-- 블럭해제
					-------------------------------------
					update dbo.tFVUserMaster
						set
							kkopushallow	= case
													when kkopushallow = @INFOMATION_NO then @INFOMATION_YES
													else									@INFOMATION_NO
											  end
					where gameid = @gameid

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  1001)
				begin
					--------------------------------------------
					-- 블럭로그가 존재하면 > 상세하기
					--------------------------------------------
					if(isnull(@gameid, '') = '')
						begin
							select top 100 * from dbo.tFVUserBlockLog order by idx desc
						end
					else
						begin
							select top 100 * from dbo.tFVUserBlockLog where gameid = @gameid order by idx desc

							select * from dbo.tFVUserUnusualLog where gameid = @gameid order by idx desc
						end
				end
			else if(@p2_ =  1003)
				begin
					--------------------------------------------
					-- 상세하기
					--------------------------------------------
					if(isnull(@gameid, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVUserUnusualLog

							set @maxPage	= @idx / @PAGE_LINE
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE

							select top 100 @maxPage maxPage, @page page, * from dbo.tFVUserUnusualLog
							where idx <= @idx order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1

							select top 100 @maxPage maxPage, @page page, * from dbo.tFVUserUnusualLog
							where gameid = @gameid
							order by idx desc
						end
				end
			else if(@p2_ =  1005)
				begin
					delete from dbo.tFVUserUnusualLog where gameid = @gameid and idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  1006)
				begin
					--------------------------------------------
					-- 상세하기
					--------------------------------------------
					if(isnull(@gameid, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVUserUnusualLog2

							set @maxPage	= @idx / @PAGE_LINE
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE

							select top 100 @maxPage maxPage, @page page, * from dbo.tFVUserUnusualLog2
							where idx <= @idx order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1

							select top 100 @maxPage maxPage, @page page, * from dbo.tFVUserUnusualLog2
							where gameid = @gameid
							order by idx desc
						end
				end
			else if(@p2_ =  1007)
				begin
					delete from dbo.tFVUserUnusualLog2 where gameid = @gameid and idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ =  1008)
				begin
					--------------------------------------------
					-- 상세하기
					--------------------------------------------
					if(isnull(@gameid, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVComReward

							set @maxPage	= @idx / @PAGE_LINE
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE

							select top 100 @maxPage maxPage, @page page, u.*, i.*
							from dbo.tFVComReward u JOIN dbo.tFVItemInfo i ON i.itemcode = u.itemcode
							where u.idx <= @idx order by u.idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1

							select top 100 @maxPage maxPage, @page page, u.*, i.*
							from dbo.tFVComReward u JOIN dbo.tFVItemInfo i ON i.itemcode = u.itemcode
							where gameid = @gameid
							order by u.idx desc
						end
				end
			else if(@p2_ =  1004)
				begin
					if(@p3_ = 1)
						begin
							-- 쿠폰정보
							select top 100 * from dbo.tFVEventCertNo order by idx asc
						end
					else if(@p3_ = 2)
						begin
							-- 쿠폰정보
							select top 100 * from dbo.tFVEventCertNo where certno = @ps10_ order by idx asc

							select top 100 * from dbo.tFVEventCertNoBack where certno = @ps10_ order by idx asc
						end
					else if(@p3_ = 3)
						begin
							-- select 'DEBUG ', @gameid gameid, @ps10_ ps10_
							select
								@itemcode1	= itemcode1,	@cnt1	= cnt1,
								@itemcode2	= itemcode2,	@cnt2	= cnt2,
								@itemcode3	= itemcode3,	@cnt3	= cnt3,
								@certno		= certno,
								@kind		= kind
							from dbo.tFVEventCertNo where certno = @ps10_

							if(@gameid = '' or @ps10_ = null)
								begin
									select @RESULT_ERROR 'rtn'
								end
							else if(not exists(select top 1 * from dbo.tFVUserMaster where gameid = @gameid))
								begin
									select @RESULT_ERROR 'rtn'
								end
							-- 사전 예약 코드
							else if(UPPER(@ps10_) = 'LSYOARPUSSDGG796')
								begin
									select
										@market			= market,
										@eventspot06	= eventspot06
									from dbo.tFVUserMaster where gameid = @gameid

									-- 공통쿠폰 이벤트.
									if(@curdate < '2014-05-23 00:01' or @curdate > '2014-06-30 23:59')
										begin
											select @RESULT_ERROR 'rtn', '기간만료'
										end
									else if(@eventspot06 = 1)
										begin
											select @RESULT_ERROR 'rtn', '이미사용'
										end
									else
										begin
											---------------------------------------------------
											-- 유저 > 선물지급(없으면 자동 패스됨)
											---------------------------------------------------
											exec spu_FVSubGiftSend 2, 1205, '설문보상', @gameid, ''

											--------------------------------------
											-- 인증번호 > 사용상태로 변경
											--------------------------------------
											update dbo.tFVUserMaster set eventspot06	= 1 where gameid = @gameid

											---------------------------------------------------
											-- 토탈 기록하기
											---------------------------------------------------
											exec spu_FVDayLogInfoStatic @market, 41, 1				-- 일 쿠폰등록수

											select @RESULT_SUCCESS 'rtn'
										end
								end

							else if(@kind >= 7 and exists(select top 1 * from dbo.tFVEventCertNoBack where gameid = @gameid and kind = @kind))
								begin
									select @RESULT_ERROR 'rtn'
								end
							else if(not exists(select top 1 * from dbo.tFVEventCertNo where certno = @ps10_))
								begin
									select @RESULT_ERROR 'rtn'
								end
							else
								begin
									select @market = market from dbo.tFVUserMaster where gameid = @gameid
									--select 'DEBUG ', @market market

									select
										@itemcode1	= itemcode1,
										@itemcode2	= itemcode2,
										@itemcode3	= itemcode3,
										@certno		= certno,
										@kind		= kind
									from dbo.tFVEventCertNo where certno = @ps10_

									--------------------------------------
									-- 유저 > 선물지급(없으면 자동 패스됨)
									--------------------------------------
									if(@itemcode1 != -1)
										begin
											exec spu_FVSubGiftSend 2, @itemcode1, 'SysCert', @gameid, ''
										end

									if(@itemcode2 != -1)
										begin
											exec spu_FVSubGiftSend 2, @itemcode2, 'SysCert', @gameid, ''
										end

									if(@itemcode3 != -1)
										begin
											exec spu_FVSubGiftSend 2, @itemcode3, 'SysCert', @gameid, ''
										end

									--------------------------------------
									-- 인증번호 > 사용상태로 변경(사용여부, 아이디, 사용날짜)
									--------------------------------------
									delete from dbo.tFVEventCertNo where certno = @ps10_

									insert into dbo.tFVEventCertNoBack(certno,   gameid,   itemcode1,  itemcode2,  itemcode3,  kind)
									values(                           @ps10_, @gameid,  @itemcode1, @itemcode2, @itemcode3, @kind)


									---------------------------------------------------
									-- 토탈 기록하기
									---------------------------------------------------
									exec spu_FVDayLogInfoStatic @market, 41, 1				-- 일 쿠폰등록수

									select @RESULT_SUCCESS 'rtn'
								end

						end
				end
			else if(@p2_ =  1009)
				begin
					--------------------------------------------
					-- 상세하기
					--------------------------------------------
					if(isnull(@ps2_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVUserBeforeInfo

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVUserBeforeInfo
							where idx <= @idx order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 100 @maxPage maxPage, @page page, * from dbo.tFVUserBeforeInfo
							where gameid = @ps2_
							order by idx desc
						end
				end
			else if(@p2_ = 10)
				begin
					-------------------------------------
					-- 삭제, 로그 기록, 유효 핸드폰 리스트 갱신
					-------------------------------------
					update dbo.tFVUserMaster
						set
							deletestate = case deletestate
											when @DELETE_STATE_YES then @DELETE_STATE_NO
											else @DELETE_STATE_YES
										end
					where gameid = @gameid

					-- 삭제로그 기록하기
					select @p4_ = deletestate from dbo.tFVUserMaster where gameid = @gameid
					if(@p4_ = @DELETE_STATE_YES)
						begin
							insert into dbo.tFVUserDeleteLog(gameid, comment)
							values(@gameid, '관리자(' + @ps2_ + ')가 직접 삭제했습니다.')

							update dbo.tFVUserPhone set joincnt = joincnt - 1
							where phone = (select phone from dbo.tFVUserMaster where gameid = @gameid)
						end
					else
						begin

							update dbo.tFVUserPhone set joincnt = joincnt + 1
							where phone = (select phone from dbo.tFVUserMaster where gameid = @gameid)
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 13)
				begin
					-------------------------------------
					-- 삭제해제
					-------------------------------------
					update dbo.tFVUserMaster
						set
							deletestate = @DELETE_STATE_NO
					where gameid = @gameid

					update dbo.tFVUserDeleteLog
						set
							deletestate = @DELETE_STATE_NO,
							adminid = @ps2_,
							adminip = @ps3_,
							comment2 = '해제',
							releasedate = getdate()
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 1002)
				begin
					--------------------------------------------
					-- 삭제리스트
					--------------------------------------------
					if(isnull(@gameid, '') = '')
						begin
							select top 100 * from dbo.tFVUserDeleteLog order by idx desc

						end
					else
						begin
							select top 100 * from dbo.tFVUserDeleteLog where gameid = @gameid order by idx desc
						end
				end
			else if(@p2_ = 21)
				begin
					select top 100 * from dbo.tFVUserBlockPhone order by idx desc
				end
			else if(@p2_ = 22)
				begin
					if(not exists(select top 1   * from dbo.tFVUserBlockPhone where phone = @ps3_))
						begin
							insert into dbo.tFVUserBlockPhone(phone, comment) values(@ps3_, @ps10_)
						end

					select 1 rtn
				end
			else if(@p2_ = 23)
				begin
					if(exists(select top 1 * from dbo.tFVUserBlockPhone where phone = @ps3_))
						begin
							delete from dbo.tFVUserBlockPhone where phone = @ps3_
						end

					select 1 rtn
				end
			else if(@p2_ = 31)
				begin
					delete from dbo.tFVUserItem
					where gameid = @gameid and listidx = @p3_

					select 1 rtn
				end
			else if(@p2_ = 41)
				begin
					update dbo.tFVUserMaster set cashcost = cashcost + @p3_ where gameid = @gameid
					set @comment = '캐쉬 ' +
								+ case when @p3_ >= 0 then ' 추가:' else ' 삭감' end
								+ ltrim(rtrim(str(@p3_)))

					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 42)
				begin
					update dbo.tFVUserMaster set gamecost = gamecost + @p3_ where gameid = @gameid
					set @comment = '코인 ' +
								+ case when @p3_ >= 0 then ' 추가:' else ' 삭감' end
								+ ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 43)
				begin
					update dbo.tFVUserMaster set feed = feed + @p3_ where gameid = @gameid
					set @comment = '건초 ' +
								+ case when @p3_ >= 0 then ' 추가:' else ' 삭감' end
								+ ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 44)
				begin
					update dbo.tFVUserMaster set heart = heart + @p3_ where gameid = @gameid
					set @comment = '하트 ' +
								+ case when @p3_ >= 0 then ' 추가:' else ' 삭감' end
								+ ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 45)
				begin
					set @p3_ = CASE
									WHEN @p3_ < 0 THEN 0
									WHEN @p3_ >= 10 THEN 10
									ELSE @p3_ END

					update dbo.tFVUserMaster
						set
							invenanimalmax = @GAME_INVEN_ANIMAL_BASE + 2 * @p3_,
							invenanimalstep = @p3_
					where gameid = @gameid

					set @comment = '동물인벤Max step' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 46)
				begin
					set @p3_ = CASE
									WHEN @p3_ < 0 THEN 0
									WHEN @p3_ >= 10 THEN 10
									ELSE @p3_ END

					update dbo.tFVUserMaster
						set
							invencustommax = @GAME_INVEN_CUSTOME_BASE + 2 * @p3_,
							invencustomstep = @p3_
					where gameid = @gameid

					set @comment = '소비인벤Max step' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 47)
				begin
					set @p3_ = CASE
									WHEN @p3_ < 0 THEN 0
									WHEN @p3_ >= 10 THEN 10
									ELSE @p3_ END

					update dbo.tFVUserMaster
						set
							invenaccmax = @GAME_INVEN_ACC_BASE + 2 * @p3_,
							invenaccstep = @p3_
					where gameid = @gameid

					set @comment = ' 악세인벤Max step' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 48)
				begin
					update dbo.tFVUserMaster set heartmax = heartmax + @p3_ where gameid = @gameid
					set @comment = ' 하트Max' +
								+ case when @p3_ >= 0 then ' 추가:' else ' 삭감' end
								+ ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 50)
				begin
					update dbo.tFVUserMaster set housestate  = @USERMASTER_UPGRADE_STATE_ING, housetime = getdate() where gameid = @gameid

					set @comment = ' 업글(집)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 51)
				begin
					select top 1 @housestepmax		= housestepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set housestep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @housestepmax then @housestepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(집)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 52)
				begin
					update dbo.tFVUserMaster set tankstate 	= @USERMASTER_UPGRADE_STATE_ING, tanktime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(탱크)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 53)
				begin
					select top 1 @tankstepmax		= tankstepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set tankstep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @tankstepmax then @tankstepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(탱크)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 54)
				begin
					update dbo.tFVUserMaster set bottlestate 	= @USERMASTER_UPGRADE_STATE_ING, bottletime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(양동이)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 55)
				begin
					select top 1 @bottlestepmax		= bottlestepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set bottlestep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @bottlestepmax then @bottlestepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(양동이)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 56)
				begin
					update dbo.tFVUserMaster set pumpstate 	= @USERMASTER_UPGRADE_STATE_ING, pumptime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(착유기)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 57)
				begin
					select top 1 @pumpstepmax		= pumpstepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set pumpstep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @pumpstepmax then @pumpstepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(착유기)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 58)
				begin
					update dbo.tFVUserMaster set transferstate 	= @USERMASTER_UPGRADE_STATE_ING, transfertime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(주입기)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 59)
				begin
					select top 1 @transferstepmax		= transferstepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set transferstep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @transferstepmax then @transferstepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(주입기)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 60)
				begin
					update dbo.tFVUserMaster set purestate 	= @USERMASTER_UPGRADE_STATE_ING, puretime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(정화)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 61)
				begin
					select top 1 @purestepmax		= purestepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set purestep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @purestepmax then @purestepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(정화)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 62)
				begin
					update dbo.tFVUserMaster set freshcoolstate 	= @USERMASTER_UPGRADE_STATE_ING, freshcooltime 	= getdate() where gameid = @gameid

					set @comment = ' 업글(저온보관)진행으로 변경, 시간초기화'
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 63)
				begin
					select top 1 @freshcoolstepmax		= freshcoolstepmax from dbo.tFVSystemInfo order by idx desc

					update dbo.tFVUserMaster
						set freshcoolstep  = CASE
											WHEN @p3_ <= 0 then 0
											WHEN @p3_ >= @freshcoolstepmax then @freshcoolstepmax
											ELSE @p3_
										END
					where gameid = @gameid

					set @comment = ' 업글(저온보관)직접 변경' + ltrim(rtrim(str(@p3_)))
					exec spu_FVAdminAction @ps2_, @gameid, @comment
					select 1 rtn
				end
			else if(@p2_ = 64)
				begin
					if(@p3_ = 1)
						begin
							set @comment = '  일일출석 날짜 -1 일전으로 이동'
							update dbo.tFVUserMaster set attenddate  = attenddate - 1 where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 2)
						begin
							set @comment = '  일일출석 카운터 +=1'
							update dbo.tFVUserMaster
								set attendcnt  = attendcnt + CASE WHEN (attendcnt + 1 > 5) then 0 else 1 end
							where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 3)
						begin
							set @comment = '  친구하트선물  날짜 -1 일전으로 이동'
							update dbo.tFVUserFriend set senddate  = senddate - 1 where gameid = @ps1_ and friendid = @ps2_

							select 1 rtn
						end
					else if(@p3_ = 4)
						begin
							set @comment = ' 튜토리얼 초기화'
							update dbo.tFVUserMaster set tutorial  = 0 where gameid = @ps1_

							select 1 rtn
						end
					else if(@p3_ = 5)
						begin
							set @comment = ' 펫체험 초기화'
							update dbo.tFVUserMaster set pettodayitemcode2 = pettodayitemcode where gameid = @ps1_

							select 1 rtn
						end
					else if(@p3_ = 6)
						begin
							set @comment = '  접속일 -30갱신'
							update dbo.tFVUserMaster set condate  = condate + @p4_ where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 11)
						begin
							set @comment = '  동물부활 날짜 -7 일전으로 이동'
							update dbo.tFVUserItem set diedate  = isnull(diedate, getdate()) - 7 where gameid = @gameid and listidx = @p4_

							select 1 rtn
						end
					else if(@p3_ = 21)
						begin
							set @comment = '  농장수익 -1 hour전으로 돌리기.'
							update dbo.tFVUserFarm set incomedate  = DATEADD(hh , -1, incomedate) where gameid = @gameid and itemcode = @p4_

							select 1 rtn
						end
					else if(@p3_ = 22)
						begin
							set @comment = '  농장구매, 미구매로 상태전이.'
							update dbo.tFVUserFarm set buystate  = case when buystate = -1 then 1 else -1 end where gameid = @gameid and itemcode = @p4_

							select 1 rtn
						end
					else if(@p3_ = 31)
						begin
							set @comment = '  광고리스트 번호 클리어.'
							update dbo.tFVUserMaster set adidx  = 0 where gameid = @ps1_

							select 1 rtn
						end
					else if(@p3_ = 41)
						begin
							set @comment = '  카톡 재가입 시간 클리어.'

							update dbo.tFVKakaoMaster set deldate  = deldate - 1 where idx = @p4_

							select 1 rtn
						end
					else if(@p3_ = 42)
						begin
							set @comment = '  카톡 계정 재연결.'
							--select 'DEBUG ', @gameid gameid, @ps3_ ps3_
							if(exists(select top 1 * from dbo.tFVKakaoMaster where kakaouserid = @ps3_)
								and exists(select top 1 * from dbo.tFVUserMaster where gameid = @gameid and kakaouserid = @ps3_))
									begin
										--select 'DEBUG 계정재연결'
										update dbo.tFVKakaoMaster set gameid = @gameid where kakaouserid = @ps3_
									end

							select 1 rtn
						end
					else if(@p3_ = 43)
						begin
							set @comment = '  카톡 계정 끊어주기..'
							--select 'DEBUG ', @gameid gameid, @ps3_ ps3_
							if(exists(select top 1 * from dbo.tFVKakaoMaster where kakaouserid = @ps3_)
								and exists(select top 1 * from dbo.tFVUserMaster where gameid = @gameid and kakaouserid = @ps3_))
									begin
										--select 'DEBUG 계정재연결'
										update dbo.tFVKakaoMaster set gameid = '' where kakaouserid = @ps3_
									end

							select 1 rtn
						end
					else if(@p3_ = 44)
						begin
							set @comment = '  합성시간 초기화-1 일전으로 이동'
							update dbo.tFVUserMaster set bgcomposewt  = bgcomposewt - 1 where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 45)
						begin
							set @comment = ' 경쟁모드 번호세팅'
							if(exists(select top 1 * from dbo.tFVItemInfo where itemcode = @p4_ and subcategory = 901))
								begin
									update dbo.tFVUserMaster set comreward = @p4_ where gameid = @gameid
								end

							select 1 rtn
						end
					else if(@p3_ = 51)
						begin
							set @comment = '  상인변경.'

							update dbo.tFVUserMaster
								set
									trade0  = case when (@p4_ = 0) then (case when (trade0 = 0) then 7  else 0 end) else trade0 end,
									trade1  = case when (@p4_ = 1) then (case when (trade1 = 1) then 8  else 1 end) else trade1 end,
									trade2  = case when (@p4_ = 2) then (case when (trade2 = 2) then 9  else 2 end) else trade2 end,
									trade3  = case when (@p4_ = 3) then (case when (trade3 = 3) then 10 else 3 end) else trade3 end,
									trade4  = case when (@p4_ = 4) then (case when (trade4 = 4) then 11 else 4 end) else trade4 end,
									trade5  = case when (@p4_ = 5) then (case when (trade5 = 5) then 12 else 5 end) else trade5 end,
									trade6  = case when (@p4_ = 6) then (case when (trade6 = 6) then 13 else 6 end) else trade6 end
							where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 52)
						begin
							set @comment = ' 행운의 주사위 변경'
							update dbo.tFVUserMaster set yabauidx = -1 where gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 53)
						begin
							set @comment = ' 행운의 주사위 시도횟수'
							update dbo.tFVUserMaster set yabaucount = @p4_ where gameid = @gameid

							select 1 rtn
						end
				end
			else if(@p2_ = 65)
				begin
					if(@p3_ = 1)
						begin
							set @comment = '  게임년 변경'
							update dbo.tFVUserMaster
								set
									gameyear  = CASE
													WHEN (@p4_ > 2999) then 2999
													WHEN (@p4_ < 2013) then 2013
													else @p4_ end
							where gameid = @gameid
						end
					else if(@p3_ = 2)
						begin
							set @comment = '  게임월 변경'
							update dbo.tFVUserMaster
								set
									gamemonth  = CASE
													WHEN (@p4_ > 12) then 12
													WHEN (@p4_ < 0) then 0
													else @p4_ end
							where gameid = @gameid
						end
					else if(@p3_ = 3)
						begin
							set @comment = '  게임시간 변경'
							update dbo.tFVUserMaster
								set
									frametime  = CASE
													WHEN (@p4_ > 70) then 70
													WHEN (@p4_ < 0) then 0
													else @p4_ end
							where gameid = @gameid
						end
					else if(@p3_ = 4)
						begin
							--1		0		10
							--2		10		15
							--3		25		20	* 총 경험치에 도달하면 해당 레벨의 시작이됩니다.
							--4		45		25
							--5		70		30
							--6		100		35	총경험치
							--7		135		40	레벨1		0
							--8		175		45
							--9		220		50	레벨2~60		이전단계 총경험치 + 요구 경험치
							--10	270		55
							--11	325		60
							--12	385		65	요구 경험치
							--13	450		70	레벨 1 ~ 49		MIN ( 레벨 * 5 + 5 , 80 )
							--14	520		75
							--15	595		80	레벨 50 ~ 60		400 + ( ( 레벨 - 50 ) * 200 )
							--21	1075	80
							--49	3315	80
							--50	3395	400
							--51	3795	600
							--52	4395	800
							--53	5195	1000
							--54	6195	1200
							--55	7395	1400
							--56	8795	1600
							--57	10395	1800
							--58	12195	2000
							--59	14195	2200
							--60	16395	2400

							set @comment	= '  명성도 변경'
							set @famelv		= 1
							set @p4_		= CASE
													WHEN (@p4_ > 99999) then 99999
													WHEN (@p4_ < 0) then 0
													else @p4_ end
							set @fame		= @p4_

							set @val 	= @famelv * 5 + 5
							set @val 	= case when @val > 80 then 80 else @val end
							set @total	= @total + @val
							--select 'DEBUG', @famelv famelv, @fame fame, @val val, @total total
							while(@fame >= @total)
								begin
									set @famelv = @famelv + 1
									if(@fame = @total)break;
									if(@famelv >= @FAMELV_MAX)break;

									set @val 	= @famelv * 5 + 5
									if(@famelv < 50)
										begin
											set @val 	= case when @val > 80 then 80 else @val end
										end
									else
										begin
											set @val 	= (@famelv - 50 + 1) * 200 + 200
										end
									set @total	= @total + @val
									--if(@fame < @total)
									--	begin
									--		set @famelv = @famelv - 1
									--		break;
									--	end
								end

							update dbo.tFVUserMaster
								set
									famelv 		= @famelv,
									fame  		= @p4_,
									famelvbest 	= CASE
														WHEN @famelv > famelvbest then @famelv
														else					       famelvbest
												  END
							where gameid = @gameid
						end
					else if(@p3_ = 5)
						begin
							set @comment = '  레벨 변경'
							update dbo.tFVUserMaster
								set
									famelv  = CASE
													WHEN (@p4_ > @FAMELV_MAX) then @FAMELV_MAX
													WHEN (@p4_ < 1) then 1
													else @p4_ end
							where gameid = @gameid
						end
					else if(@p3_ = 6)
						begin
							set @comment = '  거래성공 변경'
							update dbo.tFVUserMaster
								set
									tradecnt  = CASE
													WHEN (@p4_ < 0) then 0
													else @p4_
												end,
									prizecnt  = @p4_ / 6,
									tradefailcnt = 0
							where gameid = @gameid
						end
					else if(@p3_ = 7)
						begin
							set @comment = '  상장횟수 변경'
							update dbo.tFVUserMaster
								set
									tradecnt  = @p4_ * 6,
									prizecnt  = CASE
													WHEN (@p4_ > 99999) then 99999
													WHEN (@p4_ < 0) then 0
													else @p4_
												end,
									tradefailcnt = 0
							where gameid = @gameid
						end
					else if(@p3_ = 8)
						begin
							set @comment	= '  최고명성도 변경'
							set @p4_		= CASE
													WHEN (@p4_ > @FAMELV_MAX) then @FAMELV_MAX
													WHEN (@p4_ < 1) then 1
													else @p4_
											end

							update dbo.tFVUserMaster
								set
									famelvbest = @p4_
							where gameid = @gameid
						end
					else if(@p3_ = 9)
						begin
							set @comment = '  거래실패 변경'
							if(@p4_ > 0)
								begin
									update dbo.tFVUserMaster
										set
											tradefailcnt  	= @p4_,
											tradecnt  		= 0,
											prizecnt  		= 0,
											tradecntold 	= tradecnt,
											prizecntold		= prizecnt
									where gameid = @gameid
								end
							else
								begin
									update dbo.tFVUserMaster
										set
											tradefailcnt  	= 0
									where gameid = @gameid
								end
						end
					select 1 rtn
				end
			else if(@p2_ = 66)
				begin
					if(@p3_ = 1)
						begin
							-----------------------------------------------
							--	거래정보 삭제.
							-----------------------------------------------
							set @comment = '  게임로그 삭제'
							delete from dbo.tFVUserSaleLog where idx2 = @p4_ and gameid = @gameid

							select 1 rtn
						end
					else if(@p3_ = 2)
						begin
							-----------------------------------------------
							--	거래정보 검색.
							-----------------------------------------------
							set @comment = '  검색'
							if(isnull(@ps1_, '') = '')
								begin
									select top 50 * from dbo.tFVUserSaleLog
									order by idx desc
								end

							else
								begin
									select top 500 * from dbo.tFVUserSaleLog
									where gameid = @ps1_
									order by idx desc
								end
						end
					else if(@p3_ = 11)
						begin
							-----------------------------------------------
							--	저장정보 삭제.
							-----------------------------------------------
							set @comment = '  저장로그 삭제'
							delete from dbo.tFVUserSaveLog where idx = @p4_ and gameid = @gameid

							select 1 rtn
						end
				end
			else if(@p2_ = 67)
				begin
					-----------------------------------------------
					--	인벤토리 펫업글.
					-----------------------------------------------
					set @comment = '  인벤토리 펫업글'
					update dbo.tFVUserItem
						set
							petupgrade = case
											when @p4_  < 1 then 1
											when @p4_ >= 6 then 6
											else                @p4_
										end
					where gameid = @gameid and listidx = @p3_

					select 1 rtn
				end
			else if(@p2_ = 71)
				begin
					-- 소모템 개수변경
					if(@p4_ < 0)
						begin
							set @p4_ = 0
						end
					else if(@p4_ >= 999)
						begin
							set @p4_ = 999
						end
					update dbo.tFVUserItem set cnt = @p4_ where gameid = @gameid and listidx = @p3_

					select 1 rtn
				end
			else if(@p2_ = 81)
				begin
					-- 양동이 리터
					update dbo.tFVUserMaster set bottlelittle  = bottlelittle + @p3_ where gameid = @gameid
					select 1 rtn
				end
			else if(@p2_ = 82)
				begin
					-- 양동이 신선도
					update dbo.tFVUserMaster set bottlefresh  = bottlefresh + @p3_ where gameid = @gameid
					select 1 rtn
				end
			else if(@p2_ = 83)
				begin
					-- 탱크 리터
					update dbo.tFVUserMaster set tanklittle  = tanklittle + @p3_ where gameid = @gameid
					select 1 rtn
				end
			else if(@p2_ = 84)
				begin
					-- 탱크 신선도
					update dbo.tFVUserMaster set tankfresh  = tankfresh + @p3_ where gameid = @gameid
					select 1 rtn
				end
			else if(@p2_ = 85)
				begin
					if(@p3_ = 1)
						begin
							update dbo.tFVUserSeed set itemcode = -2 where gameid = @gameid and seedidx = @p4_
						end
					else if(@p3_ = 2)
						begin
							update dbo.tFVUserSeed set itemcode = -1 where gameid = @gameid and seedidx = @p4_
						end
					else if(@p3_ = 3)
						begin
							update dbo.tFVUserSeed set seedenddate = getdate() where gameid = @gameid and seedidx = @p4_
						end
					select 1 rtn
				end
			else if(@p2_ = 86)
				begin
					if(@p3_ = 1)
						begin
							update dbo.tFVUserMaster set feedmax = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 2)
						begin
							update dbo.tFVUserMaster set heartmax = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 13)
						begin
							--update dbo.tFVUserMaster set fpoint = case when @p4_ > fpointmax then fpointmax else @p4_ end where gameid = @gameid
							update dbo.tFVUserMaster set fpoint = case when @p4_ > 9999 then 9999 else @p4_ end where gameid = @gameid
						end
					select 1 rtn
				end
			else if(@p2_ = 87)
				begin
					if(@p3_ = 1)
						begin
							update dbo.tFVUserMaster set bktwolfkillcnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 11)
						begin
							update dbo.tFVUserMaster set bktsalecoin = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 12)
						begin
							update dbo.tFVUserMaster set bkheart = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 13)
						begin
							update dbo.tFVUserMaster set bkfeed = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 14)
						begin
							update dbo.tFVUserMaster set bktsuccesscnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 15)
						begin
							update dbo.tFVUserMaster set bktbestfresh = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 16)
						begin
							update dbo.tFVUserMaster set bktbestbarrel = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 17)
						begin
							update dbo.tFVUserMaster set bktbestcoin = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 18)
						begin
							update dbo.tFVUserMaster set bkbarrel = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 21)
						begin
							update dbo.tFVUserMaster set bkcrossnormal = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 22)
						begin
							update dbo.tFVUserMaster set bkcrosspremium = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 31)
						begin
							update dbo.tFVUserMaster set ttsalecoin = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 32)
						begin
							update dbo.tFVUserMaster set etsalecoin = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 41)
						begin
							update dbo.tFVUserMaster set bgroulcnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 42)
						begin
							update dbo.tFVUserMaster set pmroulcnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 43)
						begin
							update dbo.tFVUserMaster set bgcomposecnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 44)
						begin
							update dbo.tFVUserMaster set bgtradecnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 45)
						begin
							update dbo.tFVUserMaster set pmgauage = @p4_ where gameid = @gameid
						end
					select 1 rtn
				end
			else if(@p2_ = 88)
				begin
					if(@p3_ = 1)
						begin
							set @p4_ = case when @p4_ < 0 then 0 else @p4_ end
							update dbo.tFVUserMaster set kakaomsginvitecnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 2)
						begin
							update dbo.tFVKakaoInvite set senddate = senddate - 31 where idx = @p4_
						end
					else if(@p3_ = 3)
						begin
							delete from dbo.tFVKakaoInvite where idx = @p4_
						end
					else if(@p3_ = 4)
						begin
							update dbo.tFVUserFriend set helpdate = helpdate - 10 where idx = @p4_
						end
					else if(@p3_ = 11)
						begin
							update dbo.tFVUserFriend set rentdate = rentdate - 10 where idx = @p4_
						end
					else if(@p3_ = 6)
						begin
							update dbo.tFVKakaoHelpWait set helpdate = helpdate - 10 where idx = @p4_
						end
					else if(@p3_ = 7)
						begin
							delete from dbo.tFVKakaoHelpWait where idx = @p4_
						end
					else if(@p3_ = 8)
						begin
							set @p4_ = case when @p4_ < 0 then 0 else @p4_ end
							update dbo.tFVUserMaster set kakaomsginvitetodaycnt = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 9)
						begin
							update dbo.tFVUserMaster set kakaomsginvitetodaydate = kakaomsginvitetodaydate - 1 where gameid = @gameid
						end
					else if(@p3_ = 10)
						begin
							update dbo.tFVUserMaster set kakaomsgblocked = case when kakaomsgblocked = 1 then -1 else 1 end where gameid = @gameid
						end
					else if(@p3_ = 12)
						begin
							select @schoolidx = schoolidx, @kakaouserid 	= kakaouserid from dbo.tFVUserMaster where gameid = @gameid

							update dbo.tFVKakaoMaster set gameid 	= '', cnt 	= cnt + 1 where kakaouserid = @kakaouserid
							exec spu_FVsubDelFriend @gameid

							if(@schoolidx != -1)
								begin
									-- 학교 개인정보
									select @point 	= point from dbo.tFVSchoolUser where gameid = @gameid
									delete from dbo.tFVSchoolUser where gameid = @gameid and schoolidx = @schoolidx

									select @cnt 	= cnt from dbo.tFVSchoolMaster where schoolidx = @schoolidx
									if(@cnt <= 1)
										begin
											delete from dbo.tFVSchoolMaster where schoolidx = @schoolidx
										end
									else
										begin
											update dbo.tFVSchoolMaster
												set
													cnt 		= cnt - 1,
													totalpoint 	= totalpoint - @point
											where schoolidx = @schoolidx
										end
								end

							update dbo.tFVUserMaster
								set
									kakaostatus = @KAKAO_STATUS_NEWSTART,
									deletestate = @DELETE_STATE_YES,
									schoolidx 	= -1
							where gameid = @gameid
						end
					else if(@p3_ = 13)
						begin
							update dbo.tFVUserMaster set cashcopy = 0 where gameid = @gameid
						end
					else if(@p3_ = 14)
						begin
							update dbo.tFVUserMaster set resultcopy = 0 where gameid = @gameid
						end
					else if(@p3_ = 15)
						begin
							update dbo.tFVUserMaster set kkhelpalivecnt = kkhelpalivecnt + 1 where gameid = @gameid
						end
					select 1 rtn
				end
			else if(@p2_ = 89)
				begin
					if(@p3_ = 1)
						begin
							set @p4_ = case
											when @p4_ < -1 then -1
											when @p4_ > 14 then 14
											else @p4_
										end
							update dbo.tFVUserMaster set rtnstep = @p4_ where gameid = @gameid
						end
					else if(@p3_ = 2)
						begin
							set @p4_ = case
											when @p4_ < 0 then 0
											else @p4_
										end
							update dbo.tFVUserMaster set rtnplaycnt = @p4_ where gameid = @gameid
						end
					select 1 rtn
				end
			else if(@p2_ = 90)
				begin
					-- 동물도감 : 획득한 동물 > 삭제.
					delete from dbo.tFVDogamList where gameid = @ps1_ and itemcode = @p3_
					select 1 rtn
				end
			else if(@p2_ = 92)
				begin
					-- 펫도감 : 획득한 동물 > 삭제.
					-- delete from dbo.tFVUserItem where gameid = @ps1 and itemcode = @p3_
					delete from dbo.tFVDogamListPet where gameid = @ps1_ and itemcode = @p3_
					select 1 rtn
				end
			else if(@p2_ = 91)
				begin
					-- 도감 : 보상 받음 도감인덱스 번호. > 삭제.
					delete from dbo.tFVDogamReward where gameid = @ps1_ and dogamidx = @p3_
					select 1 rtn
				end
			else if(@p2_ = 94)
				begin
					if(@p3_ = 1)
						begin
							-- 학교대항삭제
							select @schoolidx = schoolidx from dbo.tFVUserMaster where gameid = @gameid

							if(@schoolidx != -1)
								begin
									-- 학교 개인정보
									select @point = point from dbo.tFVSchoolUser where gameid = @gameid and schoolidx = @schoolidx
									delete from dbo.tFVSchoolUser where gameid = @gameid and schoolidx = @schoolidx

									-- 학교 마스터
									select @cnt = cnt from dbo.tFVSchoolMaster where schoolidx = @schoolidx
									if(@cnt <= 1)
										begin
											delete from dbo.tFVSchoolMaster where schoolidx = @schoolidx
										end
									else
										begin
											update dbo.tFVSchoolMaster
												set
													cnt			= cnt - 1,
													totalpoint	= totalpoint - @point
											where schoolidx = @schoolidx
										end

									-- 유저 정보갱신
									update dbo.tFVUserMaster
										set
											schoolidx = -1
									where gameid = @gameid
								end
							select 1 rtn
						end
					else if(@p3_ = 2)
						begin
							exec spu_FVSchoolRank  1, -1, ''			-- 현재 학교순위       (           학교순위                  )
						end
					else if(@p3_ = 3)
						begin
							exec spu_FVSchoolRank  3, -1, @gameid		-- 현재 학교내 유저순위(유저이름 > 학교번호 > 학교인원들 순위)
						end
					else if(@p3_ = 4)
						begin
							exec spu_FVSchoolRank  2, @p4_, ''		-- 현재 학교내 유저순위(           학교번호 > 학교인원들 순위)
						end
					else if(@p3_ = 5)
						begin
							-- 지난 학교랭킹
							exec spu_FVSchoolRank 20, -1, ''			-- 지난 날짜리스트.

							-- 지난 친구.
							select top 100 * from dbo.tFVUserMasterSchedule order by dateid desc
						end
					else if(@p3_ = 6)
						begin
							exec spu_FVSchoolRank 22, -1, @ps3_		-- 지난 지정된 날짜 학교순위 (20131227일 학교 랭킹)
						end
					else if(@p3_ = 7)
						begin
							exec spu_FVSchoolRank 23, @p4_, @ps3_		-- 지난 지정된 날짜 학교내의 > 유저 랭킹
						end
					else if(@p3_ = 8)
						begin
							update dbo.tFVUserMaster set schoolresult = 1 where gameid = @gameid
							select 1 rtn
						end
				end
			else if(@p2_ = 95)
				begin
					-- 경쟁모드 보상 삭제
					if(@p3_ != -1)
						begin
							update dbo.tFVUserMaster set comreward = @p3_ where gameid = @ps1_
						end
					delete from dbo.tFVComReward where gameid = @ps1_ and itemcode >= @p3_
					select 1 rtn
				end
			else if(@p2_ = 96)
				begin
					delete from dbo.tFVTutoStep where gameid = @ps1_ and itemcode = @p3_
					select 1 rtn
				end
			else if(@p2_ = 97)
				begin
					if(@p3_ = 1)
						begin
							if(@ps1_ != @SYSTEM_FRIEND and @ps2_ != @SYSTEM_FRIEND)
								begin
									-- 상호친구 삭제.
									delete from dbo.tFVUserFriend where gameid = @ps1_ and friendid = @ps2_
									delete from dbo.tFVUserFriend where gameid = @ps2_ and friendid = @ps1_
								end
						end
					else if(@p3_ = 2)
						begin
							-- 상호친구 승인.
							update dbo.tFVUserFriend set state = 2 where gameid = @ps1_ and friendid = @ps2_
							update dbo.tFVUserFriend set state = 2 where gameid = @ps2_ and friendid = @ps1_
						end
					select 1 rtn
				end
			else if(@p2_ = 98)
				begin
					if(@p3_ = 1)
						begin
							select top 50 * from dbo.tFVStaticMaster order by dateid desc
						end
					else if(@p3_ = 2)
						begin
							select * from dbo.tFVStaticSubFameLV where dateid = @ps3_ order by famelv asc

							select * from dbo.tFVStaticSubMarket where dateid = @ps3_ order by market asc
						end
					else if(@p3_ = 3)
						begin
							set @ps3_ = @ps3_ + '%'
							select * from dbo.tFVStaticSubFameLV where dateid like @ps3_ order by dateid desc, famelv asc
						end
					else if(@p3_ = 4)
						begin
							set @ps3_ = @ps3_ + '%'
							select * from dbo.tFVStaticSubMarket where dateid like @ps3_ order by dateid desc, market asc
						end
				end
			else if(@p2_ = 200)
				begin
					-----------------------------------
					-- 관리자 행동정보
					-----------------------------------
					if(isnull(@ps2_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVMessageAdmin

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVMessageAdmin
							where idx <= @idx order by idx desc
							--select top 100 * from dbo.tFVMessageAdmin order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 100 @maxPage maxPage, @page page, * from dbo.tFVMessageAdmin where adminid = @ps2_ order by idx desc
						end
				end
			else if(@p2_ = 300)
				begin
					-----------------------------------
					-- 유니크 핸드폰 정보
					-----------------------------------
					if(isnull(@ps3_, '') = '')
						begin
							select top 100 * from dbo.tFVUserPhone order by idx desc
						end
					else
						begin
							select top 100 * from dbo.tFVUserPhone where phone = @ps3_ order by idx desc
						end
				end
			-----------------------------------
			-- 유저 구매리스트, 토탈, 세부, 월별
			-----------------------------------
			else if(@p2_ = 400)
				begin
					-- 유저 구매리스트
					if(isnull(@ps1_, '') = '')
						begin
							--select top 300 * from dbo.tFVUserItemBuyLog order by idx desc
							select top 300 a.idx 'idx',
								gameid,
								a.idx2 idx2,
								a.buydate2 buydate2,
								a.cnt cnt,
								a.itemcode 'itemcode', b.itemname,
								a.gamecost 'gamecost', a.cashcost 'cashcost',
								a.buydate
							from dbo.tFVUserItemBuyLog a join dbo.tFVItemInfo b on a.itemcode = b.itemcode
							order by a.idx desc
						end
					else
						begin
							--select top 300 * from dbo.tFVUserItemBuyLog where gameid = @ps1_ order by idx desc
							select top 300 a.idx 'idx',
								gameid,
								a.idx2 idx2,
								a.buydate2 buydate2,
								a.cnt cnt,
								a.itemcode 'itemcode', b.itemname,
								a.gamecost 'gamecost', a.cashcost 'cashcost',
								a.buydate
							from dbo.tFVUserItemBuyLog a join dbo.tFVItemInfo b on a.itemcode = b.itemcode
							where gameid = @ps1_ order by a.idx desc
						end
				end
			else if(@p2_ = 401)
				begin
					-- 유저 월토탈 통계
					if(isnull(@ps2_, '') = '')
						begin
							select top 300 * from dbo.tFVUserItemBuyLogTotalMaster order by dateid8 desc
						end
					else
						begin
							select top 300 * from dbo.tFVUserItemBuyLogTotalMaster where dateid8 = @ps2_ order by dateid8 desc
						end
				end
			else if(@p2_ = 402)
				begin
					-- 유저 월서브 통계
					set @ps2_ = isnull(@ps2_, '')

					select top 500 a.idx 'idx',
						dateid8,
						a.itemcode 'itemcode', b.itemname,
						a.gamecost 'gamecost', a.cashcost 'cashcost',
						a.cnt
					from dbo.tFVUserItemBuyLogTotalSub a join dbo.tFVItemInfo b on a.itemcode = b.itemcode
					where dateid8 = @ps2_
					order by a.cashcost desc, a.gamecost desc
				end
			else if(@p2_ = 403)
				begin
					-- 유저 월아이템 통계
					set @ps2_ = isnull(@ps2_, '')

					select top 600 a.idx 'idx',
						dateid6,
						a.itemcode 'itemcode', b.itemname,
						a.gamecost 'gamecost', a.cashcost 'cashcost',
						a.cnt
					from dbo.tFVUserItemBuyLogMonth a join dbo.tFVItemInfo b on a.itemcode = b.itemcode
					where dateid6 = @ps2_
					order by a.cashcost desc, a.gamecost desc
				end
			else if(@p2_ = 404)
				begin
					-- 뽑기 광고리스트
					select top 300 * from dbo.tFVUserAdLog
					order by idx desc
				end
			-----------------------------------
			-- 죽을때 정보
			-----------------------------------
			else if(@p2_ = 405)
				begin
					if(isnull(@ps1_, '') = '')
						begin
							select top 100 u.idx idx2, *, case when (diedate < getdate() - 7) then 1 else 0 end as freerev from dbo.tFVUserItemDieLog u join
								(select * from dbo.tFVItemInfo where itemcode < 300) i
									on u.itemcode = i.itemcode
							--order by invenkind asc, diedate asc, u.fieldidx, u.itemcode
							order by u.idx desc
						end
					else
						begin
							select top 100 u.idx idx2, *, case when (diedate < getdate() - 7) then 1 else 0 end as freerev from dbo.tFVUserItemDieLog u join
								(select * from dbo.tFVItemInfo where itemcode < 300) i
									on u.itemcode = i.itemcode
							where gameid = @gameid
							--order by invenkind asc, diedate asc, u.fieldidx, u.itemcode
							order by u.idx desc
						end
				end
			-----------------------------------
			-- 살릴때 정보
			-----------------------------------
			else if(@p2_ = 406)
				begin
					if(isnull(@ps1_, '') = '')
						begin
							select top 100 u.idx idx2, *, case when (diedate < getdate() - 7) then 1 else 0 end as freerev from dbo.tFVUserItemAliveLog u join
								(select * from dbo.tFVItemInfo where itemcode < 300) i
									on u.itemcode = i.itemcode
							order by u.idx desc
							--order by invenkind asc, diedate asc, u.fieldidx, u.itemcode
						end
					else
						begin
							select top 100 u.idx idx2, *, case when (diedate < getdate() - 7) then 1 else 0 end as freerev from dbo.tFVUserItemAliveLog u join
								(select * from dbo.tFVItemInfo where itemcode < 300) i
									on u.itemcode = i.itemcode
							where gameid = @gameid
							order by u.idx desc
							--order by invenkind asc, diedate asc, u.fieldidx, u.itemcode
						end
				end
			-----------------------------------
			-- 유저 구매리스트, 토탈, 세부, 월별
			-----------------------------------
			else if(@p2_ = 410)
				begin
					-- 유저 구매리스트
					if(isnull(@ps1_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVRouletteLogPerson

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVRouletteLogPerson
							where idx <= @idx order by idx desc
							--select top 300 * from dbo.tFVRouletteLogPerson order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 500 @maxPage maxPage, @page page, * from dbo.tFVRouletteLogPerson where gameid = @ps1_ order by idx desc
						end
				end
			else if(@p2_ = 411)
				begin
					-- 유저 월토탈 통계
					if(isnull(@ps2_, '') = '')
						begin
							select top 300 * from dbo.tFVRouletteLogTotalMaster order by dateid8 desc
						end
					else
						begin
							select top 300 * from dbo.tFVRouletteLogTotalMaster where dateid8 = @ps2_ order by dateid8 desc
						end
				end
			else if(@p2_ = 412)
				begin
					-- 유저 월서브 통계
					set @ps2_ = isnull(@ps2_, '')

					select top 1000 u.*, i.param6 fresh, case when normalcnt != 0 then normalcnt*i.param6 else premiumcnt*i.param6 end '총신선도' from dbo.tFVRouletteLogTotalSub u join
						(select * from dbo.tFVItemInfo) i
							on u.itemcode = i.itemcode
					where dateid8 = @ps2_
					order by premiumcnt desc, normalcnt desc

					---------------------------
					-- 평균신선도 계산하기.
					---------------------------
					declare curRoulInfo Cursor for
					select u.itemcode itemcode,
						   case when normalcnt != 0 then normalcnt else premiumcnt end cnt,
						   i.param6 fresh from dbo.tFVRouletteLogTotalSub u join
						(select * from dbo.tFVItemInfo) i
							on u.itemcode = i.itemcode
					where dateid8 = @ps2_

					-- 2. 커서오픈
					open curRoulInfo

					set @cnt2 	= 0
					set @val	= 0
					set @val2	= 0
					-- 3. 커서 사용
					Fetch next from curRoulInfo into @itemcode, @cnt, @fresh
					while @@Fetch_status = 0
						Begin
							if(@itemcode < 300)
								begin
									set @cnt2 	= @cnt2 + @cnt
									set @val 	= @val + @fresh * @cnt
									set @val2 	= case when @fresh > @val2 then @fresh else @val2 end
								end
							Fetch next from curRoulInfo into @itemcode, @cnt, @fresh
						end

					-- 4. 커서닫기
					close curRoulInfo
					Deallocate curRoulInfo

					select @cnt2 '동물수량', @val / @cnt2 '평균신선도', @val2 '최대신선도'

					--select top 100 * from dbo.tFVRouletteLogTotalSub
					--where dateid8 = @ps2_
					--order by premiumcnt desc, normalcnt desc
				end
			else if(@p2_ = 413)
				begin
					-- 유저 친구초대정보
					if(isnull(@ps1_, '') = '')
						begin
							select top 300 * from dbo.tFVKakaoInvite order by idx desc
						end
					else
						begin
							select top 300 * from dbo.tFVKakaoInvite where gameid = @ps1_ order by idx desc
						end
				end
			-----------------------------------
			-- 악세뽑기.
			-----------------------------------
			else if(@p2_ = 414)
				begin
					-- 유저 구매리스트
					if(isnull(@ps1_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVAccRoulLogPerson

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVAccRoulLogPerson
							where idx <= @idx order by idx desc

							--select top 50 * from dbo.tFVAccRoulLogPerson order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 500 @maxPage maxPage, @page page, * from dbo.tFVAccRoulLogPerson where gameid = @ps1_ order by idx desc
						end
				end
			else if(@p2_ = 415)
				begin
					-- 유저 구매리스트
					if(isnull(@ps1_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVComposeLogPerson

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVComposeLogPerson
							where idx <= @idx order by idx desc
							--select top 300 * from dbo.tFVComposeLogPerson order by idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 500 @maxPage maxPage, @page page, * from dbo.tFVComposeLogPerson where gameid = @ps1_ order by idx desc
						end
				end
			-----------------------------------
			-- 주사위
			-----------------------------------
			else if(@p2_ = 416)
				begin
					-- 유저 월서브 통계
					set @ps2_ = isnull(@ps2_, '')
					set @ps2_ = case when (@ps2_ != '') then (@ps2_ + '%') else (@dateid6 + '%') end

					select top 500 a.idx 'idx',
						a.dateid8,
						a.itemcode 'itemcode', b.itemname,
						a.gamecost 'gamecost', a.cashcost 'cashcost',
						a.cnt, y.pack11, y.pack21, y.pack31, y.pack41, y.pack51, y.pack61,
						c.step1, c.step2, c.step3, c.step4, c.step5, c.step6,
						y.*
					from
							(select * from dbo.tFVUserItemBuyLogTotalSub where dateid8 like @ps2_) a
						JOIN
							(select * from dbo.tFVItemInfo where subcategory = 700) b
							ON a.itemcode = b.itemcode
						JOIN
							tSystemYabau y
							ON a.itemcode = y.itemcode
						JOIN
							(select * from dbo.tFVUserYabauTotalSub where dateid8 like @ps2_) c
							ON a.itemcode = c.itemcode
					--where subcategory = 700
					--and dateid8 like @ps2_
					order by a.gamecost desc, a.cashcost desc
				end
			else if(@p2_ = 417)
				begin
					-- 유저 월서브 통계
					set @ps2_ = isnull(@ps2_, '')
					set @ps2_ = case when (@ps2_ != '') then (@ps2_ + '%') else (@dateid6 + '%') end

					select top 500 a.idx 'idx',
						a.itemcode 'itemcode', b.itemname,
						a.gamecost 'gamecost', a.cashcost 'cashcost',
						a.cnt, y.pack11, y.pack21, y.pack31, y.pack41, y.pack51, y.pack61,
						c.step1, c.step2, c.step3, c.step4, c.step5, c.step6,
						y.*
					from
							(select * from dbo.tFVUserItemBuyLogMonth where dateid6 like @ps2_) a
						JOIN
							(select * from dbo.tFVItemInfo where subcategory = 700) b
							ON a.itemcode = b.itemcode
						JOIN
							tSystemYabau y
							ON a.itemcode = y.itemcode
						JOIN
							(select * from dbo.tFVUserYabauMonth where dateid6 like @ps2_) c
							ON a.itemcode = c.itemcode
					--where subcategory = 700
					--and dateid6 like @ps2_
					order by a.gamecost desc, a.cashcost desc
				end
			else if(@p2_ = 418)
				begin
					-- 유저 구매리스트
					if(isnull(@ps1_, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVYabauLogPerson

							set @maxPage	= @idx / @PAGE_LINE50
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE50

							select top 50 @maxPage maxPage, @page page, * from dbo.tFVYabauLogPerson
							where idx <= @idx order by idx desc

						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1
							select top 500 @maxPage maxPage, @page page, * from dbo.tFVYabauLogPerson where gameid = @ps1_ order by idx desc
						end
				end
		/*
			else if(@p2_ =  2)
				begin
					update dbo.tFVUserMaster set coin = coin + 1
					where gameid = @gameid
				end
			else if(@p2_ =  8)
				begin
					update dbo.tFVUserMaster
						set
							friendLSCount = friendLSMax,
							friendLSTime = getdate() - 1		--하루 전시간
					where gameid = @gameid
				end
			else if(@p2_ =  9)
				begin
					update dbo.tFVUserMaster
						set
							coindate = getdate() - 1		--하루 전시간
					where gameid = @gameid
				end
			else if(@p2_ =  90)
				begin
					update dbo.tFVUserMaster
						set
							actionTime = getdate() - 1		--하루 전시간
					where gameid = @gameid
				end
			else if(@p2_ =  91)
				begin
					update dbo.tFVUserMaster
						set
							actionCount = actionCount - 1		--한개차감
					where gameid = @gameid
				end
			else if(@p2_ =  10)
				begin
					update dbo.tFVUserMaster
						set
							doubledate = doubledate - 1
					where gameid = @gameid
					exec spu_FVAdminAction @adminid, @gameid, '더블모드 시간 (-1)일 '
				end
			else if(@p2_ =  11)
				begin
					update dbo.tFVUserMaster
						set
							doubledate = doubledate + 1
					where gameid = @gameid

					exec spu_FVAdminAction @adminid, @gameid, '더블모드 시간 (+1)일 '
				end
			else if(@p2_ =  12)
				begin
					update dbo.tFVUserMaster
						set
							actionfreedate = actionfreedate - 1
					where gameid = @gameid
					exec spu_FVAdminAction @adminid, @gameid, '더블모드 시간 (-1)일 '
				end
			else if(@p2_ =  13)
				begin
					update dbo.tFVUserMaster
						set
							actionfreedate = actionfreedate + 1
					where gameid = @gameid

					exec spu_FVAdminAction @adminid, @gameid, '더블모드 시간 (+1)일 '
				end
			--배틀템 추가지
			else if(@p2_ =  3)
				begin
					update dbo.tFVUserMaster set bttem1cnt = bttem1cnt + 1 where gameid = @gameid
				end
			else if(@p2_ =  4)
				begin
					update dbo.tFVUserMaster set bttem2cnt = bttem2cnt + 1 where gameid = @gameid
				end
			else if(@p2_ =  5)
				begin
					update dbo.tFVUserMaster set bttem3cnt = bttem3cnt + 1 where gameid = @gameid
				end
			else if(@p2_ =  6)
				begin
					update dbo.tFVUserMaster set bttem4cnt = bttem4cnt + 1 where gameid = @gameid
				end
			else if(@p2_ =  7)
				begin
					update dbo.tFVUserMaster set bttem5cnt = bttem5cnt + 1 where gameid = @gameid
				end
			-- 게임시작플래그 설정
			else if(@p2_ =  20)
				begin
					update dbo.tFVUserMaster set trainflag = 1 where gameid = @gameid
				end
			else if(@p2_ =  21)
				begin
					update dbo.tFVUserMaster set machineflag = 1 where gameid = @gameid
				end
			else if(@p2_ =  22)
				begin
					update dbo.tFVUserMaster set memorialflag = 1 where gameid = @gameid
				end
			else if(@p2_ =  23)
				begin
					update dbo.tFVUserMaster set soulflag = 1 where gameid = @gameid
				end
			else if(@p2_ =  24)
				begin
					update dbo.tFVUserMaster set btflag = 1 where gameid = @gameid
				end
			else if(@p2_ =  25)
				begin
					update dbo.tFVUserMaster set btflag2 = 1 where gameid = @gameid
				end
			else if(@p2_ =  26)
				begin
					update dbo.tFVUserMaster set mboardstate = 0 where gameid = @gameid
				end
			else if(@p2_ =  27)
				begin
					update dbo.tFVUserMaster set resultwinpush = 1 where gameid = @gameid
				end
			else if(@p2_ =  60)
				begin
					update dbo.tFVUserMaster
						set winstreak = winstreak + case when winstreak < 5 then 1 else 0 end
					where gameid = @gameid
				end
			else if(@p2_ =  61)
				begin
					update dbo.tFVUserMaster
						set winstreak2 = winstreak2 + case when winstreak2 < 10 then 1 else 0 end
					where gameid = @gameid
				end
			else if(@p4_ in (30, 31))
				begin
					declare @_gm	int		set @_gm = 50
					declare @_exp int
					declare @gradeOld int
					declare @gradeStarOld int
					if(@p4_ = 30)
						begin
							set @_exp = 2
						end
					else
						begin
							set @_exp = -2
						end

					select @gradeExp = gradeExp, @grade = grade, @gradeStar = gradeStar, @version = version from dbo.tFVUserMaster where gameid = @gameid
					-- 계급 50(version 110이하), 100(버젼 111 이상)
					set @_gm = case when (@version >= 111) then 100 else 50 end


					--1. 전의 그레이드와 별을 백업.
					set @gradeOld = @grade;
					set @gradeStarOld = @gradeStar;

					--2. 경험치 누적.
					set @gradeExp = @gradeExp + @_exp;
					set @grade = @gradeExp / 6 + 1;
					set @gradeStar = @gradeExp % 6;

					--3. +1, +2 > 승급관리.
					if(@gradeExp < 0)
						begin
							set @gradeExp = 0
							set @grade = 1
							set @gradeStar = 0
						end
					else if(@grade > @_gm)
						begin
							set @grade = @_gm
							set @gradeStar = 5
							set @gradeExp = @grade * 6 - 1
						end
					else if(@_exp > 0)
						begin
							if(@grade != @gradeOld or @gradeStar = 5)
								begin
									--gradeOld = ;
									set @gradeStarOld = 5

									set @gradeExp = 6 * @gradeOld + 2
									set @grade = @gradeExp / 6 + 1
									set @gradeStar = @gradeExp % 6
								end
						end
					else if(@_exp < 0)
						begin
							-- -1 > 승하관리, 0이하로는 안내려감.
							if(@grade != @gradeOld)
								begin
									set @gradeExp = 6 * (@grade - 1) + 2
									if(@gradeExp < 0)
										begin
											set @gradeExp = 0
										end
									set @grade = @gradeExp / 6 + 1
									set @gradeStar = @gradeExp % 6
								end
						end


					-- 데이타 입력.
					update dbo.tFVUserMaster
						set
						gradeExp = @gradeExp,
						grade = @grade,
						gradeStar = @gradeStar
					where gameid = @gameid
				end
			else if(@p4_ in (35, 36))
				begin
					declare @lv int
					declare @lvexp int
					select @lvexp = lvexp, @lv = lv from dbo.tFVUserMaster where gameid = @gameid

					if(@p4_ = 35)
						begin
							if(@lv < 50)
								begin
									set @lvexp = @lvexp + (9*@lv/2 + 10)
									set @lv = @lv + 1
								end
						end
					else
						begin
							if(@lv > 1)
								begin
									set @lv = @lv - 1
									set @lvexp = @lvexp - (9*@lv/2  + 10)
								end
							else
								begin
									set @lv = 1
									set @lvexp = 0
								end
						end


					update dbo.tFVUserMaster
						set
						lv = @lv,
						lvexp = @lvexp
					where gameid = @gameid
				end
			else if(@p2_ =  40)
				begin
					--해당로그삭제.
					set @btidx = @ps4_

					insert into tBattleLogBlock select * from dbo.tFVBattleLog where idx = @btidx

					delete from dbo.tFVBattleLog where idx = @btidx
				end
			else if(@p2_ =  100)
				begin
					update dbo.tFVUserMaster set itemupgradecnt = case when itemupgradecnt + @p2 < 0 then 0 else itemupgradecnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  101)
				begin
					update dbo.tFVUserMaster set itemupgradebest = case when itemupgradebest + @p2 < 0 then 0 else itemupgradebest + @p2 end where gameid = @gameid
				end

			else if(@p2_ =  110)
				begin
					update dbo.tFVUserMaster set petmatingcnt = case when petmatingcnt + @p2 < 0 then 0 else petmatingcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  111)
				begin
					update dbo.tFVUserMaster set petmatingbest = case when petmatingbest + @p2 < 0 then 0 else petmatingbest + @p2 end where gameid = @gameid
				end

			else if(@p2_ =  120)
				begin
					update dbo.tFVUserMaster set machpointaccrue = case when machpointaccrue + @p2 < 0 then 0 else machpointaccrue + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  121)
				begin
					update dbo.tFVUserMaster set machpointbest = case when machpointbest + @p2 < 0 then 0 else machpointbest + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  122)
				begin
					update dbo.tFVUserMaster set machplaycnt = case when machplaycnt + @p2 < 0 then 0 else machplaycnt + @p2 end where gameid = @gameid
				end

			else if(@p2_ =  130)
				begin
					update dbo.tFVUserMaster set mempointaccrue = case when mempointaccrue + @p2 < 0 then 0 else mempointaccrue + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  131)
				begin
					update dbo.tFVUserMaster set mempointbest = case when mempointbest + @p2 < 0 then 0 else mempointbest + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  132)
				begin
					update dbo.tFVUserMaster set memplaycnt = case when memplaycnt + @p2 < 0 then 0 else memplaycnt + @p2 end where gameid = @gameid
				end

			else if(@p2_ =  140)
				begin
					update dbo.tFVUserMaster set friendaddcnt = case when friendaddcnt + @p2 < 0 then 0 else friendaddcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  141)
				begin
					update dbo.tFVUserMaster set friendvisitcnt = case when friendvisitcnt + @p2 < 0 then 0 else friendvisitcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  150)
				begin
					update dbo.tFVUserMaster set pollhitcnt = case when pollhitcnt + @p2 < 0 then 0 else pollhitcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  151)
				begin
					update dbo.tFVUserMaster set ceilhitcnt = case when ceilhitcnt + @p2 < 0 then 0 else ceilhitcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  152)
				begin
					update dbo.tFVUserMaster set boardhitcnt = case when boardhitcnt + @p2 < 0 then 0 else boardhitcnt + @p2 end where gameid = @gameid
				end

			else if(@p2_ =  160)
				begin
					update dbo.tFVUserMaster set btdistaccrue = case when btdistaccrue + @p2 < 0 then 0 else btdistaccrue + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  161)
				begin
					update dbo.tFVUserMaster set btdistbest = case when btdistbest + @p2 < 0 then 0 else btdistbest + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  162)
				begin
					update dbo.tFVUserMaster set bthrcnt = case when bthrcnt + @p2 < 0 then 0 else bthrcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  163)
				begin
					update dbo.tFVUserMaster set bthrcombo = case when bthrcombo + @p2 < 0 then 0 else bthrcombo + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  164)
				begin
					update dbo.tFVUserMaster set btwincnt = case when btwincnt + @p2 < 0 then 0 else btwincnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  165)
				begin
					update dbo.tFVUserMaster set btwinstreak = case when btwinstreak + @p2 < 0 then 0 else btwinstreak + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  166)
				begin
					update dbo.tFVUserMaster set btplaycnt = case when btplaycnt + @p2 < 0 then 0 else btplaycnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  170)
				begin
					update dbo.tFVUserMaster set spdistaccrue = case when spdistaccrue + @p2 < 0 then 0 else spdistaccrue + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  171)
				begin
					update dbo.tFVUserMaster set spdistbest = case when spdistbest + @p2 < 0 then 0 else spdistbest + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  172)
				begin
					update dbo.tFVUserMaster set sphrcnt = case when sphrcnt + @p2 < 0 then 0 else sphrcnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  173)
				begin
					update dbo.tFVUserMaster set sphrcombo = case when sphrcombo + @p2 < 0 then 0 else sphrcombo + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  174)
				begin
					update dbo.tFVUserMaster set spwincnt = case when spwincnt + @p2 < 0 then 0 else spwincnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  175)
				begin
					update dbo.tFVUserMaster set spwinstreak = case when spwinstreak + @p2 < 0 then 0 else spwinstreak + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  176)
				begin
					update dbo.tFVUserMaster set spplaycnt = case when spplaycnt + @p2 < 0 then 0 else spplaycnt + @p2 end where gameid = @gameid
				end
			else if(@p2_ =  200)
				begin
					-- 퀘스트를 2일전으로 순환 초기화
					update dbo.tFVQuestUser
						set
							queststate = case
											when queststate = 0 then 1
											when queststate = 1 then 2
											else 0
										end,
							queststart = getdate() - 2
					where gameid = @gameid and questcode = @p2
				end
			else if(@p2_ =  201)
				begin
					-- 퀘스트를 2일전으로 순환 초기화
					update dbo.tFVQuestUser
						set
							queststart = getdate() - 2
					where gameid = @gameid and questcode = @p2
				end
			else if(@p2_ =  300)
				begin
					update dbo.tFVUserMaster
						set
							smsCount = case
											when smsCount + 1 > smsMax then smsMax
											else smsCount + 1
										end
					where gameid = @gameid
				end
			--else if(@p2_ =  302)
			--	begin
			--		delete from dbo.tFVUserSMSLog
			--		where idx = @p5_
			--	end
			else if(@p2_ =  600)
				begin
					update dbo.tFVMessage
						set
							newmsg = 1
					where idx = @p5_
				end
			else if(@p2_ =  700)
				begin
					-- 관리자 액션 기록
					set @comment3 = ('뽑기코인 지급 ' + ltrim(rtrim(str(@p5_))) + '개')
					exec spu_FVAdminAction @gameid, '전유저', @comment3

					-- 유저들에게 코인지급
					update dbo.tFVUserMaster
						set
							coin = case
								when coin < @p5_ then @p5_
								else coin end

				end
			else if(@p2_ = 701)
				begin
					-- 관리자 액션 기록
					set @comment3 = ('아이템지급(' + ltrim(rtrim(str(@itemcode))) + ')')
					exec spu_FVAdminAction @gameid, '전유저', @comment3

					select @comment3 = itemname from dbo.tFVItemInfo where itemcode = @itemcode

					-- 유저들에게 아이템 지급하기
					insert into dbo.tFVGiftList(gameid, itemcode, giftid, period2)
						select gameid, @itemcode, '홈런리그GM', 7 from dbo.tFVUserMaster
							where condate > dateadd(d, -7, getdate())

					insert into dbo.tFVMessage(gameid, comment)
						select gameid, '홈런리그GM이 ' + @comment3 + '을 선물했습니다.' from dbo.tFVUserMaster
							where condate > dateadd(d, -7, getdate())

				end
			select @RESULT_SUCCESS 'rtn'
		end
	else
		begin
			select @RESULT_ERROR 'rtn'
		end
	*/
		end

	-----------------------------------------------------
	--	유저삭제
	-----------------------------------------------------
	else if(@kind = @KIND_USER_DELETEID)
		begin
			set @subkind 	= @p2_
			set @gameid		= @ps1_
			if(@subkind = 1)
				begin
					--delete from dbo.tFVUserPay where phone in (select phone from dbo.tFVUserMaster where gameid = @gameid)
					select @kakaouserid = kakaouserid from dbo.tFVUserMaster where gameid = @gameid
					if(@kakaouserid = '')
						begin
							return
						end

					update dbo.tFVUserPhone set joincnt = joincnt - 1
					where phone = (select phone from dbo.tFVUserMaster where gameid = @gameid)

					set @cnt = 1
					select @cnt = count(*) from dbo.tFVUserMaster
					where kakaouserid = (select kakaouserid from dbo.tFVUserMaster where gameid = @gameid)
					--if(@cnt <= 1)
					--	begin
					--		delete from dbo.tFVKakaoMaster where kakaouserid = @kakaouserid
					--	end
					delete from dbo.tFVUserMaster where gameid = @gameid
					delete from dbo.tFVUserItem where gameid = @gameid
					delete from dbo.tFVUserSeed where gameid = @gameid
					delete from dbo.tFVUserFriend where gameid = @gameid
					delete from dbo.tFVUserBlockLog where gameid = @gameid
					delete from dbo.tFVDogamList where gameid = @gameid
					delete from dbo.tFVDogamListPet where gameid = @gameid
					delete from dbo.tFVUserFarm where gameid = @gameid
					delete from dbo.tFVUserItemDel where gameid = @gameid
					delete from dbo.tFVUserSaleLog where gameid = @gameid
					delete from dbo.tFVUserSaveLog where gameid = @gameid
					delete from dbo.tFVUserUnusualLog where gameid = @gameid
					delete from dbo.tFVUserUnusualLog2 where gameid = @gameid
					delete from dbo.tFVUserBlockLog where gameid = @gameid
					delete from dbo.tFVUserDeleteLog where gameid = @gameid
					delete from dbo.tFVGiftList where gameid = @gameid
					delete from dbo.tFVUserItemBuyLog where gameid = @gameid
					delete from dbo.tFVCashLog where gameid = @gameid
					delete from dbo.tFVCashChangeLog where gameid = @gameid
					delete from dbo.tFVUserBoard where gameid = @gameid
					delete from dbo.tFVDogamReward where gameid = @gameid
					delete from dbo.tFVComReward where gameid = @gameid
					delete from dbo.tFVEpiReward where gameid = @gameid
					delete from dbo.tFVTutoStep where gameid = @gameid
					delete from dbo.tFVRouletteLogPerson where gameid = @gameid
					delete from dbo.tFVComposeLogPerson where gameid = @gameid
					delete from dbo.tFVUserAdLog where gameid = @gameid
					delete from dbo.tFVSchoolUser where gameid = @gameid
					delete from dbo.tFVSchoolBackUser where gameid = @gameid
					delete from dbo.tFVEventCertNoBack where gameid = @gameid
					delete from dbo.tFVSysInquire where gameid = @gameid
					delete from dbo.tFVKakaoInvite where gameid = @gameid
					delete from dbo.tFVKakaoHelpWait where gameid = @gameid
					delete from dbo.tFVUserItemDieLog where gameid = @gameid
					delete from dbo.tFVUserItemAliveLog where gameid = @gameid
					delete from dbo.tFVEvnetUserGetLog where gameid = @gameid
					delete from dbo.tFVYabauLogPerson where gameid = @gameid
					delete from dbo.tFVUserBeforeInfo where gameid = @gameid

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@subkind = 2)
				begin
					update dbo.tFVUserPhone set joincnt = 0
					where phone = (select phone from dbo.tFVUserMaster where gameid = @gameid)

					select @RESULT_SUCCESS 'rtn'
				end
		end
	-----------------------------------------------------
	--	선물
	-----------------------------------------------------
	else if(@kind = @KIND_USER_GIFT)
		begin
			set @subkind 	= @p2_
			set @itemcode	= @p3_
			set @adminid 	= @ps1_
			set @gameid 	= @ps2_
			set @comment 	= @ps3_
			if(@subkind	= 1)
				begin
					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 50, 51, 22, 23, 16, 19)
					order by itemcode asc
				end
			else if(@subkind = 2)
				begin
					if(isnull(@gameid, '') = '')
						begin
							-- 최근것
							select a.idx idxt, a.idx2 idx2, gameid, giftkind, message, gainstate, gaindate, giftid, giftdate, b.*
							from (select top 50 * from dbo.tFVGiftList order by idx desc) a
								LEFT JOIN
								dbo.tFVItemInfo b
								ON a.itemcode = b.itemcode
							order by idxt desc
						end
					else
						begin
							set @str 	= @gameid
							set @str2 	= @ps3_
							if(isnull(@str2, '') = '')
								begin
									select a.idx idxt, a.idx2 idx2,  gameid, giftkind, message, gainstate, gaindate, giftid, giftdate, b.*
									from (select top 1000 * from dbo.tFVGiftList where gameid = @str order by idx desc) a
										LEFT JOIN
										dbo.tFVItemInfo b
										ON a.itemcode = b.itemcode
									order by idxt desc
								end
							else
								begin
									select a.idx idxt, a.idx2 idx2,  gameid, giftkind, message, gainstate, gaindate, giftid, giftdate, b.*
									from (select top 1000 * from dbo.tFVGiftList where gameid = @str and giftid = @str2 order by idx desc) a
										LEFT JOIN
										dbo.tFVItemInfo b
										ON a.itemcode = b.itemcode
									order by idxt desc
								end

						end
				end
			else if(@subkind = 11)
				begin
					if(not exists(select top 1 * from dbo.tFVUserMaster where gameid = @gameid))
						begin
							set @nResult = @RESULT_ERROR_NOT_FOUND_GAMEID
						end
					else if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
						begin
							set @nResult = @RESULT_ERROR_NOT_FOUND_ITEMCODE
						end
					else
						begin
							set @nResult = @RESULT_SUCCESS
							set @str = '관리자(' + @adminid + ')'

							exec spu_FVSubGiftSend 2,  @itemcode, @str, @gameid, ''				-- 특정아이템 지급

							--insert into dbo.tFVGiftList(gameid, giftkind, itemcode, giftid)
							--values(@gameid, 2, @itemcode, @adminid);
						end

					select @nResult 'rtn'
				end
			else if(@subkind = 12)
				begin
					if(not exists(select top 1 * from dbo.tFVUserMaster where gameid = @gameid))
						begin
							set @nResult = @RESULT_ERROR_NOT_FOUND_GAMEID
						end
					else
						begin
							set @nResult = @RESULT_SUCCESS
							set @str = '관리자(' + @adminid + ')'

							exec Spu_Subgiftsend 1, -1, @str, @gameid, @comment		-- ?????? ????

							--insert into dbo.tFVGiftList(gameid, giftkind, message)
							--values(@gameid, 1, @comment);
						end

					select @nResult 'rtn'
				end
			else if(@subkind = 21)
				begin
					update dbo.tFVGiftList
						set
							giftkind = case
											when giftkind = @GIFTLIST_GIFT_KIND_MESSAGE 	then @GIFTLIST_GIFT_KIND_MESSAGE_DEL
											when giftkind = @GIFTLIST_GIFT_KIND_GIFT 		then @GIFTLIST_GIFT_KIND_GIFT_DEL
											else giftkind
										end
					where idx = @p4_

					select @nResult 'rtn'
				end
			else if(@subkind = 22)
				begin
					update dbo.tFVGiftList
						set
							giftkind = case
											when giftkind = @GIFTLIST_GIFT_KIND_MESSAGE_DEL 	then @GIFTLIST_GIFT_KIND_MESSAGE
											when giftkind = @GIFTLIST_GIFT_KIND_GIFT_DEL		then @GIFTLIST_GIFT_KIND_GIFT
											when giftkind = @GIFTLIST_GIFT_KIND_GIFT_GET		then @GIFTLIST_GIFT_KIND_GIFT
											when giftkind = @GIFTLIST_GIFT_KIND_GIFT_SELL		then @GIFTLIST_GIFT_KIND_GIFT
											else giftkind
										end
					where idx = @p4_

					select @nResult 'rtn'
				end
			else if(@subkind = 23)
				begin
					delete from dbo.tFVGiftList where idx = @p4_

					select @nResult 'rtn'
				end
			--else if(@subkind = 31)
			--	begin
			--		select * from dbo.tFVItemInfo
			--		where subcategory in (1, 2, 3, 8, 9, 11, 12, 13, 15, 40, 50, 51, 22, 23, 16, 19)
			--		order by itemcode asc
			--	end
		end

	-----------------------------------------------------
	--	통계자료
	-----------------------------------------------------
	else if(@kind = @KIND_STATISTICS_INFO)
		begin
			set @dateid = @ps2_

			if(@p2_	= 1)
				begin
					--select top 50 * from dbo.tFVDayLogInfoStatic
					--order by dateid8 desc, market asc, idx desc

					-- 읽기.
					set @idxPage	= @p4_
					select @idx = (isnull(max(idx), 1)) from dbo.tFVDayLogInfoStatic

					set @maxPage	= @idx / @PAGE_LINE50
					set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE50 != 0) then 1 else 0 end
					set @page		= case
										when (@idxPage <= 0)			then 1
										when (@idxPage >  @maxPage)	then @maxPage
										else @idxPage
									end
					set @idx		= @idx - (@page - 1) * @PAGE_LINE50

					select top 50 @maxPage maxPage, @page page, * from dbo.tFVDayLogInfoStatic
					where idx <= @idx
					order by dateid8 desc, market asc, idx desc

				end
			else if(@p2_ = 11)
				begin
					-- 유저구매로그
					select @idx = max(idx) from dbo.tFVCashLog
					set @maxPage = (@idx - 1) / 25 + 2
					set @idxPage = @p3_
					if(@idxPage > @maxPage)
						begin
							set @idxPage = @maxPage
						end
					set @idxPage = @idx - (@idxPage - 1) * 25
					--select 'DEBUG ', @idx idx, @maxPage maxPage, @idxPage idxPage

					if(isnull(@ps3_, '') != '')
						begin
							--select 'DEBUG 1'
							select top 1 *, @maxPage maxPage from dbo.tFVCashLog where acode = @ps3_ order by idx desc
						end
					else if(isnull(@gameid, '') != '')
						begin
							--select 'DEBUG 2'
							if(@idxPage = -1)
								begin
									select *, @maxPage maxPage from dbo.tFVCashLog where gameid = @gameid order by idx desc
								end
							else
								begin
									select *, @maxPage maxPage from dbo.tFVCashLog where gameid = @gameid and idx <= @idxPage order by idx desc
								end
						end
					else
						begin
							--select 'DEBUG 3'
							if(@idxPage = -1)
								begin
									select top 25 *, @maxPage maxPage from dbo.tFVCashLog order by idx desc
								end
							else
								begin
									select top 25 *, @maxPage maxPage from dbo.tFVCashLog where idx <= @idxPage order by idx desc
								end
						end
				end
			else if(@p2_ = 12)
				begin
					select @idx = max(idx) from dbo.tFVCashTotal
					set @maxPage = @idx / @PAGE_CASH_LIST + case when (@idx > 0 and @idx % @PAGE_CASH_LIST != 0) then 1 else 0 end
					set @idxPage = case
										when @p3_ <= 0 			then 1
										when @p3_ >= @maxPage 	then @maxPage
										else					     @p3_
									end
					set @idx2 = @idx - (@idxPage - 1) * 25
					--select 'DEBUG ', @idx idx, @maxPage maxPage, @idxPage idxPage, @idx2 idx2

					if(isnull(@dateid, '') = '')
						begin
							if(@idxPage = -1)
								begin
									select top 25 *, @maxPage maxPage  from dbo.tFVCashTotal                                         order by dateid desc, market asc, cashkind desc
								end
							else
								begin
									select top 25 *, @maxPage maxPage  from dbo.tFVCashTotal where                     idx <= @idx2  order by dateid desc, market asc, cashkind desc
								end
						end
					else
						begin
							if(@idxPage = -1)
								begin
									select top 25 *, @maxPage maxPage  from dbo.tFVCashTotal where dateid = @dateid                  order by dateid desc, market asc, cashkind desc
								end
							else
								begin
									select top 25 *, @maxPage maxPage  from dbo.tFVCashTotal where dateid = @dateid and idx <= @idx2 order by dateid desc, market asc, cashkind desc
								end
						end
				end
			else if(@p2_ = 13)
				begin
					--select 'DEBUG 1 ', @ps2_ ps2_
					if(@ps2_ != '')
						begin
							--select 'DEBUG 2-1', @ps2_ ps2_
							set @dateid = @ps2_ + '%'
						end
					else
						begin
							--select 'DEBUG 2-2', @dateid6 dateid6
							set @dateid = @dateid6 + '%'
						end
					--select 'DEBUG 3', @dateid dateid
					select dateid, market, sum(cashcost) cashcost, sum(cash) cash, count(*) cnt from dbo.tFVCashTotal where dateid like @dateid group by dateid, market order by dateid desc
				end
			else if(@p2_ = 14)
				begin
					select top 100 * from dbo.tFVStaticCashUnique order by idx desc
				end
			else if(@p2_ = 21)
				begin
					-- 유저환전로그
					if(isnull(@gameid, '') = '')
						begin
							select top 100 * from dbo.tFVCashChangeLog order by idx desc
						end
					else
						begin
							select top 200 * from dbo.tFVCashChangeLog where gameid = @gameid order by idx desc
						end
				end
			else if(@p2_ = 22)
				begin
					if(isnull(@dateid, '') = '')
						begin
							select top 100 * from dbo.tFVCashChangeLogTotal order by dateid desc
						end
					else
						begin
							select top 100 * from dbo.tFVCashChangeLogTotal where dateid = @dateid
						end
				end
			else if(@p2_ = 23)
				begin
					set @cashkind = @p3_
					set @gameid = @ps1_
					set @ikind 	= @ps2_
					set @acode 	= @ps3_
					set @ucode 	= @ps3_
					set @password = ''
					select
						@gameid 	= gameid,
						@password 	= password,
						@market 	= market,
						@kakaouserid= kakaouserid
					from dbo.tFVUserMaster where gameid = @gameid
					--select 'DEBUG ', @gameid gameid, @password password, @ikind ikind, @acode acode, @ucode ucode, @market market, @kakaouserid kakaouserid

					if(@gameid = '' or @password = '')
						begin
							select @RESULT_ERROR 'rtn', '계정이 존재하지 않습니다.'
						end
					else if(@acode = '' or @ucode = '')
						begin
							select @RESULT_ERROR 'rtn', '영수증 번호가 없습니다.'
						end
					else if(@cashkind not in (1100, 5500, 9900, 33000, 55000, 99000))
						begin
							select @RESULT_ERROR 'rtn', '금액이 잘못 되었습니다.'
						end
					else if(exists(select top 1 * from dbo.tFVCashLog where acode = @acode))
						begin
							select @RESULT_ERROR 'rtn', '코드가 중복됩니다.(acode)'
						end
					else if(exists(select top 1 * from dbo.tFVCashLog where ucode = @ucode))
						begin
							select @RESULT_ERROR 'rtn', '코드가 중복됩니다.(ucode)'
						end
					else
						begin
							--내부에서 또 리턴해준다.
							set @comment = ('강제로 캐쉬지급 ' + ltrim(rtrim(str(@cashkind))) + '원')
							exec spu_FVAdminAction @adminid, @gameid, @comment

							if(@cashkind = 1100)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5000, 12,    1100, 12,    1100, @ikind, '', '', @kakaouserid, -1	-- 구매
								end
							else if(@cashkind = 5500)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5001, 63,    5500, 63,    5500, @ikind, '', '', @kakaouserid, -1	--
								end
							else if(@cashkind = 9900)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5002, 121,   9900, 121,   9900, @ikind, '', '', @kakaouserid, -1	--
								end
							else if(@cashkind = 33000)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5003, 426,  33000, 426,  33000, @ikind, '', '', @kakaouserid, -1	--
								end
							else if(@cashkind = 55000)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5004, 744,  55000, 744,  55000, @ikind, '', '', @kakaouserid, -1	--
								end
							else if(@cashkind = 99000)
								begin
									exec spu_FVCashBuyAdmin 1, @gameid,      '', @password, @acode, @ucode, @market, 1, 5005, 1680, 99000, 1680, 99000, @ikind, '', '', @kakaouserid, -1	--
								end
							else
								begin
									select @RESULT_ERROR 'rtn', '오류가 나왔네요'
								end
						end
				end
		end

	-----------------------------------------------------
	--	관리자 로그인
	-----------------------------------------------------
	else if(@kind = @KIND_ADMIN_LOGIN)
		begin
			set @subkind = @p2_
			if(@subkind	= 1)
				begin
					if(not exists(select * from dbo.tFVAdminUser where gameid = @ps1_))
						begin
							if(@p3_ = -1)
								begin
									set @p3_ = 0
								end
							insert into tAdminUser(gameid, password, grade) values(@ps1_, @ps2_, @p3_)
							select 1 'rtn'
						end
					else
						begin
							select -1 'rtn'
						end
				end
			else if(@subkind = 2)
				begin
					set @grade = -1
					select @grade = grade from dbo.tFVAdminUser where gameid = @ps1_ and password = @ps2_
					if(@grade != -1)
						begin
							select 1 'rtn', @grade grade, '입력'
						end
					else
						begin
							select -1 'rtn', 0 grade, '입력'
						end
				end
			else if(@subkind = 3)
				begin
					set @grade = -1
					select @grade = grade from dbo.tFVAdminUser where gameid = @ps1_
					if(@grade != -1)
						begin
							update dbo.tFVAdminUser
								set
									password 	= @ps2_,
									grade 		= @p3_
							where gameid = @ps1_

							select 1 'rtn', @grade grade, '(수정)'
						end
					else
						begin
							select -1 'rtn', 0 grade, '(수정)'
						end
				end
			else if(@subkind = 4)
				begin
					delete from dbo.tFVAdminUser where gameid = @ps1_ and password = @ps2_
					select 1 'rtn', 0, '(삭제)'
				end
		end
	-----------------------------------------------------
	--	아이템정보
	-----------------------------------------------------
	else if(@kind in (@KIND_SEARCH_ITEMINFO))
		begin
			set @subkind 	= @p2_
			set @itemcode	= @p3_
			set @category	= @p4_
			set @subcategory= @p5_
			if(@subkind	= 1)
				begin
					if(@itemcode != -1)
						begin
							select * from dbo.tFVItemInfo where itemcode = @itemcode order by itemcode asc
						end
					else if(@category != -1)
						begin
							select * from dbo.tFVItemInfo where category = @category
						end
					else if(@subcategory != -1)
						begin
							select * from dbo.tFVItemInfo where subcategory = @subcategory
						end
					else
						begin
							select * from dbo.tFVItemInfo order by itemcode asc
						end
				end
		end
	-----------------------------------------------------
	--	캐쉬삭제
	-----------------------------------------------------
	else if(@kind = @KIND_USER_CASH_LOG_DELETE)
		begin
			--if(isnull(@gameid, '') = '')
			--	begin
			--		select @RESULT_ERROR 'rtn'
			--		return
			--	end

			set @idx 			= @p3_
			if(@p2_ = 1)
				begin
					----------------------------------------------
					-- 검색(단일) > 로그삭제, 차감
					----------------------------------------------
					select
						@dateid = Convert(varchar(8), writedate, 112),
						@market = market,
						@cashcost = cashcost,
						@cash = cash
					from dbo.tFVCashLog
					where idx = @idx and gameid = @gameid
					--select 'DEBUG ', @dateid dateid, @market market, @cashcost cashcost, @cash cash, @idx idx, @gameid gameid

					-- 로그삭제
					delete dbo.tFVCashLog where idx = @idx and gameid = @gameid

					-- 통계차감
					update dbo.tFVCashTotal
						set
							cashcost = cashcost - @cashcost,
							cash = cash - @cash,
							cnt = cnt - 1
					where dateid = @dateid and cashkind = @cash and market = @market

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 2)
				begin
					----------------------------------------------
					-- 검색(일괄) > 로그삭제, 차감
					----------------------------------------------
					-- 2-1. 커서 설정
					declare curCashLog Cursor for
					select Convert(varchar(8), writedate, 112), market, cashcost, cash, idx from dbo.tFVCashLog where gameid = @gameid

					-- 2-2. 커서오픈
					open curCashLog

					-- 2-3. 커서 사용
					Fetch next from curCashLog into @dateid, @market, @cashcost, @cash, @idx
					while @@Fetch_status = 0
						Begin
							-- 로그삭제
							delete dbo.tFVCashLog where idx = @idx and gameid = @gameid

							-- 통계차감
							update dbo.tFVCashTotal
								set
									cashcost = cashcost - @cashcost,
									cash = cash - @cash,
									cnt = cnt - 1
							where dateid = @dateid and cashkind = @cash and market = @market

							Fetch next from curCashLog into @dateid, @market, @cashcost, @cash, @idx
						end

					-- 2-4. 커서닫기
					close curCashLog
					Deallocate curCashLog

					select @RESULT_SUCCESS 'rtn'
				end

		end
	-----------------------------------------------------
	--	캐쉬삭제
	-----------------------------------------------------
	else if(@kind = @KIND_SYSTEMINFO_SETTING)
		begin
			if(@p2_ = 1)
				begin
					-------------------------------------------------
					-- 시스템 테이블의 데이타를 검사
					-- select * from dbo.tFVSystemInfo order by idx desc
					-------------------------------------------------
					set @rtnflag	= 0
					select top 1 @rtnflag = rtnflag from dbo.tFVSystemInfo order by idx desc

					set @idx 		= -1
					insert into dbo.tFVSystemInfo(writedate) values(getdate())
					select top 1 @idx = idx from dbo.tFVSystemInfo order by idx desc

					-------------------------------------------------
					-- 아이템 테이블에서 시스템 테이블로 데이타 이동
					-------------------------------------------------
					--select @housestepmax		= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_HOUSE
					--select @tankstepmax		= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_TANK
					--select @freshcoolstepmax	= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_FRESHCOOL
					--select @purestepmax		= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_PURE
					--select @bottlestepmax		= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_BOTTLE
					--select @pumpstepmax		= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_PUMP
					--select @transferstepmax 	= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_UPGRADE_TRANSFER
					set @housestepmax 		= @ps7_		-- 6
					set @tankstepmax		= @ps8_		-- 20
					set @freshcoolstepmax 	= @ps8_
					set @purestepmax 		= @ps8_
					set @bottlestepmax 		= @ps8_
					set @pumpstepmax 		= @ps8_
					set @transferstepmax 	= @ps8_
					select @invenstepmax	= max(param1), @invencountmax = max(param2) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_INVEN
					select @seedfieldmax	= max(param1) from dbo.tFVItemInfo where subcategory = @ITEM_SUBCATEGORY_SEEDFIELD

					select @field5lv		= playerlv from dbo.tFVItemInfo where itemcode = 5600
					select @field6lv		= playerlv from dbo.tFVItemInfo where itemcode = 5601
					select @field7lv		= playerlv from dbo.tFVItemInfo where itemcode = 5602
					select @field8lv		= playerlv from dbo.tFVItemInfo where itemcode = 5603

					--select @housestepmax, @tankstepmax, @freshcoolstepmax, @purestepmax, @bottlestepmax, @pumpstepmax, @transferstepmax, @invenstepmax, @invencountmax, @seedfieldmax, @idx

					------------------------------------
					-- 초대보상
					------------------------------------
					-- 1. 커서 생성
					declare curKakaoInvite Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps9_)

					-- 2. 커서오픈
					open curKakaoInvite

					-- 3. 커서 사용
					Fetch next from curKakaoInvite into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @packvalue packvalue
							if(@packkind = 1) 		set @kakaoinvite01 = @packvalue
							else if(@packkind = 2) 	set @kakaoinvite02 = @packvalue
							else if(@packkind = 3) 	set @kakaoinvite03 = @packvalue
							else if(@packkind = 4) 	set @kakaoinvite04 = @packvalue

							Fetch next from curKakaoInvite into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curKakaoInvite
					Deallocate curKakaoInvite

					--------------------------------------
					-- 시스템 정보 입력
					--------------------------------------
					update dbo.tFVSystemInfo
						set
							housestepmax		= @housestepmax,
							tankstepmax			= @tankstepmax,
							freshcoolstepmax	= @freshcoolstepmax,
							purestepmax			= @purestepmax,
							bottlestepmax		= @bottlestepmax,
							pumpstepmax			= @pumpstepmax,
							transferstepmax		= @transferstepmax,
							invenstepmax		= @invenstepmax,
							invencountmax		= @invencountmax,
							seedfieldmax		= @seedfieldmax,

							field5lv			= @field5lv,
							field6lv			= @field6lv,
							field7lv			= @field7lv,
							field8lv			= @field8lv,

							pluscashcost		= @p3_,
							plusgamecost		= @p4_,

							attend1				= @p5_,
							attend2				= @p6_,
							attend3				= @p7_,
							attend4				= @p8_,
							attend5				= @p9_,

							plusheart			= @p10_,
							plusfeed			= @ps2_,

							roulaccprice		= @ps3_,
							roulaccsale			= @ps4_,

							composesale			= @ps5_,
							iphonecoupon		= @ps6_,

							kakaoinvite01		= @kakaoinvite01,
							kakaoinvite02		= @kakaoinvite02,
							kakaoinvite03		= @kakaoinvite03,
							kakaoinvite04		= @kakaoinvite04,

							rtnflag				= @rtnflag,

							comment				= @ps10_
					where idx = @idx

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 2)
				begin
					select top 200 * from dbo.tFVSystemInfo order by idx desc
				end
			else if(@p2_ = 3)
				begin
					-------------------------------------------------
					-- 코멘트갱신
					-------------------------------------------------
					update dbo.tFVSystemInfo
						set
							comment				= @ps10_
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 4)
				begin
					-------------------------------------------------
					-- 복귀이벤트 설정
					-------------------------------------------------
					update dbo.tFVSystemInfo
						set
							rtnflag	= case when rtnflag = 1 then 0 else 1 end
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			if(@p2_ in (5, 6))
				begin
					-------------------------------------------------
					-- 데이타를 입력
					-------------------------------------------------
					if(@p2_ = 5)
						begin
							set @idx = -1
							insert into dbo.tFVSystemRouletteMan(writedate) values(getdate())
							select top 1 @idx = idx from dbo.tFVSystemRouletteMan order by idx desc
						end
					else
						begin
							set @idx = @p3_
						end

					set @roulmarket 	= @ps1_
					set @roulstart 		= @ps2_
					set @roulend 		= @ps3_
					set @roulname1 		= @ps4_
					set @roulname2 		= @ps5_
					set @roulname3 		= @ps6_

					-- 1. 커서 생성
					declare curSysRoulMan Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps9_)

					-- 2. 커서오픈
					open curSysRoulMan

					-- 3. 커서 사용
					Fetch next from curSysRoulMan into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @packvalue packvalue
							if(@packkind = 1) 		set @roulflag		= @packvalue
							else if(@packkind = 2) 	set @roulani1		= @packvalue
							else if(@packkind = 3) 	set @roulani2 		= @packvalue
							else if(@packkind = 4) 	set @roulani3 		= @packvalue
							else if(@packkind = 5) 	set @roulreward1	= @packvalue
							else if(@packkind = 6) 	set @roulreward2 	= @packvalue
							else if(@packkind = 7) 	set @roulreward3 	= @packvalue

							else if(@packkind = 10) set @roultimeflag 	= @packvalue
							else if(@packkind = 11) set @roultimetime1 	= @packvalue
							else if(@packkind = 12) set @roultimetime2 	= @packvalue
							else if(@packkind = 13) set @roultimetime3 	= @packvalue

							else if(@packkind = 20) set @pmgauageflag 	= @packvalue
							else if(@packkind = 21) set @pmgauagepoint	= @packvalue
							else if(@packkind = 22) set @pmgauagemax 	= @packvalue

							Fetch next from curSysRoulMan into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curSysRoulMan
					Deallocate curSysRoulMan

					--------------------------------------
					-- 정보 입력
					--------------------------------------
					update dbo.tFVSystemRouletteMan
						set
							roulmarket			= @roulmarket,
							roulflag			= @roulflag,
							roulstart			= @roulstart,
							roulend				= @roulend,
							roulani1			= @roulani1,
							roulani2 			= @roulani2,
							roulani3 			= @roulani3,
							roulreward1 		= @roulreward1,
							roulreward2 		= @roulreward2,
							roulreward3 		= @roulreward3,
							roulname1 			= @roulname1,
							roulname2 			= @roulname2,
							roulname3 			= @roulname3,

							roultimeflag		= @roultimeflag,
							roultimetime1 		= @roultimetime1,
							roultimetime2 		= @roultimetime2,
							roultimetime3 		= @roultimetime3,

							pmgauageflag		= @pmgauageflag,
							pmgauagepoint 		= @pmgauagepoint,
							pmgauagemax 		= @pmgauagemax,
							comment				= @ps10_
					where idx = @idx

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 7)
				begin
					-------------------------------------------------
					-- 패키지 상품정보.(상품, 등록리스트)
					-------------------------------------------------
					select count(*) cnt from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 50, 51, 22, 23)

					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 50, 51, 22, 23)
					order by itemcode asc

					-------------------------------------------------
					-- 시간제 이벤트 정보.
					-------------------------------------------------
					--select top 200 * from dbo.tFVSystemRouletteMan order by idx desc
					select * from dbo.tFVSystemRouletteMan
					where idx in (select max(idx) from dbo.tFVSystemRouletteMan where roulmarket in (@SKT, @GOOGLE, @IPHONE, @NHN) group by roulmarket)
					order by roulmarket asc

				end
			else if(@p2_ = 11)
				begin
					-------------------------------------------------
					-- 패키지 상품정보.(상품, 등록리스트)
					-------------------------------------------------
					select count(*) cnt from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)

					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)
					order by itemcode asc

					select top 200 * from dbo.tFVSystemPack order by packstate desc, famelvmin desc, famelvmax desc
				end
			else if(@p2_ = 12)
				begin
					-- 1. 커서 생성
					declare curPackInsert Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)

					-- 2. 커서오픈
					open curPackInsert

					-- 3. 커서 사용
					Fetch next from curPackInsert into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @packvalue packvalue
							if(@packkind = 1) 		set @pack1 = @packvalue
							else if(@packkind = 2) 	set @pack2 = @packvalue
							else if(@packkind = 3) 	set @pack3 = @packvalue
							else if(@packkind = 4) 	set @pack4 = @packvalue
							else if(@packkind = 5) 	set @pack5 = @packvalue
							else if(@packkind = 6) 	set @pack6 = @packvalue
							else if(@packkind = 7) 	set @pack7 = @packvalue
							else if(@packkind = 8) 	set @pack8 = @packvalue
							else if(@packkind = 9) 	set @pack9 = @packvalue
							else if(@packkind = 10) set @pack10 = @packvalue
							else if(@packkind = 11) set @pack11 = @packvalue
							else if(@packkind = 12) set @pack12 = @packvalue
							else if(@packkind = 13) set @pack13 = @packvalue
							else if(@packkind = 14) set @pack14 = @packvalue
							else if(@packkind = 15) set @pack15 = @packvalue
							else if(@packkind = 16) set @pack16 = @packvalue
							else if(@packkind = 17) set @pack17 = @packvalue
							else if(@packkind = 18) set @pack18 = @packvalue
							else if(@packkind = 19) set @pack19 = @packvalue
							else if(@packkind = 20) set @pack20 = @packvalue

							Fetch next from curPackInsert into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curPackInsert
					Deallocate curPackInsert

					if(not exists(select top 1 * from dbo.tFVSystemPack where packstr = @ps3_))
						begin
							-- 정보수집용 추가 > 아이템 테이블 추가하기.
							set @itemcode = 50000
							select @itemcode = max(itemcode) + 1 from dbo.tFVItemInfo where subcategory = 500

							if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
								begin
									insert into dbo.tFVItemInfo(labelname,     itemcode, category, subcategory, equpslot, itemname, activate, toplist, grade, discount, icon, playerlv, houselv, gamecost, cashcost, buyamount, sellcost, description)
									                   values('staticinfo', @itemcode, '500',    '500',       '0',      @ps1_,    '0',      '0',     '0',   '0',      '16', '0',      '0',     '0',      '0',      '0',       '0',      @ps2_)

									insert into dbo.tFVSystemPack( itemcode, famelvmin, famelvmax, cashcostcost, cashcostper, cashcostsale,         packstate, packname,  comment, packstr,  pack1,  pack2,  pack3,  pack4,  pack5,  pack6,  pack7,  pack8,  pack9,  pack10,  pack11,  pack12,  pack13,  pack14,  pack15,  pack16,  pack17,  pack18,  pack19,  pack20)
														 values(@itemcode, @p4_,      @p5_,      @p6_,         @p7_,        @p6_ - (@p6_ * @p7_)/100, @p8_,      @ps1_,     @ps2_,   @ps3_,   @pack1, @pack2, @pack3, @pack4, @pack5, @pack6, @pack7, @pack8, @pack9, @pack10, @pack11, @pack12, @pack13, @pack14, @pack15, @pack16, @pack17, @pack18, @pack19, @pack20)
								end
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 13)
				begin

					-- 1. 커서 생성
					declare curPackUpdate Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)

					-- 2. 커서오픈
					open curPackUpdate

					-- 3. 커서 사용
					Fetch next from curPackUpdate into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind kind, @packvalue packvalue
							if(@packkind = 1) 		set @pack1 = @packvalue
							else if(@packkind = 2) 	set @pack2 = @packvalue
							else if(@packkind = 3) 	set @pack3 = @packvalue
							else if(@packkind = 4) 	set @pack4 = @packvalue
							else if(@packkind = 5) 	set @pack5 = @packvalue
							else if(@packkind = 6) 	set @pack6 = @packvalue
							else if(@packkind = 7) 	set @pack7 = @packvalue
							else if(@packkind = 8) 	set @pack8 = @packvalue
							else if(@packkind = 9) 	set @pack9 = @packvalue
							else if(@packkind = 10) set @pack10 = @packvalue
							else if(@packkind = 11) set @pack11 = @packvalue
							else if(@packkind = 12) set @pack12 = @packvalue
							else if(@packkind = 13) set @pack13 = @packvalue
							else if(@packkind = 14) set @pack14 = @packvalue
							else if(@packkind = 15) set @pack15 = @packvalue
							else if(@packkind = 16) set @pack16 = @packvalue
							else if(@packkind = 17) set @pack17 = @packvalue
							else if(@packkind = 18) set @pack18 = @packvalue
							else if(@packkind = 19) set @pack19 = @packvalue
							else if(@packkind = 20) set @pack20 = @packvalue

							Fetch next from curPackUpdate into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curPackUpdate
					Deallocate curPackUpdate

					update dbo.tFVSystemPack
							set
								famelvmin	= @p4_,
								famelvmax	= @p5_,
								cashcostcost	= @p6_,
								cashcostper		= @p7_,
								cashcostsale	= @p6_ - (@p6_ * @p7_)/100,
								packstate	= @p8_,
								packname	= @ps1_,
								comment		= @ps2_,
								packstr 	= @ps3_,
								packmarket	= @ps4_,
								pack1	= @pack1,   	pack2	= @pack2,	pack3	= @pack3,	pack4	= @pack4,		pack5	= @pack5,
								pack6	= @pack6,  		pack7	= @pack7,	pack8	= @pack8,	pack9	= @pack9,		pack10	= @pack10,

								pack11	= @pack11,  	pack12	= @pack12,	pack13	= @pack13,	pack14	= @pack14,		pack15	= @pack15,
								pack16	= @pack16,  	pack17	= @pack17,	pack18	= @pack18,	pack19	= @pack19,		pack20	= @pack20
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 21)
				begin
					-------------------------------------------------
					-- 교배뽑기 상품정보.(상품, 등록리스트)
					-------------------------------------------------
					select count(*) cnt from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)

					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)
					order by itemcode asc

					select top 200 * from dbo.tFVSystemRoulette
					where packstate = @p3_
					order by idx desc
					--order by famelvmin desc, famelvmax desc, idx desc
				end
			else if(@p2_ = 22)
				begin
					-------------------------------------------------
					-- 교배뽑기 (등록)
					-------------------------------------------------
					-- 1. 커서 생성
					declare curRoulInsert Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)

					-- 2. 커서오픈
					open curRoulInsert

					-- 3. 커서 사용
					Fetch next from curRoulInsert into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @packvalue packvalue
							if(@packkind = 1) 		set @pack1 = @packvalue
							else if(@packkind = 2) 	set @pack2 = @packvalue
							else if(@packkind = 3) 	set @pack3 = @packvalue
							else if(@packkind = 4) 	set @pack4 = @packvalue
							else if(@packkind = 5) 	set @pack5 = @packvalue
							else if(@packkind = 6) 	set @pack6 = @packvalue
							else if(@packkind = 7) 	set @pack7 = @packvalue
							else if(@packkind = 8) 	set @pack8 = @packvalue
							else if(@packkind = 9) 	set @pack9 = @packvalue
							else if(@packkind = 10) set @pack10 = @packvalue
							else if(@packkind = 11) set @pack11 = @packvalue
							else if(@packkind = 12) set @pack12 = @packvalue
							else if(@packkind = 13) set @pack13 = @packvalue
							else if(@packkind = 14) set @pack14 = @packvalue
							else if(@packkind = 15) set @pack15 = @packvalue
							else if(@packkind = 16) set @pack16 = @packvalue
							else if(@packkind = 17) set @pack17 = @packvalue
							else if(@packkind = 18) set @pack18 = @packvalue
							else if(@packkind = 19) set @pack19 = @packvalue
							else if(@packkind = 20) set @pack20 = @packvalue
							else if(@packkind = 21) set @pack21 = @packvalue
							else if(@packkind = 22) set @pack22 = @packvalue
							else if(@packkind = 23) set @pack23 = @packvalue
							else if(@packkind = 24) set @pack24 = @packvalue
							else if(@packkind = 25) set @pack25 = @packvalue
							else if(@packkind = 26) set @pack26 = @packvalue
							else if(@packkind = 27) set @pack27 = @packvalue
							else if(@packkind = 28) set @pack28 = @packvalue
							else if(@packkind = 29) set @pack29 = @packvalue
							else if(@packkind = 30) set @pack30 = @packvalue
							else if(@packkind = 31) set @pack31 = @packvalue
							else if(@packkind = 32) set @pack32 = @packvalue
							else if(@packkind = 33) set @pack33 = @packvalue
							else if(@packkind = 34) set @pack34 = @packvalue
							else if(@packkind = 35) set @pack35 = @packvalue
							else if(@packkind = 36) set @pack36 = @packvalue
							else if(@packkind = 37) set @pack37 = @packvalue
							else if(@packkind = 38) set @pack38 = @packvalue
							else if(@packkind = 39) set @pack39 = @packvalue
							else if(@packkind = 40) set @pack40 = @packvalue

							Fetch next from curRoulInsert into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curRoulInsert
					Deallocate curRoulInsert

					if(not exists(select top 1 * from dbo.tFVSystemRoulette where packstr = @ps3_))
						begin
							-- 정보수집용 추가 > 아이템 테이블 추가하기.
							set @itemcode = 60000
							select @itemcode = max(itemcode) + 1 from dbo.tFVItemInfo where subcategory = 600

							if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
								begin
									insert into dbo.tFVItemInfo(labelname,     itemcode, category, subcategory, equpslot, itemname, activate, toplist, grade, discount, icon, playerlv, houselv, gamecost, cashcost, buyamount, sellcost, description)
									                   values('staticinfo', @itemcode, '600',    '600',       '0',      @ps1_,    '0',      '0',     '0',   '0',      '16', '0',      '0',     '0',      '0',      '0',       '0',      @ps2_)
									insert into dbo.tFVSystemRoulette( itemcode, famelvmin, famelvmax, cashcostcost, cashcostper, cashcostsale,             packstate, packname,  comment, packstr,
																 	 pack1,   pack2,   pack3,   pack4,   pack5,   pack6,   pack7,   pack8,   pack9,  pack10,
																	pack11,  pack12,  pack13,  pack14,  pack15,  pack16,  pack17,  pack18,  pack19,  pack20,
																	pack21,  pack22,  pack23,  pack24,  pack25,  pack26,  pack27,  pack28,  pack29,  pack30,
																	pack31,  pack32,  pack33,  pack34,  pack35,  pack36,  pack37,  pack38,  pack39,  pack40,
																	gamecost, heart)
														     values(@itemcode, @p4_,      @p5_,      @p6_,         @p7_,        @p6_ - (@p6_ * @p7_)/100, @p8_,      @ps1_,     @ps2_,   @ps3_,
														     		 @pack1,  @pack2,  @pack3,  @pack4,  @pack5,  @pack6,  @pack7,  @pack8,  @pack9, @pack10,
														     		@pack11, @pack12, @pack13, @pack14, @pack15, @pack16, @pack17, @pack18, @pack19, @pack20,
																	@pack21, @pack22, @pack23, @pack24, @pack25, @pack26, @pack27, @pack28, @pack29, @pack30,
																	@pack31, @pack32, @pack33, @pack34, @pack35, @pack36, @pack37, @pack38, @pack39, @pack40,
														     		@p9_,     @p10_)
								end
						end
					--else
					--	begin
					--		select 'Same name'
					--	end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 23)
				begin
					-------------------------------------------------
					-- 교배뽑기 (수정)
					-------------------------------------------------

					-- 1. 커서 생성
					declare curRoulUpdate Cursor for
					select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)

					-- 2. 커서오픈
					open curRoulUpdate

					-- 3. 커서 사용
					Fetch next from curRoulUpdate into @packkind, @packvalue
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind kind, @packvalue packvalue
							if(@packkind = 1) 		set @pack1 = @packvalue
							else if(@packkind = 2) 	set @pack2 = @packvalue
							else if(@packkind = 3) 	set @pack3 = @packvalue
							else if(@packkind = 4) 	set @pack4 = @packvalue
							else if(@packkind = 5) 	set @pack5 = @packvalue
							else if(@packkind = 6) 	set @pack6 = @packvalue
							else if(@packkind = 7) 	set @pack7 = @packvalue
							else if(@packkind = 8) 	set @pack8 = @packvalue
							else if(@packkind = 9) 	set @pack9 = @packvalue
							else if(@packkind = 10) set @pack10 = @packvalue
							else if(@packkind = 11) set @pack11 = @packvalue
							else if(@packkind = 12) set @pack12 = @packvalue
							else if(@packkind = 13) set @pack13 = @packvalue
							else if(@packkind = 14) set @pack14 = @packvalue
							else if(@packkind = 15) set @pack15 = @packvalue
							else if(@packkind = 16) set @pack16 = @packvalue
							else if(@packkind = 17) set @pack17 = @packvalue
							else if(@packkind = 18) set @pack18 = @packvalue
							else if(@packkind = 19) set @pack19 = @packvalue
							else if(@packkind = 20) set @pack20 = @packvalue
							else if(@packkind = 21) set @pack21 = @packvalue
							else if(@packkind = 22) set @pack22 = @packvalue
							else if(@packkind = 23) set @pack23 = @packvalue
							else if(@packkind = 24) set @pack24 = @packvalue
							else if(@packkind = 25) set @pack25 = @packvalue
							else if(@packkind = 26) set @pack26 = @packvalue
							else if(@packkind = 27) set @pack27 = @packvalue
							else if(@packkind = 28) set @pack28 = @packvalue
							else if(@packkind = 29) set @pack29 = @packvalue
							else if(@packkind = 30) set @pack30 = @packvalue
							else if(@packkind = 31) set @pack31 = @packvalue
							else if(@packkind = 32) set @pack32 = @packvalue
							else if(@packkind = 33) set @pack33 = @packvalue
							else if(@packkind = 34) set @pack34 = @packvalue
							else if(@packkind = 35) set @pack35 = @packvalue
							else if(@packkind = 36) set @pack36 = @packvalue
							else if(@packkind = 37) set @pack37 = @packvalue
							else if(@packkind = 38) set @pack38 = @packvalue
							else if(@packkind = 39) set @pack39 = @packvalue
							else if(@packkind = 40) set @pack40 = @packvalue

							Fetch next from curRoulUpdate into @packkind, @packvalue
						end

					-- 4. 커서닫기
					close curRoulUpdate
					Deallocate curRoulUpdate

					update dbo.tFVSystemRoulette
							set
								famelvmin	= @p4_,
								famelvmax	= @p5_,
								cashcostcost= @p6_,
								cashcostper	= @p7_,
								cashcostsale= @p6_ - (@p6_ * @p7_)/100,
								gamecost 	= @p9_,
								heart 		= @p10_,
								packstate	= @p8_,
								packname	= @ps1_,
								comment		= @ps2_,
								packstr 	= @ps3_,
								pack1	= @pack1,   	pack2	= @pack2,	pack3	= @pack3,	pack4	= @pack4,		pack5	= @pack5,
								pack6	= @pack6,  		pack7	= @pack7,	pack8	= @pack8,	pack9	= @pack9,		pack10	= @pack10,

								pack11	= @pack11,  	pack12	= @pack12,	pack13	= @pack13,	pack14	= @pack14,		pack15	= @pack15,
								pack16	= @pack16,  	pack17	= @pack17,	pack18	= @pack18,	pack19	= @pack19,		pack20	= @pack20,

								pack21	= @pack21,  	pack22	= @pack22,	pack23	= @pack23,	pack24	= @pack24,		pack25	= @pack25,
								pack26	= @pack26,  	pack27	= @pack27,	pack28	= @pack28,	pack29	= @pack29,		pack30	= @pack30,

								pack31	= @pack31,  	pack32	= @pack32,	pack33	= @pack33,	pack34	= @pack34,		pack35	= @pack35,
								pack36	= @pack36,  	pack37	= @pack37,	pack38	= @pack38,	pack39	= @pack39,		pack40	= @pack40
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 24)
				begin
					update dbo.tFVSystemRoulette
							set
								cashcostper	= @p7_,
								cashcostsale= cashcostcost - (cashcostcost * @p7_)/100
					where packstate = 1

					select @RESULT_SUCCESS 'rtn'
				end

			--else if(@p2_ = 41)
			--	begin
			--		-------------------------------------------------
			--		-- 교배뽑기 상품정보.(상품, 등록리스트)
			--		-------------------------------------------------
			--		--select count(*) cnt from dbo.tFVItemInfo
			--		--where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)
            --
			--		--select * from dbo.tFVItemInfo
			--		--where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)
			--		--order by itemcode asc
            --
			--		select top 300 * from dbo.tFVSystemRouletteFresh order by packstate desc, famelvmin desc, famelvmax desc
			--	end
			--else if(@p2_ = 42)
			--	begin
			--		-------------------------------------------------
			--		-- 교배뽑기 (등록)
			--		-------------------------------------------------
			--		-- 1. 커서 생성
			--		declare curRoulFreshInsert Cursor for
			--		select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)
            --
			--		-- 2. 커서오픈
			--		open curRoulFreshInsert
            --
			--		-- 3. 커서 사용
			--		Fetch next from curRoulFreshInsert into @packkind, @packvalue
			--		while @@Fetch_status = 0
			--			Begin
			--				--select 'DEBUG ', @packkind packkind, @packvalue packvalue
			--				if(@packkind = 1) 		set @groupstep1 = @packvalue
			--				else if(@packkind = 2) 	set @groupstep2 = @packvalue
			--				else if(@packkind = 3) 	set @groupstep3 = @packvalue
			--				else if(@packkind = 4) 	set @groupstep4 = @packvalue
			--				else if(@packkind = 5) 	set @groupstep5 = @packvalue
			--				else if(@packkind = 6) 	set @groupstep6 = @packvalue
			--				else if(@packkind = 7) 	set @groupstep7 = @packvalue
			--				else if(@packkind = 8) 	set @groupstep8 = @packvalue
            --
			--				Fetch next from curRoulFreshInsert into @packkind, @packvalue
			--			end
            --
			--		-- 4. 커서닫기
			--		close curRoulFreshInsert
			--		Deallocate curRoulFreshInsert
            --
			--		if(not exists(select top 1 * from dbo.tFVSystemRouletteFresh where packstr = @ps3_))
			--			begin
			--				-- 정보수집용 추가 > 아이템 테이블 추가하기.
			--				set @itemcode = 60000
			--				select @itemcode = max(itemcode) + 1 from dbo.tFVItemInfo where subcategory = 600
            --
			--				if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
			--					begin
			--						insert into dbo.tFVItemInfo(labelname,     itemcode, category, subcategory, equpslot, itemname, activate, toplist, grade, discount, icon, playerlv, houselv, gamecost, cashcost, buyamount, sellcost, description)
			--						                   values('staticinfo', @itemcode, '600',    '600',       '0',      @ps1_,    '0',      '0',     '0',   '0',      '16', '0',      '0',     '0',      '0',      '0',       '0',      @ps2_)
			--						insert into dbo.tFVSystemRouletteFresh( itemcode, famelvmin, famelvmax, cashcostcost, cashcostper, cashcostsale,             packstate, packname,  comment, packstr,
			--															   groupstep1,   groupstep2,   groupstep3,   groupstep4,   groupstep5,   groupstep6,   groupstep7,   groupstep8,
			--															  gamecost, heart)
			--											     values(@itemcode, @p4_,      @p5_,      @p6_,         @p7_,        @p6_ - (@p6_ * @p7_)/100, @p8_,      @ps1_,     @ps2_,   @ps3_,
			--											     		 	  @groupstep1,  @groupstep2,  @groupstep3,  @groupstep4,  @groupstep5,  @groupstep6,  @groupstep7,  @groupstep8,
			--											     			  @p9_,     @p10_)
			--					end
			--			end
			--		--else
			--		--	begin
			--		--		select 'Same name'
			--		--	end
            --
			--		select @RESULT_SUCCESS 'rtn'
			--	end
			--else if(@p2_ = 43)
			--	begin
			--		-------------------------------------------------
			--		-- 교배뽑기 (수정)
			--		-------------------------------------------------
            --
			--		-- 1. 커서 생성
			--		declare curRoulFreshUpdate Cursor for
			--		select * FROM dbo.fnu_SplitTwo(';', ':', @ps3_)
            --
			--		-- 2. 커서오픈
			--		open curRoulFreshUpdate
            --
			--		-- 3. 커서 사용
			--		Fetch next from curRoulFreshUpdate into @packkind, @packvalue
			--		while @@Fetch_status = 0
			--			Begin
			--				--select 'DEBUG ', @packkind kind, @packvalue packvalue
			--				if(@packkind = 1) 		set @groupstep1 = @packvalue
			--				else if(@packkind = 2) 	set @groupstep2 = @packvalue
			--				else if(@packkind = 3) 	set @groupstep3 = @packvalue
			--				else if(@packkind = 4) 	set @groupstep4 = @packvalue
			--				else if(@packkind = 5) 	set @groupstep5 = @packvalue
			--				else if(@packkind = 6) 	set @groupstep6 = @packvalue
			--				else if(@packkind = 7) 	set @groupstep7 = @packvalue
			--				else if(@packkind = 8) 	set @groupstep8 = @packvalue
            --
			--				Fetch next from curRoulFreshUpdate into @packkind, @packvalue
			--			end
            --
			--		-- 4. 커서닫기
			--		close curRoulFreshUpdate
			--		Deallocate curRoulFreshUpdate
            --
			--		update dbo.tFVSystemRouletteFresh
			--				set
			--					famelvmin	= @p4_,
			--					famelvmax	= @p5_,
			--					cashcostcost	 	= @p6_,
			--					cashcostper			= @p7_,
			--					cashcostsale	= @p6_ - (@p6_ * @p7_)/100,
			--					gamecost 	= @p9_,
			--					heart 		= @p10_,
			--					packstate	= @p8_,
			--					packname	= @ps1_,
			--					comment		= @ps2_,
			--					packstr 	= @ps3_,
			--					groupstep1	= @groupstep1,   	groupstep2	= @groupstep2,
			--					groupstep3	= @groupstep3,		groupstep4	= @groupstep4,
			--					groupstep5	= @groupstep5,		groupstep6	= @groupstep6,
			--					groupstep7	= @groupstep7,		groupstep8	= @groupstep8
			--		where idx = @p3_
            --
			--		select @RESULT_SUCCESS 'rtn'
			--	end
			if(@p2_ = 45)
				begin
					-- 1. 커서 생성
					declare curYabauInsert Cursor for
					select * FROM dbo.fnu_SplitTwoStr(';', ':', @ps3_)

					-- 2. 커서오픈.
					open curYabauInsert

					-- 3. 커서 사용
					Fetch next from curYabauInsert into @packkind, @yabau
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @yabau yabau
							if(@packkind = 1)
								begin
									select @pack11 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack12 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack13 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack14 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							else if(@packkind = 2)
								begin
									select @pack21 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack22 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack23 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack24 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							else if(@packkind = 3)
								begin
									select @pack31 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack32 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack33 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack34 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							else if(@packkind = 4)
								begin
									select @pack41 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack42 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack43 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack44 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							else if(@packkind = 5)
								begin
									select @pack51 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack52 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack53 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack54 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							else if(@packkind = 6)
								begin
									select @pack61 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack62 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack63 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack64 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
								end
							Fetch next from curYabauInsert into @packkind, @yabau
						end

					-- 4. 커서닫기
					close curYabauInsert
					Deallocate curYabauInsert


					if(exists(select top 1 * from dbo.tFVSystemYabau where ukcode = @ps2_))
						begin
							--select 'DEBUG > 수정모드'
							update dbo.tFVSystemYabau
								set
									famelvmin	= @p4_,	--
									famelvmax	= @p5_, --
									saleper		= @p7_, --
									packstate	= @p8_, --
									packname	= @ps1_, --
									comment		= @ps2_,
									packstr		= @ps3_, --
									pack11	= @pack11, pack12	= @pack12, pack13	= @pack13, pack14	= @pack14,
									pack21	= @pack21, pack22	= @pack22, pack23	= @pack23, pack24	= @pack24,
									pack31	= @pack31, pack32	= @pack32, pack33	= @pack33, pack34	= @pack34,
									pack41	= @pack41, pack42	= @pack42, pack43	= @pack43, pack44	= @pack44,
									pack51	= @pack51, pack52	= @pack52, pack53	= @pack53, pack54	= @pack54,
									pack61	= @pack61, pack62	= @pack62, pack63	= @pack63, pack64	= @pack64
							where ukcode = @ps2_

							set @itemcode = 70000
							select @itemcode = max(itemcode) + 1 from dbo.tFVItemInfo where subcategory = 700

							if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
								begin
									--select 'DEBUG > 입력모드'
									insert into dbo.tFVItemInfo(labelname,     itemcode, category, subcategory, equpslot, itemname, activate, toplist, grade, discount, icon, playerlv, houselv, gamecost, cashcost, buyamount, sellcost, description)
									                   values('staticinfo', @itemcode, '700',    '700',       '0',      @ps1_,    '0',      '0',     '0',   '0',      '16', '0',      '0',     '0',      '0',      '0',       '0',      @ps2_)
								end
						end
					else if(not exists(select top 1 * from dbo.tFVSystemYabau where packstr = @ps3_))
						begin
							--select 'DEBUG 시스템 야바위추가.'
							-- 정보수집용 추가 > 아이템 테이블 추가하기.
							set @itemcode = 70000
							select @itemcode = max(itemcode) + 1 from dbo.tFVItemInfo where subcategory = 700

							if(not exists(select top 1 * from dbo.tFVItemInfo where itemcode = @itemcode))
								begin
									--select 'DEBUG > 입력모드'
									insert into dbo.tFVItemInfo(labelname,     itemcode, category, subcategory, equpslot, itemname, activate, toplist, grade, discount, icon, playerlv, houselv, gamecost, cashcost, buyamount, sellcost, description)
									                   values('staticinfo', @itemcode, '700',    '700',       '0',      @ps1_,    '0',      '0',     '0',   '0',      '16', '0',      '0',     '0',      '0',      '0',       '0',      @ps2_)

									insert into dbo.tFVSystemYabau(itemcode, famelvmin, famelvmax, saleper, packstate, packname,  ukcode, packstr, pack11, pack12, pack13, pack14, pack21, pack22, pack23, pack24, pack31, pack32, pack33, pack34, pack41, pack42, pack43, pack44, pack51, pack52, pack53, pack54, pack61, pack62, pack63, pack64)
									values(                     @itemcode, @p4_,      @p5_,      @p7_,         @p8_,    @ps1_,   @ps2_,   @ps3_,  @pack11,@pack12,@pack13,@pack14,@pack21,@pack22,@pack23,@pack24,@pack31,@pack32,@pack33,@pack34,@pack41,@pack42,@pack43,@pack44,@pack51,@pack52,@pack53,@pack54,@pack61,@pack62,@pack63,@pack64)

								end
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 46)
				begin
					-------------------------------------------------
					-- 패키지 상품정보.(상품, 등록리스트)
					-------------------------------------------------
					select count(*) cnt from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)

					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 51, 22, 23, 16, 19)
					order by itemcode asc

					select top 200 * from dbo.tFVSystemYabau order by packstate desc, famelvmin desc, famelvmax desc, idx desc
				end
			if(@p2_ = 47)
				begin
					-- 1. 커서 생성
					declare curYabauInsert Cursor for
					select * FROM dbo.fnu_SplitTwoStr(';', ':', @ps3_)

					-- 2. 커서오픈.
					open curYabauInsert

					-- 3. 커서 사용
					Fetch next from curYabauInsert into @packkind, @yabau
					while @@Fetch_status = 0
						Begin
							--select 'DEBUG ', @packkind packkind, @yabau yabau
							if(@packkind = 1)
								begin
									select @pack11 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack12 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack13 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack14 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack11 pack11, @pack12 pack12, @pack13 pack13, @pack14 pack14
								end
							else if(@packkind = 2)
								begin
									select @pack21 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack22 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack23 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack24 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack21 pack21, @pack22 pack22, @pack23 pack23, @pack24 pack24
								end
							else if(@packkind = 3)
								begin
									select @pack31 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack32 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack33 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack34 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack31 pack31, @pack32 pack32, @pack33 pack33, @pack34 pack34
								end
							else if(@packkind = 4)
								begin
									select @pack41 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack42 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack43 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack44 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack41 pack41, @pack42 pack42, @pack43 pack43, @pack44 pack44
								end
							else if(@packkind = 5)
								begin
									select @pack51 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack52 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack53 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack54 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack51 pack51, @pack52 pack52, @pack53 pack53, @pack54 pack54
								end
							else if(@packkind = 6)
								begin
									select @pack61 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 0
									select @pack62 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 1
									select @pack63 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 2
									select @pack64 = listidx from dbo.fnu_SplitOne(':', @yabau) where idx = 3
									--select 'DEBUG ', @pack61 pack61, @pack62 pack62, @pack63 pack63, @pack64 pack64
								end
							Fetch next from curYabauInsert into @packkind, @yabau
						end

					-- 4. 커서닫기
					close curYabauInsert
					Deallocate curYabauInsert

					update dbo.tFVSystemYabau
						set
							famelvmin	= @p4_,
							famelvmax	= @p5_,
							saleper	= @p7_,
							packstate	= @p8_,
							packname	= @ps1_,
							comment		= @ps2_,
							packstr		= @ps3_,
							packmarket	= @ps4_,
							pack11	= @pack11, pack12	= @pack12, pack13	= @pack13, pack14	= @pack14,
							pack21	= @pack21, pack22	= @pack22, pack23	= @pack23, pack24	= @pack24,
							pack31	= @pack31, pack32	= @pack32, pack33	= @pack33, pack34	= @pack34,
							pack41	= @pack41, pack42	= @pack42, pack43	= @pack43, pack44	= @pack44,
							pack51	= @pack51, pack52	= @pack52, pack53	= @pack53, pack54	= @pack54,
							pack61	= @pack61, pack62	= @pack62, pack63	= @pack63, pack64	= @pack64
					where idx = @p3_

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 31)
				begin
					set @cnt 	= 0
					set @cnt2 	= 0
					select @cnt = isnull(max(idx)+1 - min(idx), 0) from dbo.tFVUserPushAndroid
					select @cnt2 = isnull(max(idx)+1 - min(idx), 0) from dbo.tFVUserPushiPhone
					select @RESULT_SUCCESS 'rtn', @cnt cnt, @cnt2 cnt2

					select top 50 * from dbo.tFVUserPushSendInfo order by idx desc
				end
			else if(@p2_ in (32, 32000))
				begin
					----------------------------------------------------
					-- 푸쉬를 허락한 유저에 한해서 푸쉬를 발송한다.
					----------------------------------------------------
					--set @gameid		= @ps1_
					--set @adminid		= @ps2_
					set @recepushid 	= ''
					select @recepushid = pushid, @market = market from dbo.tFVUserMaster
					where gameid = @gameid and kkopushallow = 1

					-- select 'DEBUG ', @adminid sendid, @gameid receid, @recepushid recepushid, @market market, @p3_ sendkind, 99 msgpush_id, @ps3_ msgtitle, @ps4_ msgmsg, @ps5_ msgaction
					if(@recepushid != '')
						begin
							if(@market = @IPHONE)
								begin
									insert into dbo.tFVUserPushiPhone(  sendid,  receid,  recepushid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction, scheduleTime)
									values(							@adminid, @gameid, @recepushid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_, @ps6_)

									exec spu_FVDayLogInfoStatic @market, 51, 1				-- 일 push iphone
								end
							else
								begin
									insert into dbo.tFVUserPushAndroid( sendid,  receid,  recepushid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction, scheduleTime)
									values(							@adminid, @gameid, @recepushid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_, @ps6_)

									exec spu_FVDayLogInfoStatic @market, 50, 1				-- 일 push android
								end
						end

					if(@p2_ != 32000)
						begin
							select @RESULT_SUCCESS 'rtn'
						end
				end
			else if(@p2_ = 33)
				begin

					-- select 'DEBUG ', @adminid sendid, @gameid receid, @p4_ market, @p3_ sendkind, 99 msgpush_id, @ps3_ msgtitle, @ps4_ msgmsg, @ps5_ msgaction
					if(@p4_ = 0)
						begin
							set @cnt = 0
							set @cnt2 = 0
							-----------------------------
							--	iPhone
							-----------------------------
							set @p4_ = @IPHONE
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushiPhone(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                 pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0  and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 51, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	Android Google
							-----------------------------
							set @p4_ = @GOOGLE
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	Android SKT
							-----------------------------
							set @p4_ = @SKT
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt


							-----------------------------
							--	Android KT
							-----------------------------
							set @p4_ = @KT
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	Android LGT
							-----------------------------
							set @p4_ = @LGT
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	Android NHN
							-----------------------------
							set @p4_ = @NHN
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	메세지 내용기록
							-----------------------------
							insert into dbo.tFVUserPushSendInfo(adminid,  sendkind, market, msgtitle, msgmsg,  cnt)
							values(				  	  		 @adminid,      @p3_,      0,    @ps3_,  @ps4_, @cnt2)

						end
					else if(@p4_ = @IPHONE)
						begin
							set @cnt = 0
							set @cnt2 = 0
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushiPhone(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                 pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 51, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	메세지 내용기록
							-----------------------------
							insert into dbo.tFVUserPushSendInfo(adminid,  sendkind, market, msgtitle, msgmsg,  cnt)
							values(				  	  		 @adminid,      @p3_,   @p4_,    @ps3_,  @ps4_, @cnt2)
						end
					else
						begin
							set @cnt = 0
							set @cnt2 = 0
							-- receid > gameid가 들어가야하나 중복이 발생때문에 adminid로 대처한다.
							insert into dbo.tFVUserPushAndroid(recepushid,   sendid, receid, sendkind, msgpush_id, msgtitle, msgmsg, msgaction)
								select distinct                  pushid, @adminid, gameid,     @p3_,         99,    @ps3_,  @ps4_,     @ps5_ from dbo.tFVUserMaster
									where market = @p4_ and pushid is not null and len(pushid) > 20 and deletestate = 0 and blockstate = 0 and kkopushallow = 1
									--and gameid in ('guest90579', 'guest90579')

							set @cnt = @@ROWCOUNT
							exec spu_FVDayLogInfoStatic @p4_, 50, @cnt				-- 일 push iphone
							set @cnt2 = @cnt2 + @cnt

							-----------------------------
							--	메세지 내용기록
							-----------------------------
							insert into dbo.tFVUserPushSendInfo(adminid,  sendkind, market, msgtitle, msgmsg,  cnt)
							values(				  	  		 @adminid,      @p3_,   @p4_,    @ps3_,  @ps4_, @cnt2)
						end
					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 34)
				begin
					----------------------------------------------------
					-- 푸쉬삭제
					----------------------------------------------------
					if(exists (select msgtitle from dbo.tFVUserPushSendInfo where idx = @p3_))
						begin
							delete from dbo.tFVUserPushiPhone  where msgtitle = (select msgtitle from dbo.tFVUserPushSendInfo where idx = @p3_)
							delete from dbo.tFVUserPushAndroid  where msgtitle = (select msgtitle from dbo.tFVUserPushSendInfo where idx = @p3_)
							update dbo.tFVUserPushSendInfo set cnt = 0 where idx = @p3_
						end

					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 35)
				begin
					----------------------------------------------------
					-- 푸쉬삭제
					----------------------------------------------------
					delete from dbo.tFVUserPushiPhone
					delete from dbo.tFVUserPushAndroid

					select @RESULT_SUCCESS 'rtn'
				end
			--else if(@p2_ = 36)
			--	begin
			--		----------------------------------------------------
			--		-- 푸쉬로고 삭제
			--		----------------------------------------------------
			--		set @idx = 0
			--		select @idx  = max(idx) from dbo.tFVUserPushiPhoneLog
			--		select @idx2 = min(idx) from dbo.tFVUserPushiPhoneLog
			--		while(@idx > @idx2)
			--			begin
			--				delete from dbo.tFVUserPushiPhoneLog
			--				where idx >= @idx - 1000 and idx <= @idx
			--				set @idx =  @idx - 1000
			--			end
            --
            --
			--		set @idx = 0
			--		select @idx  = max(idx) from dbo.tFVUserPushAndroidLog
			--		select @idx2 = min(idx) from dbo.tFVUserPushAndroidLog
			--		while(@idx > @idx2)
			--			begin
			--				delete from dbo.tFVUserPushAndroidLog
			--				where idx >= @idx - 1000 and idx <= @idx
			--				set @idx =  @idx - 1000
			--			end
            --
			--		select @RESULT_SUCCESS 'rtn'
			--	end
			else if(@p2_ = 50)
				begin
					-------------------------------------------------
					-- 패키지 상품정보.(상품, 등록리스트)
					-------------------------------------------------
					select count(*) cnt from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 50, 51, 22, 23, 16, 19)

					select * from dbo.tFVItemInfo
					where subcategory in (1, 2, 3, 8, 9, 44, 11, 12, 13, 15, 40, 41, 42, 50, 51, 22, 23, 16, 19)
					order by itemcode asc

					-------------------------------------------------
					-- 시간제 이벤트 정보.
					-------------------------------------------------
					select * from dbo.tFVEventMaster where idx = 1

					select top 200 u.*, i.itemname from dbo.tFVEventSub u join
						(select * from dbo.tFVItemInfo) i
							on u.eventitemcode = i.itemcode
					order by eventidx desc
				end
			else if(@p2_ = 51)
				begin
					update dbo.tFVEventMaster set eventstatemaster = case when eventstatemaster = 0 then 1 else 0 end where idx = 1
					select @RESULT_SUCCESS 'rtn'
				end
			else if(@p2_ = 52)
				begin
					set @subkind		= @p3_
					set @idx			= @p4_
					set @itemcode 		= @p5_
					set @eventstatedaily= @p6_
					set @eventsender	= @ps3_
					set @startdate		= @ps4_
					set @enddate		= @ps5_
					set @eventpushtitle	= @ps9_
					set @eventpushmsg	= @ps10_
					if(@subkind = 1)
						begin
							if(@itemcode != -1)
								begin
									insert into dbo.tFVEventSub(eventitemcode,  eventsender,  eventstart, eventend,  eventpushtitle,  eventpushmsg,  eventstatedaily)
									values(                       @itemcode, @eventsender,  @startdate, @enddate, @eventpushtitle, @eventpushmsg, @eventstatedaily)
								end

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@subkind = 2)
						begin
							-- 수정.
							update dbo.tFVEventSub
								set
									eventstatedaily	= @eventstatedaily,
									eventitemcode 	= @itemcode,
									eventsender		= @eventsender,
									eventstart 		= @startdate,
									eventend		= @enddate,
									eventpushtitle	= @eventpushtitle,
									eventpushmsg	= @eventpushmsg
							where eventidx = @idx

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@subkind = 3)
						begin
							update dbo.tFVEventSub set eventstatedaily = case when eventstatedaily = 0 then 1 else 0 end where eventidx = @idx

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@subkind = 4)
						begin
							update dbo.tFVEventSub set eventpushstate = case when eventpushstate = 0 then 1 else 0 end where eventidx = @idx

							select @RESULT_SUCCESS 'rtn'
						end
					else if(@subkind = 5)
						begin
							if(not exists(select top 1 * from dbo.tFVEvnetUserGetLog where eventidx = @idx))
								begin
									delete from dbo.tFVEventSub where eventidx = @idx
								end

							select @RESULT_SUCCESS 'rtn'
						end
				end
			else if(@p2_ = 53)
				begin
					if(isnull(@gameid, '') = '')
						begin
							set @idxPage	= @p7_
							select @idx = (isnull(max(idx), 1)) from dbo.tFVEvnetUserGetLog

							set @maxPage	= @idx / @PAGE_LINE
							set @maxPage 	= @maxPage + case when (@idx % @PAGE_LINE != 0) then 1 else 0 end
							set @page		= case
												when (@idxPage <= 0)			then 1
												when (@idxPage >  @maxPage)	then @maxPage
												else @idxPage
											end
							set @idx		= @idx - (@page - 1) * @PAGE_LINE

							select top 100 @maxPage maxPage, @page page, u.*, i.itemname from dbo.tFVEvnetUserGetLog u join
								(select * from dbo.tFVItemInfo) i
									on u.eventitemcode = i.itemcode
							where u.idx <= @idx order by u.idx desc
						end
					else
						begin
							set @maxPage	= 1
							set @page		= 1

							select top 100 @maxPage maxPage, @page page, u.*, i.itemname from dbo.tFVEvnetUserGetLog u join
								(select * from dbo.tFVItemInfo) i
									on u.eventitemcode = i.itemcode
							where gameid = @gameid
							order by u.idx desc
						end
				end

		end

	------------------------------------------------
	--	완료
	------------------------------------------------
	set nocount off
End
